[{"id":14763,"title":"Volkswagen recalls thousands of SQ5 vehicles","link":"https://www.motorsafety.org/volkswagen-recalls-thousands-of-sq5-vehicles/","status":"publish","slug":"volkswagen-recalls-thousands-of-sq5-vehicles","excerpt":"<p>Detroit, MI — July 30, 2015 — According to documents published on the National Highway Traffic Safety Administration (NHTSA) website, Volkswagen Group of America has recalled thousands of Audi SQ5 vehicles that may suffer an defect that shuts down electric power steering for the driver during inopportune times. Although the source describes the 5,625 vehicles</p>\n","description":"<p><em>Detroit, MI — July 30, 2015 —</em> According to documents published on the National Highway Traffic Safety Administration (NHTSA) website, Volkswagen Group of America has recalled thousands of Audi SQ5 vehicles that may suffer an defect that shuts down electric power steering for the driver during inopportune times. Although the source describes the 5,625 vehicles as having been &#8220;potentially affected,&#8221; it also states that 100 percent are estimated to have defect.</p>\n<p>The recall action dates back to this February, when power steering warranty complaints were issued in regards to the cold weather, and concerns SQ5&#8217;s produced in two separate timeframes: between May 22 2013 to May 28 2014, and between May 20 2014 and April 14 2015. The recall was also spurred on after a vehicle inquiry issued from Transport Canada in March.</p>\n<p><a href=\"http://www-odi.nhtsa.dot.gov/acms/cs/jaxrs/download/doc/UCM482455/RCLRPT-15V452-5494.PDF\">As the safety recall report describes</a>, the steering failure poses a special threat in low speeds, in which it will be harder to control the vehicles. Fortunately, owners can count on some warning signs to preemptively take action.</p>\n<p>&#8220;If a customer sees a power steering indicator light come on in the instrument panel and the vehicle experiences a loss of power steering assist, they should immediately contact the nearest authorized dealer or qualified workshop in order to have the vehicle inspected,&#8221; the source states. The remedy will include an update to the power steering software in these vehicles.</p>\n<p>When defects in vehicles only show themselves in certain circumstance, an owner can accidentally put themselves in danger without realizing it. Auto recall statements need to reach everyone at possible risk, and entrusting this task to professionals is one way to ensure it gets done correctly.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=4291","createdAt":"2015-07-30T10:04:08.000Z","date_gmt":"2015-07-30T23:49:08.000Z","updatedAt":"2020-10-18T21:10:11.000Z","modified_gmt":"2020-10-19T10:55:11.000Z","display_date":"July 30, 2015","sticky":false,"recall":true,"authors":[{"id":10,"name":"Recall Masters","slug":"recallmasters_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2015,"month":7,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2015/07/2017-Audi-SQ5-768x512.jpg","alt_text":"","cld_public_id":"2017-Audi-SQ5","category":{"id":6,"name":"Volkswagen","slug":"volkswagen-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/volkswagen.png"},"tags":[],"categories":[{"id":6,"name":"Volkswagen","slug":"volkswagen-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/volkswagen.png"}]},{"id":14765,"title":"Subaru recalls thousands of vehicles for airbag sensor issue","link":"https://www.motorsafety.org/subaru-recalls-thousands-of-vehicles-for-airbag-sensor-issue/","status":"publish","slug":"subaru-recalls-thousands-of-vehicles-for-airbag-sensor-issue","excerpt":"<p>Detroit, MI — July 27, 2015 — Although there have been many reports of issues with airbag deployment systems themselves, several thousand Subaru Imprezas have suffered from a defect outside the airbag itself that makes it difficult to activate the airbags when they are needed. Sensors in these vehicles are overly sensitive and liable to</p>\n","description":"<p><em>Detroit, MI — July 27, 2015 —</em> Although there have been many reports of issues with airbag deployment systems themselves, several thousand Subaru Imprezas have suffered from a defect outside the airbag itself that makes it difficult to activate the airbags when they are needed. Sensors in these vehicles are overly sensitive and liable to be shut off during unexpected and seemingly benign situations.</p>\n<p>Fortunately, the defect doesn&#8217;t come completely without warning signs. Top Speed&#8217;s Jonathan Lopez reports that an airbag warning light <a href=\"http://www.topspeed.com/cars/car-news/subaru-recalls-32k-imprezas-to-fix-airbag-problems-ar170466.html\">will appear on the dashboard</a> if the sensor has been compromised. Affected Imprezas were built between 2011 and 2012, and featured poor calibration, making the vehicle sensors unable to respond in different conditions.</p>\n<p>The manufacturer has, at the urging of the National Highway Traffic Safety Administration (NHTSA) begun contacting owners. While no injuries have been connected to this issue, the company has received 26 different complaints related to it.</p>\n<p>Lopez describes some of the ways that the sensor might be accidentally deactivated during the drive.</p>\n<p>&#8220;These conditions include a passenger touching an electrically grounded part of the car (like the metal seat adjuster), using an electronic device (like a phone) plugged into the accessory power outlet, or sitting with damp clothes,&#8221; he said. &#8220;It&#8217;s also reported that a cell phone left on the seat or a splash of water on the seat could trigger the failure.&#8221; He notes that this is a comparatively minor recall, especially considering the much-publicized Takata efforts.</p>\n<p>Coupled with other measures for addressing recalls, the right marketing systems will generate a high level of engagement through accurate and comprehensive statements.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=4303","createdAt":"2015-07-27T11:28:59.000Z","date_gmt":"2015-07-28T01:13:59.000Z","updatedAt":"2020-10-18T18:45:16.000Z","modified_gmt":"2020-10-19T08:30:16.000Z","display_date":"July 27, 2015","sticky":false,"recall":true,"authors":[{"id":10,"name":"Recall Masters","slug":"recallmasters_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2015,"month":7,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2015/07/Silver-Subaru-Impreza-STI-768x512.jpg","alt_text":"","cld_public_id":"Silver-Subaru-Impreza-STI","category":{"id":24,"name":"Subaru","slug":"subaru-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/subaru_ms.png"},"tags":[],"categories":[{"id":24,"name":"Subaru","slug":"subaru-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/subaru_ms.png"}]},{"id":14766,"title":"More than 1 million Chrysler vehicles recalled for hacking concern","link":"https://www.motorsafety.org/more-than-1-million-chrysler-vehicles-recalled-for-hacking-concern/","status":"publish","slug":"more-than-1-million-chrysler-vehicles-recalled-for-hacking-concern","excerpt":"<p>Detroit, MI — July 26, 2015 — Vehicle recalls can occur not just because of faulty components, but out of fears for outside attacks on vulnerable systems. According to the Detroit Free Press, Fiat Chrysler Automobiles&#8217; (FCA) latest recall addresses cybersecurity issues within affected vehicles that could have massively damaging consequences for owners. Dodge Ram,</p>\n","description":"<p><em>Detroit, MI — July 26, 2015 —</em> Vehicle recalls can occur not just because of faulty components, but out of fears for outside attacks on vulnerable systems. According to the Detroit Free Press, Fiat Chrysler Automobiles&#8217; (FCA) latest recall addresses cybersecurity issues within affected vehicles that could have massively damaging consequences for owners. Dodge Ram, Jeep Grand Cherokee and other vehicles from model years 2013 to 2015 reportedly have potentially dangerous software flaws in their &#8220;radios.&#8221;</p>\n<p>While most of the recalls this blog has covered concern internal problems with defective autos, this issue is a concern because of the way it could potentially be exploited by hackers. The official recall acknowledgement from the National Highway Traffic Safety Administration (NHTSA) states that outsiders could gain &#8220;unauthorized remote modification&#8221; of vehicle systems through these vulnerabilities.</p>\n<p>As alarming as that may sound, there are some factors that mitigate the potential danger somewhat. For one, the manufacturer has already taken steps to prevent outsiders from accessing the vehicle, leading to real risk for only 3 percent of mobile hot spot subscribers.</p>\n<p>The recall safety report issued for this action also emphasizes the <a href=\"http://www-odi.nhtsa.dot.gov/acms/cs/jaxrs/download/doc/UCM483036/RCLRPT-15V461-9407.pdf\">unlikelihood that an exploit might take place</a>, given how much knowledge is needed to put one into action. The remedy for this problem is a software update that can be downloaded to a USB drive.</p>\n<p>&#8220;Some 2013-2015 MY vehicles equipped with RA3 or RA4 model radios have certain software security vulnerabilities which could allow unauthorized third-party access to some networked vehicle control systems,&#8221; the source says. &#8220;Exploitation of the software security vulnerabilities required extensive technical knowledge, physical access to a subject vehicle and a long period of time to write applicable code.&#8221;</p>\n<p>Along with acknowledgment and government action, recalls should be supported through education and informative services that encourage drivers and owners to respond correctly.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=4306","createdAt":"2015-07-26T11:04:00.000Z","date_gmt":"2015-07-27T00:49:00.000Z","updatedAt":"2020-10-28T02:03:02.000Z","modified_gmt":"2020-10-28T15:48:02.000Z","display_date":"July 26, 2015","sticky":false,"recall":true,"authors":[{"id":10,"name":"Recall Masters","slug":"recallmasters_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2015,"month":7,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2015/07/silver-2013-Dodge-Ram-SRT-10-768x512.jpg","alt_text":"","cld_public_id":"silver-2013-Dodge-Ram-SRT-10","category":{"id":20,"name":"Chrysler","slug":"chrysler-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/chrysler_RM.png"},"tags":[],"categories":[{"id":20,"name":"Chrysler","slug":"chrysler-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/chrysler_RM.png"},{"id":7,"name":"Dodge","slug":"dodge-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/dodge.png"},{"id":33,"name":"Jeep","slug":"jeep-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/jeep_ms.png"},{"id":9,"name":"RAM","slug":"ram-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/11/RAM.png"}]},{"id":14767,"title":"Parking brake worries lead to new Ford recall","link":"https://www.motorsafety.org/parking-brake-worries-lead-to-new-ford-recall/","status":"publish","slug":"parking-brake-worries-lead-to-new-ford-recall","excerpt":"<p>Detroit, MI — July 24, 2015 — Nearly 8,000 vehicles in North America are affected by a new Ford recall that looks to address parking brake concerns. The manufacturer is addressing a series of autos, including Explorers, Tauruses and Lincoln sedans. Carscoops reported on the action, which hopes to remedy a failure that would keep</p>\n","description":"<p><em>Detroit, MI — July 24, 2015 —</em> Nearly 8,000 vehicles in North America are affected by a new Ford recall that looks to address parking brake concerns. The manufacturer is addressing a series of autos, including Explorers, Tauruses and Lincoln sedans. Carscoops reported on the action, which hopes to remedy a failure that would keep the parking brake from fully engaging.</p>\n<p>Most of the vehicles included in this recall are in the United States, while around 800 are in Canada and one solitary vehicle is in Mexico. All of the defects originate from the same Chicago Assembly Plant where these models were first constructed earlier this year.</p>\n<p>Though the company has said that no injuries have been reported from this fault yet, the affected vehicles will have their parking brake controls replaced for free after an inspection. In the official press release on the action, Ford provided <a href=\"https://media.ford.com/content/fordmedia/fna/us/en/news/2015/07/22/ford-issues-safety-compliance-recall-in-north-america.html\">the details on the individual vehicles</a> being recalled. These include &#8220;certain 2015-2016 Ford Explorer, and certain 2015 Taurus and Flex, as well as Lincoln MKS and MKT vehicles.&#8221;</p>\n<p>&#8220;In these vehicles, the parking brake might not engage fully, which is a compliance issue with FMVSS 135 regarding brake systems,&#8221; the statement continues. Earlier this month, Ford also issued a recall for hundreds of thousands of different vehicles, also with for the 2015 model year, due to an issue that prevents the engine from turning off, even after the owner has pressed the &#8220;stop&#8221; button.</p>\n<p>All recalls are only as effective as the means of alerting customers and dealers to problems they need to address and the ways to do it. Proper systems for proliferating statements are a crucial first step to compliance and safety.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=4309","createdAt":"2015-07-24T12:17:13.000Z","date_gmt":"2015-07-25T02:02:13.000Z","updatedAt":"2020-10-18T18:29:49.000Z","modified_gmt":"2020-10-19T08:14:49.000Z","display_date":"July 24, 2015","sticky":false,"recall":true,"authors":[{"id":10,"name":"Recall Masters","slug":"recallmasters_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2015,"month":7,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2015/07/shutterstock_1195585930-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_1195585930","category":{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"},"tags":[],"categories":[{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"}]},{"id":14768,"title":"General Motors recalls small number of cars for inner tie rod problem","link":"https://www.motorsafety.org/general-motors-recalls-small-number-of-cars-for-inner-tie-rod-problem/","status":"publish","slug":"general-motors-recalls-small-number-of-cars-for-inner-tie-rod-problem","excerpt":"<p>Detroit, MI — July 22, 2015 — While this blog has noted before that auto recall success is vital no matter large or small a recall is, General Motors has launched a recall that is relatively small by most recall standards. According to Transport Evolved, the manufacturer actually recalled eleven cars for a steering issue</p>\n","description":"<p><em>Detroit, MI — July 22, 2015 —</em> While this blog has noted before that auto recall success is vital no matter large or small a recall is, General Motors has launched a recall that is relatively small by most recall standards. According to Transport Evolved, the manufacturer actually <a href=\"https://transportevolved.com/2015/07/20/smallest-recall-ever-2015-chevrolet-volt-involved-in-ten-car-steering-recall/\">recalled eleven cars</a> for a steering issue related to possible loose tie rods, but among these is what the source described as a &#8220;single solitary 2014 Chevrolet Volt electric car.&#8221; The recall also includes a lone Canadian-Market 2014 Chevrolet Cruze.</p>\n<p>It isn&#8217;t just the small number of vehicles involved that makes this recall notable. Model years range between 2014 and 2015, with the Volt belonging to the former. The unsecured rod could detach from the steering gear entirely, due to a bolt that wasn&#8217;t fastened properly during assembly. Sometime this month, the company will notify owners as dealers replace the affected steering systems.</p>\n<p>Writing for the source, Nikki Gordon-Bloomfield calls this action &#8220;a particularly good illustration of how automakers must notify the correct authorities of a manufacturing defect — no matter how small.&#8221; She also compares it to a similarly limited recall Nissan issued last year that only applied to hundreds of vehicles, as opposed to the sometimes millions included in major efforts.</p>\n<p>&#8220;Both cases highlight how hard automakers and government agencies work to ensure that the car you drive is as safe as possible,&#8221; she says.&#8221;<br />\nIn the same vein, dealers and owners need to trust the recall information they receive and also receive it in a timely manner. With accurate data and free related services, Recall Masters is an ideal assistant to any recall effort, major or minor.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=4312","createdAt":"2015-07-22T08:05:13.000Z","date_gmt":"2015-07-22T13:50:13.000Z","updatedAt":"2020-10-18T18:35:43.000Z","modified_gmt":"2020-10-19T08:20:43.000Z","display_date":"July 22, 2015","sticky":false,"recall":true,"authors":[{"id":10,"name":"Recall Masters","slug":"recallmasters_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2015,"month":7,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2015/07/blue-Chevy-volt-768x512.jpg","alt_text":"","cld_public_id":"blue-Chevy-volt","category":{"id":72,"name":"GMC","slug":"gmc-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/gmc_RM.png"},"tags":[],"categories":[{"id":72,"name":"GMC","slug":"gmc-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/gmc_RM.png"}]},{"id":14769,"title":"Ferrari issues airbag recall","link":"https://www.motorsafety.org/ferrari-issues-airbag-recall/","status":"publish","slug":"ferrari-issues-airbag-recall","excerpt":"<p>Maranello, Italy — July 20, 2015 — With so much being publicized about the Takata airbag inflator recall efforts, it&#8217;s become worth noting when a new manufacturer or model is added to the growing list of affected suppliers. Yet another major vehicle name involved with Takata-related airbag issues is Ferrari North America. Although it&#8217;s only</p>\n","description":"<p><em>Maranello, Italy — July 20, 2015 —</em> With so much being publicized about the Takata airbag inflator recall efforts, it&#8217;s become worth noting when a new manufacturer or model is added to the growing list of affected suppliers. Yet another major vehicle name involved with Takata-related airbag issues is Ferrari North America.</p>\n<p>Although it&#8217;s only recalling a fraction of the number of autos recalled internationally, Ferrari has acknowledged a faulty issue, which may deploy the airbag incorrectly during impact.<br />\nWhile the affected airbags were supplied by Takata, this particular recall is different from the burn hazard associated with the faulty deflators in other models, and the manufacturer is insisting that this risk is due to improper assembly. To fix this, dealers are going to replace the Driver&#8217;s Side Air Bag Module starting at the end of this month.</p>\n<p>A spokesperson for Ferrari told Agence France-Presse that <a href=\"http://www.businessinsider.com/afp-ferrari-recalls-2600-cars-globally-over-airbags-risk-2015-7\">the faulty airbags are limited to this recall action</a>, to avoid confusion.</p>\n<p>&#8220;The issue is a possible production defect in a component inside the airbags, which were fitted to around 2,600 cars,&#8221; this person said. &#8220;This issue is not related to the other recall made by other manufactures for Takata airbags,&#8221; they added. According to official documents submitted through the National Highway Traffic Safety Administration (NHTSA), the recalled encompasses &#8220;Ferrari 458 Italia, 458 Spider, 458 Speciale, 458 Speciale A, California T, FF, F12 Berlinetta, and LaFerrari&#8221; vehicles made for model year 2015.</p>\n<p>By employing effective recall statement measures, auto companies have greater assurance that each action will be taken seriously and be distinguished when there are several other competing recalls for similar defects, especially those related to the same companies and manufacturers.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=4315","createdAt":"2015-07-20T08:18:19.000Z","date_gmt":"2015-07-20T14:03:19.000Z","updatedAt":"2020-10-18T23:24:34.000Z","modified_gmt":"2020-10-19T13:09:34.000Z","display_date":"July 20, 2015","sticky":false,"recall":true,"authors":[{"id":10,"name":"Recall Masters","slug":"recallmasters_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2015,"month":7,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2015/07/2013-Red-Ferrari-458-Italia-768x512.jpg","alt_text":"","cld_public_id":"2013-Red-Ferrari-458-Italia","category":null,"tags":[],"categories":[]},{"id":14770,"title":"More recalls come from General Motors","link":"https://www.motorsafety.org/more-recalls-come-from-general-motors/","status":"publish","slug":"more-recalls-come-from-general-motors","excerpt":"<p>Detroit, MI — July 17, 2015 — Although this blog recently commented on a series of recalls from General Motors, more vehicles have been addressed in a new action from the same manufacturer. GM Authority reported on the issue which has spurred on this recall, which concerns the cables connecting the seatbelts inside them. Passengers</p>\n","description":"<p><em>Detroit, MI — July 17, 2015 —</em> Although this blog recently commented on a series of recalls from General Motors, more vehicles have been addressed in a new action from the same manufacturer. GM Authority reported on the issue which has <a href=\"http://gmauthority.com/blog/2015/07/general-motors-recalls-47000-units-of-chevy-caprice-and-pontiac-g8-over-seat-belt-cables/\">spurred on this recall</a>, which concerns the cables connecting the seatbelts inside them. Passengers and drivers alike may find themselves in danger due to wear and tear.</p>\n<p>More than 47,000 vehicles may potentially be affected, and includes two different groups of make and models: Chevrolet Caprices from between 2011 and 2013 and Pontiac G8&#8217;s from between 2008 and 2009.</p>\n<p>GM Authority notes that both of these models are based on the Zeta vehicle architecture. The seatbelt concern is especially important for police to observe, because Caprices are marketed largely to police departments.</p>\n<p>The Authority piece details the fix that the company recommends for taking care of the cables, which could lead to injury for vehicle occupants if not addressed.</p>\n<p>&#8220;GM will notify owners, and dealers will replace the seat belt tensioner assembly which includes the steel cable, free of charge,&#8221; the company said. &#8220;These replacement parts reposition the tensioner cable out of the path of entry into the vehicle and uses a more flexible cable, set at a more upright angle.&#8221;</p>\n<p>This problem may not be immediately apparent, which makes it all the more important that recall statements are processed correctly and issued in a way that successfully promotes the proper actions. Dealers need to have the resources ready to apply fixes and tend to the vehicles that pose any kind of danger, regardless of how visible or obvious it is to the user.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=4318","createdAt":"2015-07-17T12:10:32.000Z","date_gmt":"2015-07-18T00:55:32.000Z","updatedAt":"2020-10-19T00:44:03.000Z","modified_gmt":"2020-10-19T14:29:03.000Z","display_date":"July 17, 2015","sticky":false,"recall":true,"authors":[{"id":10,"name":"Recall Masters","slug":"recallmasters_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2015,"month":7,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2015/07/Chevrolet-Caprice-768x512.jpg","alt_text":"","cld_public_id":"Chevrolet-Caprice","category":{"id":37,"name":"GM","slug":"gm-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/gm.png"},"tags":[],"categories":[{"id":37,"name":"GM","slug":"gm-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/gm.png"}]},{"id":14771,"title":"International Prius recall concerns hundreds of thousands of vehicles","link":"https://www.motorsafety.org/international-prius-recall-concerns-hundreds-of-thousands-of-vehicles/","status":"publish","slug":"international-prius-recall-concerns-hundreds-of-thousands-of-vehicles","excerpt":"<p>Tokyo, Japan — July 16, 2015 — Toyota Motor Corporation is reportedly recalling 625,000 Prius hybrids throughout the world, and in a statement released through the company&#8217;s official website, it specified that the action concerns ECU controls within the affected vehicles. According to Reuters, most of the Priuses being recalled are in Japan, and 120,000</p>\n","description":"<p><em>Tokyo, Japan — July 16, 2015 —</em> Toyota Motor Corporation is reportedly recalling 625,000 Prius hybrids throughout the world, and in a statement released through the company&#8217;s official website, it specified that the action concerns ECU controls within the affected vehicles.</p>\n<p>According to Reuters, most of the Priuses being recalled are in Japan, and 120,000 of those vehicles are in the United States. The affected model is the Prius V, which is also known by other names, possibly adding to the inherent confusion of such a large recall effort. Model years for the defective vehicles range between 2012 and 2014.</p>\n<p>The statement says that dealers will attend to the risks by updating the software in the ECU&#8217;s. The issue poses a possible danger for transistors in these Priuses, due to overly high levels of &#8220;thermal stress&#8221; within the system. No injuries have been linked to this problem yet, but it does follow on a larger recall issued last year for more than 1 million Priuses.</p>\n<p>&#8220;If this happens, various warning lights will illuminate and the vehicle can enter a failsafe mode,&#8221; the statement says, referring to the <a href=\"http://pressroom.toyota.com/releases/toyota+recall+prius+v+july15.htm\">aftereffects of the Prius faults</a>. &#8220;In rare circumstances, the hybrid system might shut down while the vehicle is being driven, resulting in the loss of power and the vehicle coming to a stop.&#8221;</p>\n<p>The context of recall actions of this nature matters for the fixes to be applied effectively, and proper awareness and response campaigns will communicate the severity of an issue in a way that leads to real improvement and prevention. In such cases, it may be necessary to know some history of a vehicle defect in addition to the immediate dangers that a threat poses.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=4321","createdAt":"2015-07-16T11:31:10.000Z","date_gmt":"2015-07-17T01:16:10.000Z","updatedAt":"2020-10-18T21:42:14.000Z","modified_gmt":"2020-10-19T11:27:14.000Z","display_date":"July 16, 2015","sticky":false,"recall":true,"authors":[{"id":10,"name":"Recall Masters","slug":"recallmasters_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2015,"month":7,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2015/07/2019-Toyota-Prius-Prime-768x512.jpg","alt_text":"","cld_public_id":"2019-Toyota-Prius-Prime","category":{"id":17,"name":"Toyota","slug":"toyota-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/toyota_ms.png"},"tags":[],"categories":[{"id":17,"name":"Toyota","slug":"toyota-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/toyota_ms.png"}]},{"id":14758,"title":"Hybrid vehicles recalled for bad frames","link":"https://www.motorsafety.org/hybrid-vehicles-recalled-for-bad-frames/","status":"publish","slug":"hybrid-vehicles-recalled-for-bad-frames","excerpt":"<p>Your browser does not support the video tag. Spirit Lake, IA — July 15, 2015 — This month, hybrid vehicle owners may want to reinspect their cars if they own a GEM from Polaris Industries. The manufacturer is recalling 628 vehicles that may have been affected by a faulty frame weld.  According to the NHTSA,</p>\n","description":"<p><video controls=\"controls\" width=\"640\" height=\"360\" poster=\"https://recallmasters.com/videos/thumbnails/hybrid_vehicles_recalled_for_bad_frames.jpg\"><source src=\"https://recallmasters.com/videos/hybrid_vehicles_recalled_for_bad_frames.mp4\" type=\"video/mp4\" />Your browser does not support the video tag.</video></p>\n<p><em>Spirit Lake, IA — July 15, 2015 —</em> This month, hybrid vehicle owners may want to reinspect their cars if they own a GEM from Polaris Industries.</p>\n<p>The manufacturer is recalling 628 vehicles that may have been affected by a faulty frame weld.  According to the NHTSA, the defect could cause the frames of these vehicles to brake, and there have been four reports of this occurring so far.</p>\n<p>What&#8217;s the solution? Because the recall hasn&#8217;t officially begun yet, there is no repair action listed. However, the source does say that owners will receive letters and instructions to help them inspect each vehicle before it is officially repaired by the car dealer.</p>\n<p>Thanks for watching! For more information about recalls, be sure to check back often!<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"http://activetechnologies.us/rm/?p=3719","createdAt":"2015-07-16T08:49:27.000Z","date_gmt":"2015-07-16T14:34:27.000Z","updatedAt":"2015-07-16T08:49:27.000Z","modified_gmt":"2015-07-16T14:34:27.000Z","display_date":"July 16, 2015","sticky":false,"recall":true,"authors":[{"id":10,"name":"Recall Masters","slug":"recallmasters_admin"}],"acf":{"recall_master_id":null,"nhtsa_campaign_number":null,"recall_date":null,"meta_title":null,"meta_description":null,"meta_keywords":null,"custom_schema":null},"year":2015,"month":7,"alt_text":"","cld_public_id":null,"category":null,"tags":[],"categories":[]},{"id":10767,"title":"Kia recalls SUV&#8217;s for brake light problem [Video]","link":"https://www.motorsafety.org/kia-recalls-suvs-brake-light-problem-video/","status":"publish","slug":"kia-recalls-suvs-brake-light-problem-video","excerpt":"<p>More than 7,700 Kia vehicles may have faulty brake light switches.</p>\n","description":"<p>Kia Motors America plans to recall thousands of SUVs this month due to a brake light issue.</p>\n<p>According to a government recall acknowledgement notice, a total of 7,722 Kia Sportage Vehicles may include faulty brake light switches. Although the brake systems themselves may work properly in these cars, the lights could fail to turn on, leaving the driver and others around them at risk.</p>\n<p>The manufacturer plans to begin the recall sometime this month. Dealers will fix this issue by replacing the ineffective switch.</p>\n<p>Thanks for watching, and be sure to join us again for the latest auto recall news.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=10767","createdAt":"2015-07-15T17:43:12.000Z","date_gmt":"2015-07-16T07:28:12.000Z","updatedAt":"2020-10-18T21:01:37.000Z","modified_gmt":"2020-10-19T10:46:37.000Z","display_date":"July 15, 2015","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2015,"month":7,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2015/07/2009-blue-KIA-Sportage-GT-768x512.jpg","alt_text":"","cld_public_id":"2009-blue-KIA-Sportage-GT","category":{"id":32,"name":"Kia","slug":"kia-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/kia_RM.png"},"tags":[],"categories":[{"id":32,"name":"Kia","slug":"kia-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/kia_RM.png"}]},{"id":14772,"title":"NHTSA spurs Hummer recall","link":"https://www.motorsafety.org/nhtsa-spurs-hummer-recall/","status":"publish","slug":"nhtsa-spurs-hummer-recall","excerpt":"<p>Detroit, MI — July 15, 2015 — General Motors is issuing yet another recall this month, this one for Hummer H3 vehicles with heating motor issues that may lead to a risk of a fire in the vehicle. According to Jalopnik, the issue stems back at least as far as 2008, and is now being</p>\n","description":"<p><em>Detroit, MI — July 15, 2015 —</em> General Motors is issuing yet another recall this month, this one for Hummer H3 vehicles with heating motor issues that may lead to a risk of a fire in the vehicle. According to Jalopnik, the issue stems back at least as far as 2008, and is now being addressed following pressure from the National Highway Traffic Safety Administration (NHTSA), which is in turn acting in response to consumer concern.</p>\n<p>A total number of 196,379 vehicles are being recalled, the majority of which are in the United States. More than 40 fires have been connected to this issue, even though the source says there were <a href=\"http://jalopnik.com/gm-didnt-recall-the-hummer-over-fires-until-the-feds-th-1717581525\">&#8220;73 incidents involving the HVAC blower motor.&#8221;</a> In addition to the threat to drivers, these fires can damage or destroy the vehicles by melting important sections within them.</p>\n<p>Although there are other major recalls associated with General Motors, particularly their ignition switch concerns, and this latest recall shows the ways that  government pressure can lead to direct action that targets consumer safety.</p>\n<p>The H3 models produced between model years 2006 and 2010, as well as the HT3&#8217;s in model years 2009 and 2010, are included in this recall measure. To prevent the control units from catching fire, dealers will replace the inefficient modules and make it safer for owners to operate the fan and ventilation systems within their vehicle.</p>\n<p>Once a timeline for a recall action has been implemented, dealers need to follow the schedule faithfully and communicate important details to owners in time for them to get the faulty components replaced and avoid further complications from use.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=4324","createdAt":"2015-07-15T12:05:15.000Z","date_gmt":"2015-07-16T00:50:15.000Z","updatedAt":"2021-01-04T10:32:48.000Z","modified_gmt":"2021-01-05T00:17:48.000Z","display_date":"July 15, 2015","sticky":false,"recall":true,"authors":[{"id":10,"name":"Recall Masters","slug":"recallmasters_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":"","meta_title":"","meta_description":"","meta_keywords":"","custom_schema":""},"year":2015,"month":7,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2015/07/St.-Petersburg-Hummer-Club-768x512.jpg","alt_text":"","cld_public_id":"St","category":{"id":37,"name":"GM","slug":"gm-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/gm.png"},"tags":[],"categories":[{"id":37,"name":"GM","slug":"gm-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/gm.png"},{"id":130,"name":"Hummer","slug":"hummer-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2021/07/Hummer_Logo_g9iwij.jpg"}]},{"id":14773,"title":"General Motors recalls SUVs for liftgate failure","link":"https://www.motorsafety.org/general-motors-recalls-suvs-for-liftgate-failure/","status":"publish","slug":"general-motors-recalls-suvs-for-liftgate-failure","excerpt":"<p>Detroit, MI — July 13, 2015 — According to the National Highway Traffic Safety Administration (NHTSA), General Motors has discovered a new problem that has prompted a recall for hundreds of thousands of vehicles. The company wants to address possible faults with the power liftgates in certain vehicles, since users could unexpectedly see these gates</p>\n","description":"<p><em>Detroit, MI — July 13, 2015 —</em> According to the National Highway Traffic Safety Administration (NHTSA), General Motors has discovered a new problem that has prompted a recall for hundreds of thousands of vehicles. The company wants to address possible faults with the power liftgates in certain vehicles, since users could unexpectedly see these gates fail while in use if they don&#8217;t follow the prescribed response actions.</p>\n<p>The recall acknowledgement document submitted for this case says that the real problem lies with the gas struts that enable affected vehicles to hold the liftgates open when in use. A total of 686,287 vehicles may be affected, including Buick Enclave, Chevrolet Traverse and Saturn Outlook models.</p>\n<p>Another problem associated with this recall is the Prop Rod recovery software in these vehicles, which normally works to regulate liftgate operation to prevent injury, but would be unable to do so in the affected SUVs.</p>\n<p>In a Safety Recall Report also issued by the government agency, the source explains the warning signs associated with this defect.</p>\n<p>&#8220;As the vehicle&#8217;s gas struts wear, the liftgate&#8217;s Prop Rod Recovery system will operate to slowly return the liftgate to the closed position,&#8221; it states. &#8220;The vehicle will also provide audible warnings and flash the tail lamps to indicate there is a problem.&#8221;</p>\n<p>While there is no notification schedule associated with this recall as of yet, 56 injuries are reportedly associated with the liftgate error, as CBS stated. The fix will involve a software update for better actuator motor control that will <a href=\"http://www-odi.nhtsa.dot.gov/acms/cs/jaxrs/download/doc/UCM481516/RCLRPT-15V415-4155.PDF\">keep the liftgate from crashing</a>.</p>\n<p>The specific structure of a vehicle and the features it contains require recalls that match these conditions and give dealers and owners a specific place to work from for recovery and success.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=4327","createdAt":"2015-07-13T10:45:21.000Z","date_gmt":"2015-07-13T16:30:21.000Z","updatedAt":"2021-01-04T10:31:08.000Z","modified_gmt":"2021-01-05T00:16:08.000Z","display_date":"July 13, 2015","sticky":false,"recall":true,"authors":[{"id":10,"name":"Recall Masters","slug":"recallmasters_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":"","meta_title":"","meta_description":"","meta_keywords":"","custom_schema":""},"year":2015,"month":7,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2015/10/Buick-Enclave-768x513.jpg","alt_text":"","cld_public_id":"Buick-Enclave","category":{"id":27,"name":"Buick","slug":"buick-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2021/08/Buick-Logo.png"},"tags":[],"categories":[{"id":27,"name":"Buick","slug":"buick-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2021/08/Buick-Logo.png"},{"id":12,"name":"Chevrolet","slug":"chevrolet-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/chevy_ms.png"},{"id":37,"name":"GM","slug":"gm-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/gm.png"},{"id":72,"name":"GMC","slug":"gmc-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/gmc_RM.png"},{"id":23,"name":"Saturn","slug":"saturn-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/saturn_RM.png"}]},{"id":14753,"title":"Hyundai recalls Sonatas for seatbelt problems","link":"https://www.motorsafety.org/hyundai-recalls-sonatas-for-seatbelt-problems/","status":"publish","slug":"hyundai-recalls-sonatas-for-seatbelt-problems","excerpt":"<p>Ulsan, South Korea — July 9, 2015 — The newest Hyundai recall concerns a safety problem in recently produced vehicles. Reuters reported on this action, which will recall 140,000 Sonata sedans across North America and will reportedly come with an easy and quick fix, provided owners bring their car to the dealer and understand the</p>\n","description":"<p><em>Ulsan, South Korea — July 9, 2015 —</em> The newest Hyundai recall concerns a safety problem in recently produced vehicles. Reuters reported on this action, which will recall 140,000 Sonata sedans across North America and will reportedly come with an easy and quick fix, provided owners bring their car to the dealer and understand the seriousness of the situation. Fortunately, the failure will trigger a dashboard light, helping alert drivers to its presence.</p>\n<p>In the affected Sonata sedans, seatbelts could break and become impossible to secure. The source says that the metal tongue of the seatbelt has to be inserted correctly to avoid jamming the buckle and rendering the belt inoperable. Although these Sonatas were built in 2014, between April and December, they were given the model year 2015.</p>\n<p>Other recent recalls have affected Hyundai Sonatas within the past year, but these generally concerned external faults as opposed to features that immediately impacted the driver. Some of these other recalls were for conditions like an incorrectly installed left axle that could separate, as well as brake calipers that may fracture.</p>\n<p>The former was listed as an assembly error on the official National Highway Traffic Safety Administration (NHTSA) recall website, while the latter was attributed to a &#8220;manufacturing error.&#8221; The past few months have also seen complaints filed against the Sonata as well, multiple of which concerned engine or electrical systems issues.</p>\n<p>Address recalls quickly and comprehensively with programs that are effective and will take dealer and owner actions into consideration. It&#8217;s also important that everyone involves understand the severity of an issued recall and how it differs from complaints or ongoing investigations.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=4331","createdAt":"2015-07-09T11:46:02.000Z","date_gmt":"2015-07-10T01:31:02.000Z","updatedAt":"2020-10-19T01:40:05.000Z","modified_gmt":"2020-10-19T15:25:05.000Z","display_date":"July 09, 2015","sticky":false,"recall":true,"authors":[{"id":10,"name":"Recall Masters","slug":"recallmasters_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2015,"month":7,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2015/07/Blue-Hyundai-Sonata-768x512.jpg","alt_text":"","cld_public_id":"Blue-Hyundai-Sonata","category":{"id":10,"name":"Hyundai","slug":"hyundai-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/hyundai_RM.png"},"tags":[],"categories":[{"id":10,"name":"Hyundai","slug":"hyundai-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/hyundai_RM.png"}]},{"id":10765,"title":"Ford kicks off July with body control module recall [Video]","link":"https://www.motorsafety.org/ford-kicks-off-july-body-control-module-recall-video/","status":"publish","slug":"ford-kicks-off-july-body-control-module-recall-video","excerpt":"<p>A control module issue means that some Ford vehicles produced recently could run for longer than intended when switched off.</p>\n","description":"<p>July has just begun, and Ford has recalled several models for safety compliance issues.</p>\n<p>In a recent press release, the manufacturer announced a recall for around 433,000 vehicles built at its Louisville and Michigan assembly plants between 2014 and 2015. Due to problems with the body control modules in these autos, the engines could possibly run for longer than intended, even after the ignition is turned off.</p>\n<p>Ford Focus, C-MAX and Escape vehicles are all subject to this possible flaw, and the majority of the affected units are in the United States. The manufacturer states that dealers will address the problem by updating the software in the module.</p>\n<p>Thank you for watching!<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=10765","createdAt":"2015-07-08T17:44:36.000Z","date_gmt":"2015-07-09T07:29:36.000Z","updatedAt":"2018-04-02T03:02:46.000Z","modified_gmt":"2018-04-02T16:47:46.000Z","display_date":"July 08, 2015","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":null,"nhtsa_campaign_number":null,"recall_date":null,"meta_title":null,"meta_description":null,"meta_keywords":null,"custom_schema":null},"year":2015,"month":7,"alt_text":"","cld_public_id":null,"category":{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"},"tags":[],"categories":[{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"}]},{"id":14754,"title":"Brake fluid leaks mean recall for Volkswagen","link":"https://www.motorsafety.org/brake-fluid-leaks-mean-recall-for-volkswagen/","status":"publish","slug":"brake-fluid-leaks-mean-recall-for-volkswagen","excerpt":"<p>Chattanooga, TN — July 8, 2015 — It may be small compared to some of the recent record-setting recall numbers, but Volkswagen is taking action to address brake problems in certain vehicles produced earlier this year. A recall acknowledgement document dated July 6 recorded National Highway Traffic Safety Administration (NHTSA) notice of this recall, which</p>\n","description":"<p><em>Chattanooga, TN — July 8, 2015 —</em> It may be small compared to some of the recent record-setting recall numbers, but Volkswagen is taking action to address brake problems in certain vehicles produced earlier this year. A recall acknowledgement document dated July 6 recorded National Highway Traffic Safety Administration (NHTSA) notice of this recall, which concerns Passat sedans.</p>\n<p>A total of 62 units may have been potentially affected by this fault, according to the source, and all of these vehicles were produced within a specific three-day period this past May. Owners are advised to have the vehicle inspected if the brake warning light turns on in their vehicle or if a &#8220;wet spot&#8221; appears under where the sedans were parked. Dealers should keep affected vehicles separated from others to <a href=\"http://www-odi.nhtsa.dot.gov/acms/cs/jaxrs/download/doc/UCM481743/RCAK-15V373-2824.pdf\">avoid selling them accidentally</a>.</p>\n<p>The acknowledgement statement identifies the particular brake problem, which will not require any extra parts to replace. There have not yet been any accidents or injuries connected to this issue.</p>\n<p>&#8220;The affected vehicles have a brake line at the left rear wheel area that may not have been properly tightened,&#8221; the document states. &#8220;If the brake line was not properly tightened, it may leak brake fluid, causing a reduction in braking performance, lengthening the distance needed to stop the vehicle and increasing the risk of crash.&#8221;</p>\n<p>Although many of the actions needed to correct a vehicle problem may be similar, every recall will have its own specifics and symptoms to watch out for that owners and dealers alike should be aware of. For recalls large and small, entrusting the informative process to professionals ensures that only the right information will reach those that need it.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=4334","createdAt":"2015-07-08T09:35:34.000Z","date_gmt":"2015-07-08T23:20:34.000Z","updatedAt":"2020-10-18T22:49:58.000Z","modified_gmt":"2020-10-19T12:34:58.000Z","display_date":"July 08, 2015","sticky":false,"recall":true,"authors":[{"id":10,"name":"Recall Masters","slug":"recallmasters_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2015,"month":7,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2015/07/Volkswagen-logo-768x512.jpg","alt_text":"","cld_public_id":"Volkswagen-logo","category":{"id":6,"name":"Volkswagen","slug":"volkswagen-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/volkswagen.png"},"tags":[],"categories":[{"id":6,"name":"Volkswagen","slug":"volkswagen-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/volkswagen.png"}]},{"id":14755,"title":"Ford kicks off July with body control module recall","link":"https://www.motorsafety.org/ford-kicks-off-july-with-body-control-module-recall/","status":"publish","slug":"ford-kicks-off-july-with-body-control-module-recall","excerpt":"<p>Your browser does not support the video tag. Detroit, MI — July 8, 2015 — July has just begun, and Ford has recalled several models for safety compliance issues. In a recent press release, the manufacturer announced a recall for around 433,000 vehicles built at its Louisville and Michigan assembly plants between 2014 and 2015.</p>\n","description":"<p><video width=\"640\" height=\"360\" controls=\"\" poster=\"https://recallmasters.com/videos/thumbnails/ford_kicks_off_july_with_body_control_module_recall.jpg\"><source src=\"https://s3-eu-west-1.amazonaws.com/brafton-rc-video-delivery-9e604a9a9c86dc38/RecordedVideos/videos/64294275-2b4c-4705-acb7-47134998edb7/16001385/2000613/Source-Video/video1.mp4\" type=\"video/mp4\">Your browser does not support the video tag.</video></p>\n<p><em>Detroit, MI — July 8, 2015 —</em> July has just begun, and Ford has recalled several models for safety compliance issues.</p>\n<p>In a recent press release, the manufacturer announced a recall for around 433,000 vehicles built at its Louisville and Michigan assembly plants between 2014 and 2015. Due to problems with the body control modules in these autos, the engines could possibly run for longer than intended, even after the ignition is turned off.</p>\n<p>Ford Focus, C-MAX and Escape vehicles are all subject to this possible flaw, and the majority of the affected units are in the United States. The manufacturer states that dealers will address the problem by updating the software in the module.</p>\n<p>Thank you for watching!<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=4337","createdAt":"2015-07-08T06:12:08.000Z","date_gmt":"2015-07-08T11:57:08.000Z","updatedAt":"2020-10-18T23:46:56.000Z","modified_gmt":"2020-10-19T13:31:56.000Z","display_date":"July 08, 2015","sticky":false,"recall":true,"authors":[{"id":10,"name":"Recall Masters","slug":"recallmasters_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2015,"month":7,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2015/07/Blue-Ford-Focus-768x512.jpg","alt_text":"","cld_public_id":"Blue-Ford-Focus","category":null,"tags":[],"categories":[]},{"id":14756,"title":"Chrysler recalls cars for rear control arm problems","link":"https://www.motorsafety.org/chrysler-recalls-cars-for-rear-control-arm-problems/","status":"publish","slug":"chrysler-recalls-cars-for-rear-control-arm-problems","excerpt":"<p>Detroit, MI — July 8, 2015 — Fiat Chrysler Automobiles has received attention from the National Highway Traffic Safety Administration (NHTSA) over outstanding recalls, and a new action reported last month will add to the list of current issues the manufacturer is addressing. According to an acknowledgement statement featured on the NHTSA website, a suspension</p>\n","description":"<p><em>Detroit, MI — July 8, 2015 —</em> Fiat Chrysler Automobiles has received attention from the National Highway Traffic Safety Administration (NHTSA) over outstanding recalls, and a new action reported last month will add to the list of current issues the manufacturer is addressing.</p>\n<p>According to an acknowledgement statement featured on the NHTSA website, a suspension issue in certain Jeep Grand Cherokee and Dodge Durango vehicles has led to 5,608 being recalled. The specific fault concerns the rear lower control arms in these vehicles, which may break off during use.</p>\n<p>Both of the models were produced earlier this year, and the concern reportedly stems back to a notification on June 16, when suppliers informed the manufacturer that the materials &#8220;may have been incorrectly heat treated.&#8221; This led to an attempt at the Jefferson North Assembly Plant to stall shipment of vehicles with faulty parts on that same day. The component manufacturer is listed by the NHTSA as Chassix.</p>\n<p>The safety recall report on this issue went into further detail about the heating problems that <a href=\"http://www-odi.nhtsa.dot.gov/acms/cs/jaxrs/download/doc/UCM481448/RCLRPT-15V407-5292.PDF\">affected the supplier&#8217;s materials</a>.</p>\n<p>&#8220;The root cause was determined to be a non-standard heat treating process in which the supplier began hand loading materials in the heat treat oven due to a conveyor issue,&#8221; the document states. &#8220;The supplier&#8217;s manual process adversely affected the heat treat profile. The supplier subsequently shipped materials prior to completion of all required material property testing.&#8221;</p>\n<p>To remedy this condition, the source reports that vehicles will be inspected before control arms are replaced at the car dealer. FCA will reimburse owners for this inconvenience as part of its &#8220;longstanding policy&#8221; towards these actions.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=4339","createdAt":"2015-07-07T12:39:53.000Z","date_gmt":"2015-07-08T02:24:53.000Z","updatedAt":"2020-10-28T02:04:32.000Z","modified_gmt":"2020-10-28T15:49:32.000Z","display_date":"July 07, 2015","sticky":false,"recall":true,"authors":[{"id":10,"name":"Recall Masters","slug":"recallmasters_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2015,"month":7,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/01/Jeep-Grand-Cherokee-768x512.jpg","alt_text":"","cld_public_id":"Jeep-Grand-Cherokee","category":{"id":7,"name":"Dodge","slug":"dodge-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/dodge.png"},"tags":[],"categories":[{"id":7,"name":"Dodge","slug":"dodge-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/dodge.png"},{"id":33,"name":"Jeep","slug":"jeep-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/jeep_ms.png"}]}]