[{"id":3182,"title":"More than 4,900 Cadillacs Recalled for Brake Hose Corrosion Risk","link":"https://www.motorsafety.org/more-than-4900-cadillacs-recalled-for-brake-hose-corrosion-risk/","status":"publish","slug":"more-than-4900-cadillacs-recalled-for-brake-hose-corrosion-risk","excerpt":"<p>Detroit, MI — April 30, 2015 — A recall notice from General Motors posted on GM Authority announced an action that will affect 4,907 Cadillac CTS-V vehicles. The defect According to this statement, models produced between September 2003 and June 2007 may have a defect that could hurt the brake system. The recall notes that</p>\n","description":"\n<p><em>Detroit, MI — April 30, 2015 —</em> A recall notice from General Motors posted on GM Authority announced an action that will affect 4,907 Cadillac CTS-V vehicles. </p>\n\n\n\n<h2><strong>The defect</strong></h2>\n\n\n\n<p><a href=\"https://static.nhtsa.gov/odi/rcl/2015/RCLRPT-15V225-5064.PDF\">According to this statement</a>, models produced between September 2003 and June 2007 may have a defect that could hurt the brake system. The recall notes that only cars registered or originally sold in a selection of 21 states across New England and the Midwest are subject to this action.</p>\n\n\n\n<h2>Timeline of events</h2>\n\n\n\n<p>Although there is currently no recall notification schedule in place, the statement encourages owners to contact GM, Cadillac customer service and the National Highway Traffic Safety Administration (NHTSA) for more information, as well as the dealer to have the fault fixed.</p>\n\n\n\n<p>As it elaborates, the problem is exacerbated by the presence of road salt, still a possible concern as snow melts.</p>\n\n\n\n<p>&#8220;In the affected vehicles, snow or water containing road salt or other contaminants may corrode the front brake hose fitting at the caliper,&#8221; the statement reads. </p>\n\n\n\n<p>&#8220;Corrosion may cause the brake system to leak, which could lengthen the distance needed to stop the vehicle and increase the risk of a crash.&#8221; Both brake hose assemblies will be replaced by dealers to prevent leakage.</p>\n\n\n\n<p>According to the latest information, this recall is an expansion of a similar recall originally announced in 2010. In that case, the NHTSA identified more than 139,000 &#8220;potential units affected&#8221; on its website and addressed the same 21 states as possible sources of affected vehicles.</p>\n\n\n\n<p>When recalls are issued, the amount of information they contain should be easy to read through, even when a long list of states are involved. Arranging the data in a readable way will give owners a greater chance of identifying whether or not they should be concerned.</p>\n\n\n\n<h2><strong>The solution</strong></h2>\n\n\n\n<p>Check your car’s recall status using MotorSafety’s <a href=\"https://www.motorsafety.org/\">free vehicle lookup tool</a>.</p>\n<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script>","source":"http://activetechnologies.us/rm/?p=3182","createdAt":"2015-04-30T11:51:12.000Z","date_gmt":"2015-05-01T01:36:12.000Z","updatedAt":"2020-09-25T02:18:57.000Z","modified_gmt":"2020-09-25T16:03:57.000Z","display_date":"April 30, 2015","sticky":false,"recall":true,"authors":[{"id":10,"name":"Recall Masters","slug":"recallmasters_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":"April 30, 2015"},"year":2015,"month":4,"alt_text":"","cld_public_id":null,"category":{"id":36,"name":"Cadillac","slug":"cadillac-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/cadillac.png"},"tags":[{"id":845,"name":"2003 - 2007 Cadillac CTS-V","slug":"2003-2007-cadillac-cts-v"},{"id":846,"name":"Brake Hose","slug":"brake-hose"},{"id":349,"name":"brake systems","slug":"brake-systems"},{"id":784,"name":"Cadillac Recall","slug":"cadillac-recall"},{"id":408,"name":"Crash Risk","slug":"crash-risk"}],"categories":[{"id":36,"name":"Cadillac","slug":"cadillac-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/cadillac.png"}]},{"id":3178,"title":"Four new recalls from Ford tackle lamp, motor, heat shield issues","link":"https://www.motorsafety.org/four-new-recalls-from-ford-tackle-lamp-motor-heat-shield-issues/","status":"publish","slug":"four-new-recalls-from-ford-tackle-lamp-motor-heat-shield-issues","excerpt":"<p>Detroit, MI — April 28, 2015 — The Washington Post reported on a series of new recalls released by Ford this week, concerning a range of cars in the United States, Canada and Mexico. As the source describes, some of these recalls relate to previous ones, but they tackle different issues focused on various auto</p>\n","description":"<p><em>Detroit, MI — April 28, 2015 —</em> The Washington Post reported on a series of new recalls released by Ford this week, concerning a range of cars in the United States, Canada and Mexico. As the source describes, some of these recalls relate to previous ones, but they <a href=\"http://www.washingtonpost.com/cars/ford-fiesta-focus-fusion-edge-escape-f-150-lincoln-mkz-included-in-massive-recall/2015/04/29/dfec2710-ee90-11e4-8050-839e9234b303_story.html\">tackle different issues</a> focused on various auto parts and systems.</p>\n<p>All together, these recalls concern around 600,000 vehicles: the smallest of these affects just 92 Ford F-150 models produced this year in the U.S. and Canada, and has to do with the vehicles&#8217; heat shields, which may be badly attached or missing. While not as widespread a recall, it does leave these trucks at possible risk of fire.</p>\n<p>A Lincoln MKZ recall pertains to overly bright park lamps, and another one affects multiple cars that may be subject to a nickel plating-related problem with their fuel pumps. The most significant recall, though, involves more than 500,000 Ford Fusion, Lincoln MKZ and Ford Edge autos that have loose bolts around the steering gear motor.</p>\n<p>In the press release from the company covering all four recalls, posted to Autoblog, Ford explained the <a href=\"http://www.autoblog.com/2015/04/29/ford-recalls-591177-vehicles-four-campaigns/\">possible consequences of this last defect</a>.</p>\n<p>&#8220;If the steering gear motor bolts fracture, the steering system may default to manual steering mode, making the vehicle more difficult to steer, especially at lower speeds,&#8221; the source said. &#8220;This would not result in a loss of steering, but could result in an increased risk of a crash.&#8221; None of these recalls have led to any injuries, the release said, though the nickel plating recall has led to &#8220;allegation of an accident.&#8221;</p>\n<p>One release can accommodate many recalls like this, but each one has to be issued at the proper time and through the correct channels to have the desired effect.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"http://activetechnologies.us/rm/?p=3178","createdAt":"2015-04-28T13:05:58.000Z","date_gmt":"2015-04-29T02:50:58.000Z","updatedAt":"2020-10-18T21:05:51.000Z","modified_gmt":"2020-10-19T10:50:51.000Z","display_date":"April 28, 2015","sticky":false,"recall":true,"authors":[{"id":10,"name":"Recall Masters","slug":"recallmasters_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2015,"month":4,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2015/04/Modern-red-pickup-ford-768x512.jpg","alt_text":"","cld_public_id":"Modern-red-pickup-ford","category":{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"},"tags":[],"categories":[{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"}]},{"id":3176,"title":"Two Harley-Davidson recalls concern motorcycle clutches, reflectors","link":"https://www.motorsafety.org/two-harley-davidson-recalls-concern-motorcycle-clutches-reflectors/","status":"publish","slug":"two-harley-davidson-recalls-concern-motorcycle-clutches-reflectors","excerpt":"<p>Detroit, MI — April 27, 2015 — The Associated Press recently reported that a clutch issue with Harley-Davidson motorcycles triggered a recall that began last Thursday. Six different types of motorcycle models, including Electra Glide, Ultra Limited and Police Electra Glide, were targeted, having been linked to 27 crashes. In total, the recall will affect</p>\n","description":"<p><em>Detroit, MI — April 27, 2015 —</em> The Associated Press recently reported that a clutch issue with Harley-Davidson motorcycles triggered a recall that began last Thursday. Six different types of motorcycle models, including Electra Glide, Ultra Limited and Police Electra Glide, were targeted, having been linked to 27 crashes.</p>\n<p>In total, the recall will affect <a href=\"http://www.nola.com/business/index.ssf/2015/04/harley-davidson_recalls_46000.html\">around 46,000 different cycles</a>. The specific defect involves the master cylinder in the clutch: Riders using these bikes will not be able to take them out of gear, leading to possible control issues. Dealers are reportedly going to address this problem by rebuilding the cylinder.</p>\n<p>Harley-Davidson has issued multiple recalls recently for motorcycle faults. Earlier this month, the company also thousands of 2015 bikes that were manufactured without rear reflectors. While the remedy is simply to install a new one, the official recall document released through the National Highway Traffic Safety Administration said that the reflector-less vehicles would violate the Federal Motor Vehicle Safety Standard.</p>\n<p>&#8220;If the motorcycle is missing the rear reflector it can reduce the vehicle&#8217;s visibility to other drivers, increasing the risk of a crash,&#8221; the statement said. Like the clutch-related recall, this reflector one also began this month and concerned motorcycles produced between 2014 and 2015. The company also recalled motorcycles last December for brake cylinder issues, although the vehicles concerned in that case were from older manufacture years.</p>\n<p>All recall notices need to follow the same consistent format to give consumers important details about the defect, consequences and remedy. Once they know this, they should turn to the well-informed dealers, who will make replacing the faulty parts and restoring the vehicle to its proper working state. Vehicles operated during the recall period without being fixed are possible hazards to owners and the people around them.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"http://activetechnologies.us/rm/?p=3176","createdAt":"2015-04-27T13:32:26.000Z","date_gmt":"2015-04-28T02:17:26.000Z","updatedAt":"2020-10-18T21:20:07.000Z","modified_gmt":"2020-10-19T11:05:07.000Z","display_date":"April 27, 2015","sticky":false,"recall":true,"authors":[{"id":10,"name":"Recall Masters","slug":"recallmasters_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2015,"month":4,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2015/04/black-Harley-Davidson-768x512.jpg","alt_text":"","cld_public_id":"black-Harley-Davidson","category":null,"tags":[],"categories":[]},{"id":3174,"title":"Hundreds of thousands of Ford cars recalled for loose door latches","link":"https://www.motorsafety.org/hundreds-of-thousands-of-ford-cars-recalled-for-loose-door-latches/","status":"publish","slug":"hundreds-of-thousands-of-ford-cars-recalled-for-loose-door-latches","excerpt":"<p>Detroit, MI — April 26, 2015 — Last year, the National Highway Traffic Safety Administration (NHTSA) started investigating a fault in Ford Fiesta car door latches, according to USA Today. That initial concern has turned into a full recall for Ford, which has now taken action to fix the affected vehicles. The specific problem lies</p>\n","description":"<p><em>Detroit, MI — April 26, 2015 —</em> Last year, the National Highway Traffic Safety Administration (NHTSA) started investigating a fault in Ford Fiesta car door latches, according to USA Today. That initial concern has turned into a full recall for Ford, which has now taken action to fix the affected vehicles. The specific problem lies with door latches that feature a broken part which could lead to doors opening while the car is being driven.</p>\n<p>The source says that a total of 389,585 Ford vehicles are being recalled across all of North America, most of which are in the United States. The models include Fiestas and Lincoln MKZ&#8217;s built at the company&#8217;s Cuautitlán and Hermosillo plants in Mexico, between 2012 and 2013. According to a report the from the NHTSA referenced in the article, Ford has received more than 1,000 warranty claims because of this defect.</p>\n<p>In a statement on its website, Ford addressed the physical dangers from loose doors, as well as the <a href=\"https://media.ford.com/content/fordmedia/fna/us/en/news/2015/04/24/ford-motor-company-issues-safety-recall-in-north-america-for-doo.html\">current incidents that have been recorded</a>. The door could open even if the driver had previously latched it successfully.</p>\n<p>&#8220;Ford is aware of two allegations of soreness resulting from an unlatched door bouncing back when the customer attempted to close it, and one accident allegation when an unlatched door swung open and struck an adjacent vehicle as the driver was pulling into a parking space,&#8221; the statement said. To solve the problem, dealers are replacing all of the door latches in affected cars, not just the specific ones with bad pawl spring tabs.</p>\n<p>An effective recall notice will cover the severity of a situation as well as the specific parts that are the cause. Just because the difficulty can be traced back to one piece in the car doesn&#8217;t mean that response actions will be limited to that part alone.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"http://activetechnologies.us/rm/?p=3174","createdAt":"2015-04-26T08:28:59.000Z","date_gmt":"2015-04-26T22:13:59.000Z","updatedAt":"2020-10-18T23:35:38.000Z","modified_gmt":"2020-10-19T13:20:38.000Z","display_date":"April 26, 2015","sticky":false,"recall":true,"authors":[{"id":10,"name":"Recall Masters","slug":"recallmasters_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2015,"month":4,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2015/04/Ford-Fiesta-768x512.jpg","alt_text":"","cld_public_id":"Ford-Fiesta","category":{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"},"tags":[],"categories":[{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"}]},{"id":3172,"title":"Ignition hazards prompt Suzuki recall","link":"https://www.motorsafety.org/ignition-hazards-prompt-suzuki-recall/","status":"publish","slug":"ignition-hazards-prompt-suzuki-recall","excerpt":"<p>Detroit, MI — April 24, 2015 — General Motors has taken part in a longstanding recall due to faulty ignition switches and the fire hazard they pose to vehicles, but another manufacturer is facing a similar problem. Reuters reports that the Japanese manufacturer Suzuki Motor Corporation is updating a recall that it released last month</p>\n","description":"<p><em>Detroit, MI — April 24, 2015 —</em> General Motors has taken part in a longstanding recall due to faulty ignition switches and the fire hazard they pose to vehicles, but another manufacturer is facing a similar problem. Reuters reports that the Japanese manufacturer Suzuki Motor Corporation is updating a recall that it <a href=\"http://www.reuters.com/article/2015/04/22/suzuki-motor-recall-idUSL4N0XJ2V920150422\">released last month</a> to apply to 2 million of its cars around the world, in addition to more than 1.8 million in its home country. The production years of the Suzuki vehicles the brand is recalling range over an 11-year period between 1998 and 2009.</p>\n<p>While there have been no notices of smoking or symptoms of ignition fires in Suzuki cars outside of Japan, there are reportedly 67 reports of smoking switches to date. More than 130,000 of the globally recalled vehicles are from overseas markets. The specific Suzuki models affected by this most recent action include the Alto, WagonR and Swift.</p>\n<p>When the original recall was released for Japan at the end of March, it was in response to 30 reports of ignition switch-related fires or smoke, more than half of which were in police vehicles in that country, the source said.</p>\n<p>Lessening the damage of existing ignition switch problems requires efficient recall notices and direct instructions for a complete fix. The recall doesn&#8217;t appear to have any immediate affect for American customers, but because it comes at a time when the GM recalls are also in the news, it raises the issue of distinctiveness.</p>\n<p>Dealers have to be sure they follow the specific rules of each individual recall and not assume that similar problems will always come with the same cure. Efficient recall systems that communicate the message to a wide audience will be vehicle and brand-specific to avoid future confusion.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"http://activetechnologies.us/rm/?p=3172","createdAt":"2015-04-24T05:49:30.000Z","date_gmt":"2015-04-24T11:34:30.000Z","updatedAt":"2020-10-19T01:11:47.000Z","modified_gmt":"2020-10-19T14:56:47.000Z","display_date":"April 24, 2015","sticky":false,"recall":true,"authors":[{"id":10,"name":"Recall Masters","slug":"recallmasters_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2015,"month":4,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2015/04/Suzuki-Swift-768x512.jpg","alt_text":"","cld_public_id":"Suzuki-Swift","category":{"id":72,"name":"GMC","slug":"gmc-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/gmc_RM.png"},"tags":[],"categories":[{"id":72,"name":"GMC","slug":"gmc-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/gmc_RM.png"}]},{"id":3170,"title":"More recalls issued in response to faulty Takata air bags","link":"https://www.motorsafety.org/more-recalls-issued-in-response-to-faulty-takata-air-bags/","status":"publish","slug":"more-recalls-issued-in-response-to-faulty-takata-air-bags","excerpt":"<p>Tokyo, Japan — April 23, 2015 — The consequences of recalls from the Takata Corporation related to faulty airbags continue. Previously, concerns over the overly aggressive inflation mechanisms used in Takata airbags led to industry concern and recall action from different manufacturers. According to Reuters, Nissan is now including Sentras produced between 2004 and 2006</p>\n","description":"<p><em>Tokyo, Japan — April 23, 2015 —</em> The consequences of recalls from the Takata Corporation related to faulty airbags continue. Previously, concerns over the overly aggressive inflation mechanisms used in Takata airbags led to industry concern and recall action from different manufacturers.</p>\n<p>According to Reuters, Nissan is now including Sentras produced between 2004 and 2006 to the list of recalled vehicles, and late last month Honda announced more than 104,000 vehicles to its own list of affected cars. While the Honda statement pertained solely to driver-side airbags, the more recent Nissan announcement includes airbags on the passenger side, which Takata previously overlooked in its own recalls. Reuters adds that the total number of vehicles recalled because of the dangerous Takata systems is now around 25 million.</p>\n<p>Major recalls like this, in which new information spurs on more and more industry action, need to be enforced with consistent messages that reach professional car dealers as well and consumers,  and make the right corrective options easier to find. A Consumer Reports piece featured in the Boston Globe explains some of the issues that <a href=\"http://www.bostonglobe.com/business/2015/04/18/how-protect-yourself-auto-recalls-rise/WhNiUXUEPcYI7CEzflOG2M/story.html\">make attempted recalls less effective</a>.</p>\n<p>&#8220;In some cases, owners don&#8217;t know there&#8217;s a problem because they bought their cars used and the previous owners didn&#8217;t get the work done,&#8221; the article reads. &#8220;Other times, automakers lose track of who owns the car because it has been sold and resold a few times.&#8221;</p>\n<p>If recalls are to be taken seriously, they need to be promoted through the right channels and targeted to their respective audiences. As the source says, every safety issue needs to be taken seriously, and when many different cases stem from the same problem, specific recall notices should be sent to make sure the proper course of action doesn&#8217;t get lost in the shuffle.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"http://activetechnologies.us/rm/?p=3170","createdAt":"2015-04-23T12:43:00.000Z","date_gmt":"2015-04-23T18:28:00.000Z","updatedAt":"2020-10-18T21:47:43.000Z","modified_gmt":"2020-10-19T11:32:43.000Z","display_date":"April 23, 2015","sticky":false,"recall":true,"authors":[{"id":10,"name":"Recall Masters","slug":"recallmasters_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2015,"month":4,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2015/04/White-Nissan-Sentra-768x512.jpg","alt_text":"","cld_public_id":"White-Nissan-Sentra","category":null,"tags":[],"categories":[]},{"id":3168,"title":"New data concerning GM ignition switch claims released","link":"https://www.motorsafety.org/new-data-concerning-gm-ignition-switch-claims-released/","status":"publish","slug":"new-data-concerning-gm-ignition-switch-claims-released","excerpt":"<p>Detroit, MI — April 22, 2015 — MLive recently reported on the General Motors ignition switch recall, which first began more than a year ago but only recently resulted in a final tally of claims at the end of this January. As the source states, 2.6 million vehicles have been recalled in total due to</p>\n","description":"<p><em>Detroit, MI — April 22, 2015 —</em> MLive recently reported on the General Motors ignition switch recall, which first began more than a year ago but only recently resulted in a <a href=\"http://www.mlive.com/auto/index.ssf/2015/04/approved_death_claims_related_17.html\">final tally of claims</a> at the end of this January. As the source states, 2.6 million vehicles have been recalled in total due to the fault, and according to recently released data, more than 4,340 claims have been received.</p>\n<p>These claims pertain to various negative effects related to the initial ignition fault, including pervasive burns, injuries that required hospitalization and deaths, of which there were 475 claims. Of the total, 537 claims were submitted to the automaker without documentation. So far, 244 claims have been deemed &#8220;eligible,&#8221; and 1,335 &#8220;ineligible.&#8221;</p>\n<p>This month, the Associated Press reported that GM had made progress in addressing the problem by repairing 70 percent of the affected vehicles that were still being used. It is currently slightly below the average completion rate for a recall after a year and a half, and has fixed more than half of the American vehicles that have been recalled.</p>\n<p>Although the company has been fined $35 million for problems in the way it reported the ignition fault, Mark Rosekind of the U.S. National Highway Traffic Safety Administration recently <a href=\"http://abcnews.go.com/Business/wireStory/gm-fixed-70-pct-faulty-ignition-switches-30227749\">praised the corporation</a> for taking the steps that it has.</p>\n<p>&#8220;All other manufacturers and dealers should embrace the proactive approach that GM is taking,&#8221; he said.</p>\n<p>As manufacturers improve their initial response to a vehicle fault and give dealers and consumers more information to act off of, maintaining a consistent system for recalls impacts preparedness that owners will be able to exercise. In addition, identifying the problems quickly and keeping everyone updates sets the tone for a faster-acting recall with connected actions occurring soon after.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"http://activetechnologies.us/rm/?p=3168","createdAt":"2015-04-22T12:35:31.000Z","date_gmt":"2015-04-22T18:20:31.000Z","updatedAt":"2020-10-18T23:26:18.000Z","modified_gmt":"2020-10-19T13:11:18.000Z","display_date":"April 22, 2015","sticky":false,"recall":false,"authors":[{"id":10,"name":"Recall Masters","slug":"recallmasters_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2015,"month":4,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2015/04/shutterstock_377998069-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_377998069","category":{"id":72,"name":"GMC","slug":"gmc-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/gmc_RM.png"},"tags":[],"categories":[{"id":72,"name":"GMC","slug":"gmc-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/gmc_RM.png"}]},{"id":3164,"title":"Efforts continue to address Jeep fire safety after recall","link":"https://www.motorsafety.org/efforts-continue-to-address-jeep-fire-safety-after-recall/","status":"publish","slug":"efforts-continue-to-address-jeep-fire-safety-after-recall","excerpt":"<p>Detroit, MI — April 15, 2015 — According to the Associated Press, the aftermath of a recall from 2013 still leaves room for further improvement and perhaps further awareness from the National Highway Traffic Safety Administrator. Just over 30 percent of the Jeep Liberty and Jeep Grand Cherokee vehicles found to be at risk of</p>\n","description":"<p><em>Detroit, MI — April 15, 2015 —</em> According to the Associated Press, the aftermath of a recall from 2013 still leaves room for further improvement and perhaps <a href=\"http://www.detroitnews.com/story/business/autos/chrysler/2015/04/14/jeep-fires/25766933/\">further awareness from the National Highway Traffic Safety Administrator</a>. Just over 30 percent of the Jeep Liberty and Jeep Grand Cherokee vehicles found to be at risk of combustion have been repaired since the initial recall notice was issued.</p>\n<p>The original concern centered around the way gas tanks were placed on affected Chrysler vehicles: because they were located behind the rear example, a collision with the bumper could result in fire spreading.</p>\n<p>Fiat Chrysler Automobiles (FCA) has seen multiple cases where Jeep fires led to deaths, and the NHTSA is reportedly considering taking action to prompt further response. The near 1.56 million suspected SUV&#8217;s recalled were produced in different ranges of years, from 1993 to 2007. The roots of the recall go as far back as 2010, when regulators first started investigating Jeep susceptibility to fire.</p>\n<p>The source quotes from a letter from the manufacturer which addresses the flaws and directs dealers to take action to avoid further incidents. To fix the fault, the company is installing protective trailer hitches on the back of the vehicles.</p>\n<p>&#8220;If there are barriers that are preventing your dealership from completing these important repairs, please contact your factory representative for assistance,&#8221; the manufacturer said. &#8220;FCA wants to know and will make every effort to eliminate any barriers.&#8221;</p>\n<p>The dealership and the vehicle owner will have needs in the wake of a recall that both need to be addressed, even if that recall began years in the past. Outstanding recalls have to be responded to in a professional manner, not to mention fast and accurate.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"http://activetechnologies.us/rm/?p=3164","createdAt":"2015-04-15T14:48:03.000Z","date_gmt":"2015-04-16T04:33:03.000Z","updatedAt":"2020-10-28T00:16:17.000Z","modified_gmt":"2020-10-28T14:01:17.000Z","display_date":"April 15, 2015","sticky":false,"recall":true,"authors":[{"id":10,"name":"Recall Masters","slug":"recallmasters_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2015,"month":4,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2015/04/2015-Jeep-Cherokee-768x512.jpg","alt_text":"","cld_public_id":"2015-Jeep-Cherokee","category":{"id":33,"name":"Jeep","slug":"jeep-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/jeep_ms.png"},"tags":[],"categories":[{"id":33,"name":"Jeep","slug":"jeep-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/jeep_ms.png"}]},{"id":3162,"title":"Fiat limp home problem could lead to stalling","link":"https://www.motorsafety.org/fiat-limp-home-problem-could-lead-to-stalling/","status":"publish","slug":"fiat-limp-home-problem-could-lead-to-stalling","excerpt":"<p>Fiat Chrysler Automobiles attempts to respond to a software-related issue in thousands of its Fiat 500 electric vehicles that concerns the associated &#8220;limp home mode.&#8221;</p>\n","description":"<p><em>Detroit, MI — April 15, 2015 —</em> Electric cars are attractive to some consumers because they are energy efficient, but owners need to be on the lookout for important messages about possible flaws. One recent recall from Fiat Chrysler Automobiles attempts to respond to a software-related issue in thousands of its Fiat 500 electric vehicles that concerns the associated &#8220;limp home mode.&#8221;</p>\n<p>For those that don&#8217;t use an electric car, limp mode is a special setting designed to give a car with low energy enough power to get to a safe place where the battery can be recharged. The problem addressed in this recall arises in certain models that can&#8217;t process the limp mode command due to software compatibility issues.</p>\n<p>Instead of switching modes, the afflicted cars, manufactured between 2012 and 2014 could suddenly shut down, leaving drivers vulnerable to an accident if they are on the road at the time. The Car Connection reports that this fault <a href=\"http://www.thecarconnection.com/news/1097773_2013-2015-fiat-500e-recalled-for-software-flaw\" target=\"_blank\" rel=\"noopener noreferrer\">doesn&#8217;t affect other important vehicle systems</a>, like steering and brakes, and that cycling through the ignition multiple times should reset the system to normal.</p>\n<p>A total of 5,600 vehicles were addressed in this recall, and dealers will fix the chance of a sudden shutdown by updating the relevant software. Although the recall has been announced, it won&#8217;t officially take place until halfway through next month, which is when owners can expect to stop receiving notices from the manufacturer.</p>\n<p>On the surface, a software problem could sound relatively innocuous, but in the wrong circumstances they may be far more dangerous to the consumer. Recall notices that are effectively distributed give every link in the chain, from dealer to owner, some idea of what the effects of an untended flaw will be and why immediate service is necessary.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"http://activetechnologies.us/rm/?p=3162","createdAt":"2015-04-15T10:00:16.000Z","date_gmt":"2015-04-15T23:45:16.000Z","updatedAt":"2020-10-28T02:11:38.000Z","modified_gmt":"2020-10-28T15:56:38.000Z","display_date":"April 15, 2015","sticky":false,"recall":false,"authors":[{"id":6,"name":"MotorSafety.org","slug":"motorsafety"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"15V179000","recall_date":"March 27, 2015"},"year":2015,"month":4,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2015/04/2015-Orange-Fiat-500-e-768x512.jpg","alt_text":"","cld_public_id":"2015-Orange-Fiat-500-e","category":{"id":8,"name":"Fiat Chrysler","slug":"fiat-chrysler-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/fiat.png"},"tags":[{"id":1781,"name":"2013-2015 Fiat 500e recall","slug":"2013-2015-fiat-500e-recall"},{"id":1782,"name":"Fiat limp home mode","slug":"fiat-limp-home-mode"}],"categories":[{"id":8,"name":"Fiat Chrysler","slug":"fiat-chrysler-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/fiat.png"}]},{"id":14728,"title":"Sunroof problems lead to Chevy Malibu recall","link":"https://www.motorsafety.org/sunroof-problems-lead-to-chevy-malibu-recall/","status":"publish","slug":"sunroof-problems-lead-to-chevy-malibu-recall","excerpt":"<p>Detroit, MI — April 11, 2015 — A defective feature doesn&#8217;t have to be essential to lead to a recall. Even the seemingly&nbsp;ornamental or luxury aspects of a major car brand could contribute to a major response action. The Detroit Free Press has reported on a General Motors recall that pertains specifically to a series</p>\n","description":"<p><em>Detroit, MI — April 11, 2015 —</em> A defective feature doesn&#8217;t have to be essential to lead to a recall. Even the seemingly&nbsp;ornamental or luxury aspects of a major car brand could contribute to a major response action. The Detroit Free Press has reported on a General Motors recall that pertains specifically to a series of Chevrolet Malibu sedans made between 2013 and 2015. The source of the recall is an issue with the vehicles&#8217; sunroof controls, which leads to them closing accidentally after minor amounts of contact.</p>\n<p>While the average consumer might not consider a sunroof problem to be a major security concern, and there have reportedly been no complaints related to this bug, Slash Gear&#8217;s Brittany&nbsp;Hillen&nbsp;writes that the <a href=\"http://www.slashgear.com/chevy-malibu-hit-with-gms-latest-sunroof-recall-24375147/\">overly sensitive switches</a> could violate national vehicle guidelines.</p>\n<p>&#8220;This is a problem because auto makers are required to meet certain federal standards with switches and buttons&nbsp;—&nbsp;if they&#8217;re too sensitive, it could pose a safety hazard depending on which part of the vehicle the switch controls,&#8221;&nbsp;Hillen&nbsp;writes.</p>\n<p>Around 92,000 vehicles have been targeted by the recall in the United States and Canada, and dealers will fix the problem by&nbsp;recalibrating&nbsp;the sunroof controls in affected vehicles. Owners who need this done will be able to bring their cars to the appropriate locations and have them taken care of there.</p>\n<p>All features that don&#8217;t pass government approval, from the large to the small, need a clear path to repair that is easy on the consumer, the dealer and all parties that could be related. When such a recall comes from a major manufacturer, as well, there has to be a far-reaching message that influences industry behavior in a positive way. Furthermore, failure to respond to a recall could land certain parties in legal trouble.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"http://activetechnologies.us/rm/?p=3002","createdAt":"2015-04-11T11:05:00.000Z","date_gmt":"2015-04-12T00:50:00.000Z","updatedAt":"2020-10-18T21:24:27.000Z","modified_gmt":"2020-10-19T11:09:27.000Z","display_date":"April 11, 2015","sticky":false,"recall":true,"authors":[{"id":10,"name":"Recall Masters","slug":"recallmasters_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2015,"month":4,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2015/04/2017-silver-Chevrolet-Malibu-768x512.jpg","alt_text":"","cld_public_id":"2017-silver-Chevrolet-Malibu","category":{"id":12,"name":"Chevrolet","slug":"chevrolet-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/chevy_ms.png"},"tags":[],"categories":[{"id":12,"name":"Chevrolet","slug":"chevrolet-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/chevy_ms.png"}]},{"id":3160,"title":"More than 165,000 Nissan and BMW vehicles recalled","link":"https://www.motorsafety.org/more-than-165000-nissan-and-bmw-vehicles-recalled/","status":"publish","slug":"more-than-165000-nissan-and-bmw-vehicles-recalled","excerpt":"<p>Detroit, MI — April 10, 2015 — A fuel pump-related difficulty was the source of a recent recall which concerned thousands of Nissan and BMW vehicles. Though the acknowledged problem comes from loose nickel plating in the pumps, the possible repercussions could affect the total workings of the engine, keeping the pump from working and</p>\n","description":"<p><em>Detroit, MI — April 10, 2015 —</em> A fuel pump-related difficulty was the source of a recent recall which concerned thousands of Nissan and BMW vehicles. Though the acknowledged problem comes from loose nickel plating in the pumps, the possible repercussions could affect the total workings of the engine, keeping the pump from working and causing the engine to either stall or stop completely. The recall includes more than 70,000 BMW models and 95,000 Nissan SUV&#8217;s produced between last year and 2014.</p>\n<p>While a sudden stall is potentially dangerous in vehicles, Nissan has assured customers that vehicle airbags will still work in its Rogue cars even when the engine is affected, as Autoblog documents. The engines are apparently more likely to not start at all than stall during use.</p>\n<p>In a letter to the National Highway Traffic Safety Administration (NHTSA) sent at the end of last month, Nissan <a href=\"http://www-odi.nhtsa.dot.gov/acms/cs/jaxrs/download/doc/UCM475994/RCORRD-15V197-6072.pdf\">documented the timeline</a> that led to its voluntary recall. It said that Bosch was the supplier of the nickel it used for plating, and that it has been aware of the issue since last March.</p>\n<p>&#8220;Owners of all potentially affected vehicles will be notified to take their vehicle to a Nissan dealer,&#8221; the letter read. It further insists that, &#8220;to date, Nissan is not aware of any vehicle crashes confirmed to be attributable to this issue,&#8221; that date presumably being March 31, the date on the letter.</p>\n<p>Once a recall has been issued, owners and dealers have to pay attention to the necessary data and follow the proper guidelines to improve vehicle performance. If replacement parts will be needed, dealers should feel as if they can easily find them based on instructions from the manufacturers. The affects of a single particular flaw could be varied, and the &#8220;symptoms&#8221; difficult to spot without guidance.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"http://activetechnologies.us/rm/?p=3160","createdAt":"2015-04-10T14:13:48.000Z","date_gmt":"2015-04-11T03:58:48.000Z","updatedAt":"2020-10-18T05:39:04.000Z","modified_gmt":"2020-10-18T19:24:04.000Z","display_date":"April 10, 2015","sticky":false,"recall":true,"authors":[{"id":10,"name":"Recall Masters","slug":"recallmasters_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2015,"month":4,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2015/04/blue-2017-nissan-768x512.jpg","alt_text":"","cld_public_id":"blue-2017-nissan","category":{"id":15,"name":"BMW","slug":"bmw-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/bmw_RM.png"},"tags":[],"categories":[{"id":15,"name":"BMW","slug":"bmw-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/bmw_RM.png"},{"id":14,"name":"Nissan","slug":"nissan-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/nissan_RM.png"}]},{"id":2998,"title":"Monoxide concerns lead to Chevrolet Volt recall","link":"https://www.motorsafety.org/monoxide-concerns-lead-to-chevrolet-volt-recall/","status":"publish","slug":"monoxide-concerns-lead-to-chevrolet-volt-recall","excerpt":"<p>Detroit, MI — April 9, 2015 — The Wall Street Journal reports that General Motors has recalled thousands of hybrid cars after the discovery of a possible emissions problem in these vehicles. Chevrolet Volts produced between 2011 and 2013 could have a systems fault that leaves some users accidentally running the car for too long.</p>\n","description":"<p><em>Detroit, MI — April 9, 2015 —</em> The Wall Street Journal reports that General Motors has recalled thousands of hybrid cars after the <a href=\"http://www.wsj.com/articles/gm-recalls-64-000-chevy-volts-over-idling-concerns-1426196121\">discovery of a possible emissions problem</a> in these vehicles. Chevrolet Volts produced between 2011 and 2013 could have a systems fault that leaves some users accidentally running the car for too long. In garages and other enclosed spaces, continuous time active could lead to a buildup of emissions and the threat of monoxide carbon monoxide poisoning.</p>\n<p>Although a software update from the manufacturer is intended to fix the problem, there are reportedly two known cases of people being injured because they did not understand the car was still running after they had exited it, even though the cars do already emit a warning.</p>\n<p>If the battery drains itself, the Volt is designed to automatically switch to standard fuel power, creating the emissions danger. Because the car is turned on and off via a button, users that aren&#8217;t aware of this could relatively easily make a hazardous mistake.</p>\n<p>The company&#8217;s solution to this issue is a software change that institutes an &#8220;automatic shutdown&#8221; protocol. This prevents Volts from being left idling too long by shutting them down after being left stationary for an hour and a half, as CNN states. Owners of the affected cars can also have the software change administered to their vehicles.</p>\n<p>Defects in cars could be so impactful that they require a thorough response, including not just a recall but some action on behalf of the affected customers. A strong recall alert program will advise all the necessary parties about how to react, and disperse the message in an appropriate timeframe. In addition to spreading the word, vehicle owners will need to know what they can do to mitigate risk.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"http://activetechnologies.us/rm/?p=2998","createdAt":"2015-04-09T11:03:11.000Z","date_gmt":"2015-04-10T00:48:11.000Z","updatedAt":"2020-10-18T18:36:37.000Z","modified_gmt":"2020-10-19T08:21:37.000Z","display_date":"April 09, 2015","sticky":false,"recall":true,"authors":[{"id":10,"name":"Recall Masters","slug":"recallmasters_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2015,"month":4,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2015/04/blue-Chevy-volt-768x512.jpg","alt_text":"","cld_public_id":"blue-Chevy-volt","category":{"id":12,"name":"Chevrolet","slug":"chevrolet-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/chevy_ms.png"},"tags":[],"categories":[{"id":12,"name":"Chevrolet","slug":"chevrolet-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/chevy_ms.png"}]},{"id":4735,"title":"Honda airbag safety recall affects millions of vehicles","link":"https://www.motorsafety.org/honda-airbag-safety-recall-affects-millions-of-vehicles/","status":"publish","slug":"honda-airbag-safety-recall-affects-millions-of-vehicles","excerpt":"<p>Tokyo, Japan — April 8, 2015 — Honda hopes to address concerns in multiple models linked to a potentially dangerous airbag issue with its latest recalls. As part of an ongoing attempt to attend to risk, the manufacturer has been extending the existing recall to more and more vehicles, currently encompassing more than 5 million</p>\n","description":"<p><em>Tokyo, Japan — April 8, 2015 —</em> Honda hopes to address concerns in multiple models linked to a potentially dangerous airbag issue with its latest recalls. As part of an ongoing attempt to attend to risk, the manufacturer has been extending the existing recall to more and more vehicles, currently encompassing more than 5 million cars, according to the Associated Press. These include SUV’s and Civics produced over a ten-year period, beginning in 2001.</p>\n<p>To allay operational concerns, owners can have airbags in these vehicles replaced by dealers for free. Honda is just one of several major names, including BMW, Chrysler and Nissan, that are participating in similar recalls, all of which stem from faulty airbag deployments systems installed by Takata Corporation.</p>\n<p>The source described the possible life-threatening hazards associated with this defect. Due to the sensitive chemicals needed to trigger airbag inflation, some Takata systems could deploy too quickly, leading to vehicle damage and injury. Six people have been killed by this problem, and the National Highway Traffic Safety Administration (NHTSA) has been overseeing Takata’s attempts to test and improve its airbags for safety.</p>\n<p>In a press release from the NHTSA last month, Administrator Mark Rosekind affirmed his organization’s <a href=\"http://www.nhtsa.gov/About+NHTSA/Press+Releases/2015/takata-ordered-to-preserve-defective-air-bag-inflators\">continuing involvement in this matter</a>.</p>\n<p>“There is a strong public safety interest in ensuring that testing moves forward, and that NHTSA has access to all test data,” he said. “We have worked closely with attorneys for private plaintiffs to construct this order so that it protects plaintiffs’ legal rights while also supporting our efforts to protect public safety.”</p>\n<p>When recalls affect this many different companies and vehicles, the recall information needs to be accurate, comprehensive and up-to-date. Affected parties should pay attention to all of the related data while still performing the actions relevant to their specific case.</p>\n<p>Sources:</p>\n<p><a href=\"http://www.nhtsa.gov/About+NHTSA/Press+Releases/2015/takata-ordered-to-preserve-defective-air-bag-inflators\">http://www.nhtsa.gov/About+NHTSA/Press+Releases/2015/takata-ordered-to-preserve-defective-air-bag-inflators</a></p>\n<p><a href=\"http://www.al.com/business/index.ssf/2015/03/honda_recall_2015_air_bags_can.html\">http://www.al.com/business/index.ssf/2015/03/honda_recall_2015_air_bags_can.html</a></p>\n<p><a href=\"http://www.washingtonpost.com/cars/honda-expands-takata-airbag-recall-to-include-2001-accord-2004-civic-2008-pilot/2015/03/25/103ab792-d33e-11e4-8b1e-274d670aa9c9_story.html\">http://www.washingtonpost.com/cars/honda-expands-takata-airbag-recall-to-include-2001-accord-2004-civic-2008-pilot/2015/03/25/103ab792-d33e-11e4-8b1e-274d670aa9c9_story.html</a><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"http://activetechnologies.us/rm/?p=3006","createdAt":"2015-04-08T11:16:15.000Z","date_gmt":"2015-04-09T01:01:15.000Z","updatedAt":"2020-10-18T23:42:07.000Z","modified_gmt":"2020-10-19T13:27:07.000Z","display_date":"April 08, 2015","sticky":false,"recall":true,"authors":[{"id":10,"name":"Recall Masters","slug":"recallmasters_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2015,"month":4,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2015/04/Silver-Honda-Civic-768x512.jpg","alt_text":"","cld_public_id":"Silver-Honda-Civic","category":{"id":4,"name":"Honda","slug":"honda-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/honda_ms.png"},"tags":[],"categories":[{"id":4,"name":"Honda","slug":"honda-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/honda_ms.png"}]},{"id":4734,"title":"Multiple issues lead to Ford recall","link":"https://www.motorsafety.org/multiple-issues-lead-to-ford-recall/","status":"publish","slug":"multiple-issues-lead-to-ford-recall","excerpt":"<p>Detroit, MI — April 7, 2015 — Several different vehicle concerns have led to a series of Ford recalls. Taken together, they show the variety of possible safety violations that can be detected at once, leading to a need for quick action on the part of a manufacturer. Though the three recalls all concern different</p>\n","description":"<p><em>Detroit, MI — April 7, 2015 —</em> Several different vehicle concerns have led to a series of Ford recalls. Taken together, they show the variety of possible safety violations that can be detected at once, leading to a need for quick action on the part of a manufacturer.</p>\n<p>Though the three recalls all concern different kinds of mechanical issues, they are similar in that they target specialty vehicles for different uses. In a press release, Ford outlined each separate recall and explained what it consisted of and who it would affect.</p>\n<p>The first recall applies to 213,000 Ford Explorer and Police Interceptor Utility vehicles produced between 2011 and 2013. These vehicles could include a flaw with the interior door handle that spring that could cause the door to open unexpectedly in certain circumstances. The release states that dealers will look at all handles for possible problems.</p>\n<p>The other two recalls refer to a group of limo and hearses and a series of ambulance and emergency vehicles, respectively. The former concerns defective vacuum pump relays that would possibly lead to fires, and the latter stems from problems with faulty temperature sensors in the vehicle engines. None of these recall issues have been linked to accidents, the source said.</p>\n<p>Each recall case needs to be clearly identified and come with an appropriate plan of action for dealers and consumers to follow. The text of a recall itself is only part of the solution, since it needs to also reach the right individuals within a proper amount of time. Writing for Michigan Radio, Tracy Samilton said that digital channels are <a href=\"http://michiganradio.org/post/six-things-you-should-know-about-auto-recalls\">providing new opportunities</a> for manufacturers to get their message out.</p>\n<p>“Automakers are increasingly turning to social media to try to boost completion rates,” Samilton says. “As Internet-connected infotainment devices in cars become more common and sophisticated, automakers will be able to send notices of recalls directly to the vehicle.”</p>\n<p>Compliant and advanced recall solutions make successful response to a recall more likely.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"http://activetechnologies.us/rm/?p=3004","createdAt":"2015-04-07T11:05:59.000Z","date_gmt":"2015-04-08T00:50:59.000Z","updatedAt":"2018-04-02T03:03:42.000Z","modified_gmt":"2018-04-02T16:48:42.000Z","display_date":"April 07, 2015","sticky":false,"recall":true,"authors":[{"id":10,"name":"Recall Masters","slug":"recallmasters_admin"}],"acf":{"recall_master_id":null,"nhtsa_campaign_number":null,"recall_date":null,"meta_title":null,"meta_description":null,"meta_keywords":null,"custom_schema":null},"year":2015,"month":4,"featured_image":null,"alt_text":"","cld_public_id":null,"category":{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"},"tags":[],"categories":[{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"}]}]