[{"id":7020,"title":"Control Arm Issues Initiate GM Recall","link":"https://www.motorsafety.org/control-arm-issues-initiate-gm-recall/","status":"publish","slug":"control-arm-issues-initiate-gm-recall","excerpt":"<p>A new series of GM recalls focuses on control arms in multiple brands.</p>\n","description":"<p><em>Warren, MI — May 31, 2016 —&nbsp;</em>A group of eight vehicle&nbsp;models, including Cadillac, Chevrolet and GMC names, are subject to a new overarching recall concerning suspension front control arms. After the manufacturer&#8217;s report date of April 27,&nbsp;4,789 potential units are part of this action and may leave drivers in danger of a sudden loss of control while steering.<br />\n<span id=\"pk-id\"></span></p>\n<p>This is a relatively recent recall, with the official vehicle chronology only dating back to April 5. According to the Part 573 Safety Recall Report, available through the National Highway Traffic Safety Administration&#8217;s website, the manufacturer <a href=\"http://www-odi.nhtsa.dot.gov/acms/cs/jaxrs/download/doc/UCM515016/RCLRPT-16V256-9182.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">noticed a &#8220;deformed&#8221; upper control arm</a> in a&nbsp;GMC Yukon XL Denali, caused by incomplete welding within the vehicle. The control arm failure can occur no matter which speed the affected cars are driving, and may also be set off by &#8220;jarring road inputs.&#8221;</p>\n<p>The issue traces back further to the component&#8217;s supplier,&nbsp;Multimatic Inmetmatic. The planned dealer notification date was listed as April 27, and after this, dealers were instructed to fix the vehicle alignment of these models and replace both the right and left front upper control arms. Since April 8, the supplier has improved its&nbsp;manufacturing process to reduce possible dangers and make these cars more compliant with General Motors regulations.</p>\n<p>No specific owner notification date was listed in this report, though it did state that the manufacturer will reveal the official mail date when it becomes available. All of the affected vehicles carry either the 2016 or 2017 model years.</p>\n<p>The models themselves include the Cadillac Escalade and Escalade&nbsp;ESV, the Chevrolet Silverado 1500, Suburban and Tahoe, and the GMC Sierra, Yukon and Yukon XL. The manufacturer urges owners to contact the individual companies involved in each of these GM recalls for more information.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=7020","createdAt":"2016-05-31T00:31:53.000Z","date_gmt":"2016-05-31T06:16:53.000Z","updatedAt":"2020-10-03T07:09:34.000Z","modified_gmt":"2020-10-03T20:54:34.000Z","display_date":"May 31, 2016","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2016,"month":5,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/05/shutterstock_1652361367-1-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_1652361367-1","category":{"id":72,"name":"GMC","slug":"gmc-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/gmc_RM.png"},"tags":[],"categories":[{"id":72,"name":"GMC","slug":"gmc-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/gmc_RM.png"}]},{"id":7015,"title":"Police Vehicles Part of Joint Ford Recall","link":"https://www.motorsafety.org/police-vehicles-part-of-joint-ford-recall/","status":"publish","slug":"police-vehicles-part-of-joint-ford-recall","excerpt":"<p>Police Interceptor vehicles are part of a large recent Ford recall.</p>\n","description":"<p>Dearborn, MI — May 30, 2016 — Ford finished the month of April with a joint statement addressing several recalls impacting its vehicles in the United States. While the largest of these involved speed sensor issues, another one included Ford Police Interceptor and Explorer vehicles with the 2014 and 2015 model years. Altogether, the recall concerns suspension problems in 81,036 total autos, with 75,364 in the United States.<br />\n<span id=\"pk-id\"></span></p>\n<p>The affected Interceptors have a different manufacturing history than the Explorers also involved in this recall. Though both sets of vehicles were built at the company&#8217;s Chicago Assembly Plant in 2014, the Interceptors were produced between January 17 and May 31 last year.</p>\n<p>According to this release, the vehicles are possibly subject to a <a href=\"https://media.ford.com/content/fordmedia/fna/us/en/news/2016/04/27/ford-motor-company-issues-three-safety-recalls-and-two-safety-co.html\" target=\"_blank\" rel=\"noopener noreferrer\">weak rear suspension toe link</a>, which could leave drivers vulnerable to a loss of control or possibly a crash. This defect has led to one confirmed accident and injury, and the manufacturer attributes the danger to &#8220;poor weld quality&#8221; in the affected links. Both the left and right links can be affected, requiring dealers to replace each of them for a full remedy. The fix also requires dealers to align the rear suspension.</p>\n<p>The Ford recalls aren&#8217;t the only recent example of a police vehicle action. In March, Chevrolet recalled&nbsp;6,280 Caprice Police Pursuit Vehicles for a corrosion problem that could cancel out the vehicle&#8217;s power steering.</p>\n<p>If this happened suddenly, drivers could be in danger of losing control over the vehicle. A press release on this case from March 18 said that the company had not as of yet planned an official repair date. Chevrolet had, however, developed a basic remedy plan, which involved dealers replacing the entire steering gear assembly in affected units. No injuries were reported as of the statement&#8217;s release.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=7015","createdAt":"2016-05-30T04:26:45.000Z","date_gmt":"2016-05-30T18:11:45.000Z","updatedAt":"2020-10-03T07:11:47.000Z","modified_gmt":"2020-10-03T20:56:47.000Z","display_date":"May 30, 2016","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2016,"month":5,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/05/shutterstock_1483582394-1-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_1483582394-1","category":{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"},"tags":[],"categories":[{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"}]},{"id":7009,"title":"Ford Recall Will Focus on Shifting Difficulties","link":"https://www.motorsafety.org/ford-recall-will-focus-on-shifting-difficulties/","status":"publish","slug":"ford-recall-will-focus-on-shifting-difficulties","excerpt":"<p>Ford is addressing sudden shifting issues as part of a larger series of safety and compliance recalls.</p>\n","description":"<p><em>Dearborn, MI — May 28, 2016 —&nbsp;</em>Some Ford drivers could experience a jarring gear change, according to a press release from the manufacturer&#8217;s official site. That source announced a new recall meant to fix a&nbsp;software issue that may cause unwanted transmission shifts. This was <a href=\"https://media.ford.com/content/fordmedia/fna/us/en/news/2016/04/27/ford-motor-company-issues-three-safety-recalls-and-two-safety-co.html\" target=\"_blank\" rel=\"noopener noreferrer\">one of a series of five Ford recalls</a> (three for safety and two for safety compliance) that will affect cars across the United States, Canada and Mexico.<br />\n<span id=\"pk-id\"></span></p>\n<p>The shifting issue represents the largest of these recalls, with 201,900 vehicles potentially affected and&nbsp;total model years ranging between 2011 and 2012. The four models in question (the Ford F-150, Expedition and Mustang as well as the Lincoln Navigator)&nbsp;will have a&nbsp;6R80 transmission.</p>\n<p>Because of problems with an included sensor, the press release stated, vehicles could suddenly change speed and possibly lose control. Though there are no injuries or fatalities attributed to this fault, there have been three reports of accidents.</p>\n<p>The remedy described in this statement varies slightly depending on whether or not the dealer finds diagnostic trouble codes in the vehicle&#8217;s affected control modules. Both cases involve updating the control software as necessary.</p>\n<p>This is similar to another major recall related to shifting issues from Fiat Chrysler Automobiles. In that case, the automaker recalled a total of&nbsp;811,586 vehicles to address shifting systems that were confusing users.</p>\n<p>While the models themselves did not suffer any equipment failure, a statement from that company did mention 41 injuries that may come from the difficult transmission lever. Drivers were at a possible risk if they exited these vehicles before fully parking them.</p>\n<p>After the latest FCA enhancements, affected vehicles in this recall will reportedly automatically halt a vehicle to prevent any unintended movements. These vehicles already contain some warning systems, including chimes, to alert the driver when the car is not in park while the doors are open.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=7009","createdAt":"2016-05-27T02:23:10.000Z","date_gmt":"2016-05-27T16:08:10.000Z","updatedAt":"2020-10-03T07:15:26.000Z","modified_gmt":"2020-10-03T21:00:26.000Z","display_date":"May 27, 2016","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2016,"month":5,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/05/shutterstock_401635342-1-768x406.jpg","alt_text":"","cld_public_id":"shutterstock_401635342-1","category":{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"},"tags":[],"categories":[{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"}]},{"id":6950,"title":"Jaguar Recalls Vehicles at Risk of Fire","link":"https://www.motorsafety.org/jaguar-recalls-vehicles-at-risk-of-fire/","status":"publish","slug":"jaguar-recalls-vehicles-at-risk-of-fire","excerpt":"<p>Jaguar XF could have a loose fuel tank flange leading to a potential fuel leak. 2010 Jaguar XF recalled to resolve issue. </p>\n","description":"<p><em>Mahwah, New Jersey — May 25, 2016 — </em>Fuel tank problems may lead to an enhanced fire risk in several 2010 Jaguar XF vehicles, according to a safety <a href=\"https://static.nhtsa.gov/odi/rcl/2016/RCLQRT-16V187-2080.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">recall report</a> from the National Highway Traffic Safety Administration. These affected autos, produced between December 2008 and April 2009, could contain a cracked fuel outlet flange within the tank, leading to a possible fluid leak underneath the vehicle.<br />\n<span id=\"pk-id\"></span></p>\n<p>Owners will be notified on May 20, according to the report, more than a month after the dealer notification date of April 5. Authorized sources will fix these vehicles by replacing the flange with a new unit that meets safety standards. No reported accidents have been traced to this issue.</p>\n<p>Drivers will reportedly have multiple signs that the issue may be present, including fuel odors or a lit Malfunction Indicator Lamp. No description of the cause for this recall was given, and there was no description of how the new component will specifically improve on the faulty one. Just 28 vehicles are part of this action.</p>\n<p>A chronology also included by the NHTSA  detailed the steps leading up to this voluntary recall. The first reports of a flange failure in these vehicles date back to 2012, when investigations first began. Jaguar Land Rover launched a previous recall campaign that same year, after a company Field Review Committee decided that the fuel leak constituted a safety hazard.</p>\n<p>More recently, the Senior Review Panel decided that newer vehicles included in the recall should follow the previous recall strictures. Liquid is explicitly only stated to appear under affected vehicles when they are &#8220;static,&#8221; and when they pose the largest risk (if a heat source is present). In a message to dealers, the manufacturer stated that dealers need to hold affected new cars.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=6950","createdAt":"2016-05-25T04:01:07.000Z","date_gmt":"2016-05-25T17:46:07.000Z","updatedAt":"2020-10-27T05:33:29.000Z","modified_gmt":"2020-10-27T19:18:29.000Z","display_date":"May 25, 2016","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"16V187000","recall_date":"April 4, 2016"},"year":2016,"month":5,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/05/shutterstock_663782494-1-768x514.jpg","alt_text":"","cld_public_id":"shutterstock_663782494-1","category":{"id":41,"name":"Jaguar","slug":"jaguar-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/jaguar_RM.png"},"tags":[{"id":1759,"name":"2010 Jaguar XF recall","slug":"2010-jaguar-xf-recall"},{"id":1760,"name":"Jaguar fuel leak","slug":"jaguar-fuel-leak"}],"categories":[{"id":41,"name":"Jaguar","slug":"jaguar-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/jaguar_RM.png"}]},{"id":6944,"title":"BMW Recalls 7 Series Vehicles as Precaution","link":"https://www.motorsafety.org/bmw-recalls-7-series-vehicles-as-precaution/","status":"publish","slug":"bmw-recalls-7-series-vehicles-as-precaution","excerpt":"<p>BMW is voluntarily recalling several thousand vehicles.</p>\n","description":"<p><em>Westwood,NJ — May&nbsp;19, 2016 —&nbsp;</em>Due to air bag concerns, BMW has launched a voluntary recall to address issues that may affect deployment. On March 24, the National Highway Traffic Safety Administration <a href=\"http://www-odi.nhtsa.dot.gov/acms/cs/jaxrs/download/doc/UCM500512/RCLRPT-16V173-6249.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">received a&nbsp;report of the company&#8217;s recall</a>, which includes 6,110 vehicles. These models are all part of the company&#8217;s &#8220;7 Series,&#8221; which encompasses the BMW 740Li, 750 Li and 750 Lxi.<br />\n<span id=\"pk-id\"></span></p>\n<p>According to the Part 573 Safety Recall Report for this case, the affected vehicles could malfunction due to a buildup of &#8220;metallic stamping particle residue.&#8221; This material could potentially short circuit the air bag modules, leaving occupants unprotected during a collision. Though the air bag would only be temporarily disabled during a short, it could theoretically be enough to cause a safety risk.</p>\n<p>If the reset does occur, the report stated, the air bag&nbsp;warning lamp might also turn on, although this is not listed as a possible indicator showing a warning. The manufacturer chose to perform this voluntary recall action more than three months after the supplier warned them about possible problems with the module. The particles in the module housing can detach and hit the circuit board, leading to the possible system reset.</p>\n<p>May 24 is the planned owner notification date. The report doesn&#8217;t go into details on the remedy program, simply saying that dealers will replace the air bag control module. A spokesman confirmed to Reuters that the effort is indeed purely precautionary and not in response to specific claims, as the company has produced 47,000 vehicles for this particular series.</p>\n<p>The recall also has international consequences, the article added, with other vehicles recalled in China and Germany. The affected vehicles were produced between July 1, 2015 and December 11, 2015 and are all classified as &#8220;light vehicles.&#8221;<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=6944","createdAt":"2016-05-19T01:50:11.000Z","date_gmt":"2016-05-19T15:35:11.000Z","updatedAt":"2020-10-03T07:31:41.000Z","modified_gmt":"2020-10-03T21:16:41.000Z","display_date":"May 19, 2016","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2016,"month":5,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/05/shutterstock_1409474015-3-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_1409474015-3","category":{"id":15,"name":"BMW","slug":"bmw-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/bmw_RM.png"},"tags":[],"categories":[{"id":15,"name":"BMW","slug":"bmw-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/bmw_RM.png"}]},{"id":6919,"title":"Nissan Addressing Actuator Issues in New Recall","link":"https://www.motorsafety.org/nissan-addressing-actuator-issues-in-new-recall/","status":"publish","slug":"nissan-addressing-actuator-issues-in-new-recall","excerpt":"<p>A Toyota recall will fix faulty anti​-lock braking systems.</p>\n","description":"<p><em>Franklin, TN — May 18, 2016 —&nbsp;</em>Brake fluid issues are the source of a new series of Nissan recalls for Murano and Maxima model vehicles, with 2016 or 2017 model years. Only the 12,622 vehicles included in this effort are subject to the recall since they contain a specific type of anti -lock braking system actuator. As with a Toyota recall announced earlier this year, the Nissan action concerns vehicles with weakened O-rings: this condition could lower brake pressure to dangerous levels.<br />\n<span id=\"pk-id\"></span></p>\n<p>The Part 573 Recall Safety Report stated that the efforts behind the recall <a href=\"http://www-odi.nhtsa.dot.gov/acms/cs/jaxrs/download/doc/UCM510388/RCLRPT-16V193-4295.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">go back to January 2016</a>, when a Nissan plant operator discovered a possible issue within a pair of actuators. Nissan officially decided to enact the voluntary recall on March 30, with a plan to notify owners within 60 days, with the recall proper beginning on June 6. Affected vehicles could violate the Federal Motor Vehicle Safety Standards.</p>\n<p>Dealers can help owners by replacing any actuators that fall within the range of the recall. Though there is reportedly no field information related to this issue, the company began looking for any relevant field data between February and March. The affected parts come from the supplier&nbsp;ADVICS&nbsp;North America, based in Lebanon, Ohio.</p>\n<p>The similar Toyota recalls were announced on April 6, with the company warning of damaged actuator components. This case involved 12,400 ES350 vehicles, among others, and only concerned 2016 model year vehicles.</p>\n<p>Dealers were instructed to use the serial number to find whether or not a brake actuator is included in the recall. The actuator in this case doesn&#8217;t just control anti -lock braking, but also traction and vehicle stability control, posing possible&nbsp;larger issues for drivers when something&nbsp;goes wrong.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=6919","createdAt":"2016-05-18T01:09:46.000Z","date_gmt":"2016-05-18T14:54:46.000Z","updatedAt":"2020-10-03T07:33:39.000Z","modified_gmt":"2020-10-03T21:18:39.000Z","display_date":"May 18, 2016","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2016,"month":5,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/05/shutterstock_538791607-1-768x510.jpg","alt_text":"","cld_public_id":"shutterstock_538791607-1","category":{"id":14,"name":"Nissan","slug":"nissan-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/nissan_RM.png"},"tags":[],"categories":[{"id":14,"name":"Nissan","slug":"nissan-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/nissan_RM.png"}]},{"id":6921,"title":"Shifting Concerns Prompt Worldwide Dodge Charger Recall","link":"https://www.motorsafety.org/shifting-concerns-prompt-worldwide-dodge-charger-recall/","status":"publish","slug":"shifting-concerns-prompt-worldwide-dodge-charger-recall","excerpt":"<p>Some drivers might not realize that their Fiat Chrysler vehicles are in park.</p>\n","description":"<p><em>Auburn Hills, MI — May 17, 2016 —&nbsp;</em>An issue in many Fiat Chrysler autos has led to a wide-ranging recall concerning vehicle&nbsp;transmission systems. Drivers in these affected vehicles may put themselves at risk if they don&#8217;t fully understand what gear is currently engaged<br />\n<span id=\"pk-id\"></span></p>\n<p>Although there are already alerts in these cars that should signal that a vehicle is parked, the company reports that this isn&#8217;t always enough. As a result, at least 41 injuries may be traced to this issue, though a press statement insists that it is <a href=\"http://media.fcanorthamerica.com/newsrelease.do?id=17455&amp;mid=1\" target=\"_blank\" rel=\"noopener noreferrer\">not due to any equipment failure.</a></p>\n<p>The source lists three models included in the Chrysler Recalls: Dodge Charger, Chrysler 300 and Jeep Grand Cherokee. Model years range from 2012 to 2015, and the majority of the units (811,586) are in the United States. The manufacturer is making efforts to contact affected owners as needed while the recall continues. The new shift strategy will keep the vehicles from moving unexpectedly, further protecting users who don&#8217;t understand the initial suggestions.</p>\n<p>Currently, these vehicles feature electronic indicators, including lights, to let drivers know if their vehicles are currently in park. To avoid confusion, the adjusted cars will include an automatic stop in case drivers don&#8217;t realize their car is able to start rolling away. The gear shift lever is not a reliable signal of which gear the car is using, the source stated.</p>\n<p>The 2015 Jeep Grand Cherokee was also subject to a recall. The National Highway Traffic Safety Administration&#8217;s statement from March 22 said that 14,768 units may contain front left brake calipers that might break. This issue was a significant risk because it could prevent drivers from stopping their vehicles early enough and leave them vulnerable to a collision.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=6921","createdAt":"2016-05-17T03:44:52.000Z","date_gmt":"2016-05-17T17:29:52.000Z","updatedAt":"2020-10-28T00:05:51.000Z","modified_gmt":"2020-10-28T13:50:51.000Z","display_date":"May 17, 2016","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2016,"month":5,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/05/shutterstock_1194298462-1-768x576.jpg","alt_text":"","cld_public_id":"shutterstock_1194298462-1","category":{"id":20,"name":"Chrysler","slug":"chrysler-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/chrysler_RM.png"},"tags":[],"categories":[{"id":20,"name":"Chrysler","slug":"chrysler-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/chrysler_RM.png"},{"id":7,"name":"Dodge","slug":"dodge-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/dodge.png"},{"id":33,"name":"Jeep","slug":"jeep-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/jeep_ms.png"}]},{"id":6914,"title":"Honda Recall Looks for Wrong Airbags [Video]","link":"https://www.motorsafety.org/honda-recall-looks-for-wrong-airbags-video/","status":"publish","slug":"honda-recall-looks-for-wrong-airbags-video","excerpt":"<p>More than 11,600 Honda Accord Sedans are part of a new recall addressing airbag issues.</p>\n","description":"<p><em>Torrance, CA — May 16, 2016 —</em>More than 11,600 Honda Accord Sedans are part of a new recall addressing airbag issues. According to a press release, these airbags do not meet U.S. standards and could put vehicle occupants in danger. Though the source didn&#8217;t say exactly which features aren&#8217;t compliant, it noted that customers should receive notifications starting this May.</p>\n<p>Airbag modules in these vehicles were accidentally made to South American standards instead of those of the United States. There have been no reports of injury, though the manufacturer has received more than 30 warranty claims. The potentially faulty vehicles were produced between 2003 and 2007.</p>\n<p>Once they receive the official notification, owners can work with dealers to replace the faulty modules.</p>\n<p>Visit our blog for more airbag recall news, including details on the Takata airbag inflator recalls.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=6914","createdAt":"2016-05-16T04:41:11.000Z","date_gmt":"2016-05-16T18:26:11.000Z","updatedAt":"2018-04-02T03:09:30.000Z","modified_gmt":"2018-04-02T16:54:30.000Z","display_date":"May 16, 2016","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":null,"nhtsa_campaign_number":null,"recall_date":null,"meta_title":null,"meta_description":null,"meta_keywords":null,"custom_schema":null},"year":2016,"month":5,"alt_text":"","cld_public_id":null,"category":{"id":4,"name":"Honda","slug":"honda-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/honda_ms.png"},"tags":[],"categories":[{"id":4,"name":"Honda","slug":"honda-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/honda_ms.png"}]},{"id":6858,"title":"Systems in New Toyota Recalls Could Deactivate Air Bags","link":"https://www.motorsafety.org/systems-in-new-toyota-recalls-could-deactivate-air-bags/","status":"publish","slug":"systems-in-new-toyota-recalls-could-deactivate-air-bags","excerpt":"<p>Toyota is recalling several thousand vehicles for possible airbag issues.</p>\n","description":"<p><em>Plano, TX — May 13, 2016 —&nbsp;</em>The Occupation Classification System in several thousand Toyota sedans could make it hard for regular air bag deployment, according to a new press release. Autoblog quoted the statement, which mentioned that <a href=\"http://www.autoblog.com/2016/04/13/2016-toyota-camry-avalon-airbag-recall/\" target=\"_blank\" rel=\"noopener noreferrer\">multiple airbags in each of the affected vehicles</a> may not function correctly in the event of a crash. As of April 13, the manufacturer is reaching out to owners to keep them informed while recall actions continue.<br />\n<span id=\"pk-id\"></span></p>\n<p>The recall will include 58,510 total vehicles, 41,630 of which are Camry sedans and 16,880 of which are Avalon autos. Both models are from the 2016 model year, and could fail to engage the general front passenger airbag and the front passenger knee airbags.</p>\n<p>If the OCS in these vehicles were not properly calibrated, the OCS could keep airbags restrained when they should be deployed. Fixing this issue will require dealers to re-calibrate the OCS for more accurate detection.</p>\n<p>Other automakers have struggled with this issue in recent years. In 2014, Nissan recalled 989,701 vehicles for a similar problem in several car models. That recall only concerned the front passenger seat airbag, and resulted in at least two field incidents, according to Edmunds.com, although there were no fatalities connected to the issue, at least at the time of the company&#8217;s statement.</p>\n<p>More recently, Mercedes-Benz announced a recall for unexpected airbag deployment, although this instance was due to wiring harness problems, not the OCS. It also affected far fewer vehicles than the other two examples, with only 888 cars from two different model types recalled.</p>\n<p>These SUVs have the 2016 model year and were built between last June/July and November. Fixing this issue requires dealers to replace the harnesses and inspect them afterwards as necessary. The same issue could also stall affected vehicles.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=6858","createdAt":"2016-05-13T02:37:03.000Z","date_gmt":"2016-05-13T16:22:03.000Z","updatedAt":"2020-10-03T07:38:14.000Z","modified_gmt":"2020-10-03T21:23:14.000Z","display_date":"May 13, 2016","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2016,"month":5,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/05/shutterstock_1380135872-1-768x502.jpg","alt_text":"","cld_public_id":"shutterstock_1380135872-1","category":{"id":17,"name":"Toyota","slug":"toyota-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/toyota_ms.png"},"tags":[],"categories":[{"id":17,"name":"Toyota","slug":"toyota-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/toyota_ms.png"}]},{"id":6860,"title":"Tesla Recalls Model X Vehicles","link":"https://www.motorsafety.org/tesla-recalls-model-x-vehicles/","status":"publish","slug":"tesla-recalls-model-x-vehicles","excerpt":"<p>Thousands of Tesla X cars have seat issues.</p>\n","description":"<p><em>Palo Alto, CA — May&nbsp;12, 2016 —&nbsp;</em>Weak seating in around 2,700 Model X vehicles have led to a Tesla recall. According to Forbes, the affected vehicles contain lackluster seats that could fold in on themselves in the event of a crash.<br />\n<span id=\"pk-id\"></span></p>\n<p>This represents a possible safety risk, so the company is conducting a voluntary action to address the problem quickly. The source adds that Tesla hopes to complete the recall-related repairs within five weeks, during which time vehicle owners should avoid using their third row seats. The recall will address Model X vehicles that were specifically built before March 26.</p>\n<p>The Los Angeles Times published part of the email sent to Model X owners regarding the issue and <a href=\"http://www.latimes.com/business/autos/la-fi-hy-tesla-recall-model-x-20160411-story.html\" target=\"_blank\" rel=\"noopener noreferrer\">what the manufacturer has done about it so far</a>.</p>\n<p>&#8220;We are emailing to inform you of a proactive action Tesla is taking to ensure your safety as a Model X owner,&#8221; the message reportedly says. &#8220;Tesla&#8217;s internally conducted crash testing demonstrates that Model X will be the first SUV to receive the highest safety rating in every category, and we are committed to ensuring that it remains the safest SUV in the world.&#8221;</p>\n<p>The Times also quoted&nbsp;Tesla&#8217;s sales head John McNeil, who said that there were no reported issues connected to his company&#8217;s vehicles. He stressed the voluntary nature of the recalls, intended to show the business&#8217; interest in better safety.</p>\n<p>A pair of complaints listed with the National Highway Traffic safety Administration noted other issues related to the 2016 Model X, particularly claims of &#8220;faulty latches&#8221; that allow the doors to spring open unexpectedly. One complaint filed on March 17 lists &#8220;rear seats not in place&#8221; as one of many problems, such as a depression in the rear seat.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=6860","createdAt":"2016-05-12T04:01:45.000Z","date_gmt":"2016-05-12T17:46:45.000Z","updatedAt":"2020-10-03T07:40:22.000Z","modified_gmt":"2020-10-03T21:25:22.000Z","display_date":"May 12, 2016","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2016,"month":5,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/05/shutterstock_1202593378-1-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_1202593378-1","category":{"id":21,"name":"Tesla","slug":"tesla-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/tesla-5-202912.png"},"tags":[],"categories":[{"id":21,"name":"Tesla","slug":"tesla-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/tesla-5-202912.png"}]},{"id":6862,"title":"GM Recalls Pickup Trucks for Seatbelt Problems","link":"https://www.motorsafety.org/gm-recalls-pickup-trucks-for-seatbelt-problems/","status":"publish","slug":"gm-recalls-pickup-trucks-for-seatbelt-problems","excerpt":"<p>Last year, GM recalled Silverado and Sierra trucks, and it&#8217;s doing so again now.</p>\n","description":"<p><em>Detroit, MI — May 11, 2016 —&nbsp;</em>A new General Motors recall will include hundreds of thousands of domestic pickup trucks. A press release published by Autoblog&nbsp;detailed the <a href=\"http://www.autoblog.com/2016/04/15/gm-recall-chevrolet-silverado-gmc-sierra-seatbelt/\" target=\"_blank\" rel=\"noopener noreferrer\">seat belt structure issues</a> that could exist in&nbsp;895,232 trucks, including thousands of newer vehicles that need to be stopped on their lots. The international recall will account for&nbsp;slightly more than 1 million&nbsp;vehicles in countries across multiple continents, including Latin America and the Middle East.<br />\n<span id=\"pk-id\"></span></p>\n<p>The problem in these vehicles comes from weak cables in the bodies that could eventually sever over time. Drivers can cause wear to the cable as they move in and out of the front seat. Dealers will solve the problem by inspecting and fixing the tensioner. This will require them to either add a pusher bracket or replace the tensioner assembly altogether, as need be.</p>\n<p>The recall affects two different models: the Chevrolet Silverado and the GMC Sierra 1500. For both, the model years of concern are 2014 and 2015, with these same years also holding true for the related stop-sale notice.</p>\n<p>According to the National Highway Traffic Safety Administration, the GMC 1500 is the source of other recent owner complaints from across the country. On April 5, a consumer in Port Byron, Illinois, noted exterior lighting problems that made it difficult to see while driving at night. An earlier issue, observed in Hiram, Georgia, concerned the abnormal vibration in the vehicle&#8217;s cabin. This persisted even after the rear suspension and tire were replaced on advice of the dealer.</p>\n<p>Both Silverado and Sierra trucks, from the same years as this recall, were involved in a different one launched last October. In that case, the company and the NHTSA noted that the ignition lock actuator could keep keys stuck forward and make it difficult to remove them.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=6862","createdAt":"2016-05-11T01:31:07.000Z","date_gmt":"2016-05-11T07:16:07.000Z","updatedAt":"2020-10-03T07:42:13.000Z","modified_gmt":"2020-10-03T21:27:13.000Z","display_date":"May 11, 2016","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2016,"month":5,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/05/shutterstock_1032215563-2-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_1032215563-2","category":{"id":72,"name":"GMC","slug":"gmc-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/gmc_RM.png"},"tags":[],"categories":[{"id":72,"name":"GMC","slug":"gmc-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/gmc_RM.png"}]},{"id":6804,"title":"Chrysler Recalls Ram Vehicles for Power Steering","link":"https://www.motorsafety.org/chrysler-recalls-ram-vehicles-for-power-steering/","status":"publish","slug":"chrysler-recalls-ram-vehicles-for-power-steering","excerpt":"<p>Several hundred Chrysler trucks were involved in a recent recall.</p>\n","description":"<p><em>Auburn Hills, MI — May 04, 2016 —&nbsp;</em>Earlier this month, Fiat Chrysler announced a new recall centered around a series of Ram trucks. These vehicles were built between last January and September, and represent&nbsp;a possible threat to occupants due to power steering circuit contamination.<br />\n<span id=\"pk-id\"></span></p>\n<p>The investigations officially began in August&nbsp;2015: A&nbsp;chronology document filed with the National Highway Traffic Safety Administration revealed that was when electronic power steering systems <a href=\"http://www-odi.nhtsa.dot.gov/acms/cs/jaxrs/download/doc/UCM500266/RCORRD-16V167-9810.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">appeared in user complaints</a>. It started tracking possibly affected parts January 11, 2016.</p>\n<p>The contamination issues could impact a total of 442 Ram 1500 DS or DX vehicles. The affected circuit boards may have been constructed during a single day at the production plant. A Part 573 Report listed with the NHTSA cited the Nexteer Automotive Corporation, also based in Michigan, as the supplier involved in this case. They helped the manufacturer trace suspicious EPS units.</p>\n<p>Drivers that see a lit up Malfunction Indicator Lamp may want to proceed with caution, the report added. If the control circuit components suffer a short, the power steering function may permanently and suddenly shut off. Alternately, the power steering could fail intermittently, or the steering wheel could simply become more difficult to use. The remedy involves fully replacing the affected EPS.</p>\n<p>This voluntary recall comes after no official notice of accidents or damage, although the manufacturer did&nbsp;receive three field reports as of March 11, the chronology stated. This source also noted that the suspect production period varies slightly depending on the plant location: The Saltillo plant&#8217;s suspect period begins on January 22, 2015, but only extends just under a month to February 17. The longer period belongs to the Warren plant, which is under suspicion from January 23 to September 13.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=6804","createdAt":"2016-05-04T01:04:56.000Z","date_gmt":"2016-05-04T14:49:56.000Z","updatedAt":"2020-10-28T00:06:09.000Z","modified_gmt":"2020-10-28T13:51:09.000Z","display_date":"May 04, 2016","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2016,"month":5,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/05/shutterstock_771876946-1-768x511.jpg","alt_text":"","cld_public_id":"shutterstock_771876946-1","category":{"id":9,"name":"RAM","slug":"ram-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/11/RAM.png"},"tags":[],"categories":[{"id":9,"name":"RAM","slug":"ram-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/11/RAM.png"}]},{"id":6798,"title":"The New Nissan Recalls More than 1,550 Frontier Vehicles","link":"https://www.motorsafety.org/the-new-nissan-recalls-more-than-1550-frontier-vehicles/","status":"publish","slug":"the-new-nissan-recalls-more-than-1550-frontier-vehicles","excerpt":"<p>Some Nissan vehicles are at risk of possible vehicle fires</p>\n","description":"<p><em>Franklin,&nbsp;TN — May 03, 2016 —&nbsp;</em>According to a recent National Highway Traffic Administration report, March 7 found saw an accident at a Nissan plant that <a href=\"http://www-odi.nhtsa.dot.gov/acms/cs/jaxrs/download/doc/UCM508823/RCLRPT-16V181-0554.PDF\">would later lead to a recall</a>. Further&nbsp;investigations revealed that a starter wire harness terminal had been installed incorrectly on a 2016 Nissan Frontier. After further inspection, the manufacturer officially launched a voluntary recall action, including 1,554 Frontier pickup trucks.<br />\n<span id=\"pk-id\"></span></p>\n<p>Because of the way these harnesses were installed, the report states, affected Frontiers with a V6 engine could experience an electrical short, eventually causing a possible &#8220;thermal incident.&#8221; To fix the issue, dealers will reorient the harness to meet safety standards. Only 18 percent of the recalled vehicle population is believed to have the defect present. A short could lead to a possible fire in affected vehicles.</p>\n<p>In a bulletin for dealers, the manufacturer provided more specific instructions on the repair procedure. The remedy does not require additional parts, but it does demand that dealer staff look closely at the motor wire area to improve harness alignment.</p>\n<p>In particular, the wire eyelet needs to be facing the correct position: If not, the person conducting the repair has to reposition the wire so it&#8217;s&nbsp;at the right angle before reconnecting the battery. The original owner notification date was listed as some time in early April.</p>\n<p>On the other hand, if the eyelet is already in the recommended position, no further action may be necessary. What&#8217;s more, mechanics only need to replace the heat shield if there are signs of damage. The same document also stated that the recall has expanded to now include 1,680 Nissan Frontier vehicles. Out of this number, the majority (1,543 vehicles) were in the United States. Other countries/territories included in the new action are Canada, Puerto Rico, Guam and Saipan.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=6798","createdAt":"2016-05-03T02:01:02.000Z","date_gmt":"2016-05-03T15:46:02.000Z","updatedAt":"2020-10-03T10:27:01.000Z","modified_gmt":"2020-10-04T00:12:01.000Z","display_date":"May 03, 2016","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2016,"month":5,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/05/shutterstock_1797773419-2-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_1797773419-2","category":{"id":14,"name":"Nissan","slug":"nissan-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/nissan_RM.png"},"tags":[],"categories":[{"id":14,"name":"Nissan","slug":"nissan-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/nissan_RM.png"}]},{"id":6800,"title":"Multiple Bugatti Recalls Issued at Once","link":"https://www.motorsafety.org/multiple-bugatti-recalls-issued-at-once/","status":"publish","slug":"multiple-bugatti-recalls-issued-at-once","excerpt":"<p>Bugatti has issued three recalls within short distance of each other.</p>\n","description":"<p><em>Dorlisheim, France — May 02, 2016 —&nbsp;</em>Three different issues have prompted multiple recalls for different Bugatti Veyron cars. The National Highway Traffic Safety Administration listed two different recalls on April 7 for the same model, albeit for varying model years. Neither of these have any incidents or damage reports associated with them, and the manufacturer has not issued a set recall date for any of them to begin.<br />\n<span id=\"pk-id\"></span></p>\n<p>The first of these involves a group of 13 Veyron vehicles, produced between October and December 2006 for model years ranging between 2006 and 2008. The protection on the B+ Cable in these vehicles could corrode, leading to a possible fire if flammable material is present. The problem comes from water exposure to the cable, and the fix will prevent this from happening.</p>\n<p>Bugatti&#8217;s second recall concerns 72 Veyron and Veyron Grand Sport recalls split into two groups: those produced between 2006 and 2010, and those produced between 2009 and 2010. Both of these sets have faulty sensors that may lead to incorrect fuel tank readings . This is dangerous for drivers, who could mistakenly believe they have more fuel than they actually do, based on this signal. The solution requires a replacement for the&nbsp;fuel tank control unit.</p>\n<p>A press release on Autoblog mentions a third, <a href=\"http://www.autoblog.com/2016/04/13/even-the-bugatti-veyron-is-subject-to-recalls/\" target=\"_blank\" rel=\"noopener noreferrer\">slightly older Bugatti recall</a>, this one impacting Veyron, Veyron Grand Sport and Veyron Super Sport autos. The oldest of these model years dates back to 2006, and the newest&nbsp;is 2013.</p>\n<p>While this recall also concerns corrosion, this time the aluminum reference plates on the underside of the vehicle are the areas that&nbsp;could be affected. With enough wear, these plates could detach from the vehicle entirely, leaving the occupants at risk while also posing a road hazard. Dealers will solve this problem by riveting the plates to the body of the vehicles more securely.</p>\n<p>A series of GM recalls for police vehicles with power steering problems also involved corrosion. The NHTSA recorded this action on March 28.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=6800","createdAt":"2016-05-02T03:30:23.000Z","date_gmt":"2016-05-02T16:15:23.000Z","updatedAt":"2020-10-03T10:29:30.000Z","modified_gmt":"2020-10-04T00:14:30.000Z","display_date":"May 02, 2016","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2016,"month":5,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/05/shutterstock_15202678-1-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_15202678-1","category":null,"tags":[],"categories":[]}]