[{"id":8714,"title":"BMW Contends With Fuel Leak","link":"https://www.motorsafety.org/bmw-contends-fuel-leak/","status":"publish","slug":"bmw-contends-fuel-leak","excerpt":"<p>BMW is recalling numerous models over a fuel leak issue.</p>\n","description":"<p>Improperly crimped wiring for the fuel pumps in gas tanks found in numerous BMW models <a href=\"http://www-odi.nhtsa.dot.gov/owners/SearchResults?searchType=ID&amp;targetCategory=R&amp;searchCriteria.nhtsa_ids=16V746000\" target=\"_blank\" rel=\"noopener noreferrer\">may cause small fuel leaks</a>, according to a report from the National Highway Traffic Safety Administration. Drivers may notice the smell of gasoline inside their vehicles, and might also see their check engine lights turn on. In addition, the fuel pumps could stop working, causing engines to stall and increasing the risk of a crash.<br />\n<span id=\"pk-id\"></span></p>\n<h3><strong>The Defect</strong></h3>\n<p>BMW is recalling 136,188 vehicles in the U.S. and 18,284 in Canada as a result of loose wiring that could cause connectors to melt, resulting in the fuel leak. The list of affected models includes the 2007-2011 X5, the 2008-2011 X6, the 2010-2011 X6 ActiveHybrid, the 2010-2011 5-Series Gran Turismo, the 2011-2012 528I, the 2011-2012 535I, the 2011-2012 550I, the 2012 640I&nbsp;and the 2012 650I.</p>\n<h3><strong>Timeline</strong></h3>\n<ul>\n<li>June 2011 &#8211; BMW first learned about customer complaints of a fuel odor. Further analysis found that the evaporative fuel tank leak diagnostic system could detect the issue. BMW began to alert customers.</li>\n<li>September 2014 &#8211; The growing number of warranty claims related to this issue caused BMW to issue a worldwide extended warranty program, providing coverage for 10 years and unlimited mileage.</li>\n<li>October 2014 &#8211; BMW conducted a part recall in China for the same issue, and submitted a Part 579 report to the NHTSA, referencing the existing warranty program.</li>\n<li>February 2015 &#8211; BMW extended its recall to Japan. It amended the Part 579 report and resubmitted it to the NHTSA.</li>\n<li>June 2016 &#8211; BMW performed a service action in South Korea in response to a request from the Korean government over this issue.</li>\n<li>October 2016 &#8211; BMW found that the issue was still common in vehicles that had not already had their fuel delivery modules replaced. BMW conducted a voluntary recall on all vehicles that had not been repaired.</li>\n</ul>\n<h3><strong>Resolution</strong></h3>\n<p>BMW will notify all owners of the issue and offer fuel pump replacements free of charge. This will begin Dec. 5, 2016.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=8714","createdAt":"2016-10-31T03:10:09.000Z","date_gmt":"2016-10-31T16:55:09.000Z","updatedAt":"2020-10-03T02:01:56.000Z","modified_gmt":"2020-10-03T15:46:56.000Z","display_date":"October 31, 2016","sticky":false,"recall":false,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2016,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/10/shutterstock_1278856969-1-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_1278856969-1","category":{"id":15,"name":"BMW","slug":"bmw-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/bmw_RM.png"},"tags":[],"categories":[{"id":15,"name":"BMW","slug":"bmw-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/bmw_RM.png"}]},{"id":8537,"title":"Ford Doors May Open Unexpectedly","link":"https://www.motorsafety.org/ford-doors-may-open-unexpectedly/","status":"publish","slug":"ford-doors-may-open-unexpectedly","excerpt":"<p>Can you imagine cars with doors that opened on a whim? That was the reason for a recent recall by Ford.</p>\n","description":"<p><em>Dearborn, MI &#8211; October&nbsp;27, 2016 &#8211;</em> A component in the door latches may break in select Ford vehicles which <a href=\"http://www-odi.nhtsa.dot.gov/acms/cs/jaxrs/download/doc/UCM538902/RCLRPT-16V643-8175.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">prevents the doors from latching shut</a> and may lead to a driver believing all the doors are shut when in fact, they are not, according to a report from the National Traffic Safety Administration. Besides the obvious inconvenience of having doors that don&#8217;t lock, doors that are closed the wrong way run the risk of flying open without a moment&#8217;s notice. For plenty of reasons, such a scenario would not be ideal for the driver or any passengers.<br />\n<span id=\"pk-id\"></span></p>\n<h3>The Defect</h3>\n<p>Ford is recalling certain model year Ford Focuses manufactured anytime from 2012 to 2015, Ford Escapes from 2013 to 2015, C-MAXs, Lincoln MKC and Ford Mustangs from 2015 as well as Ford Transit Connect vehicles manufactured between 2014 and 2016. Keeping drivers and passengers inside the car while it is moving is paramount to safety, but the bad latches may make that a problem. As of September 2, 2016, Ford&#8217;s investigation into the matter had found one accident and three alleged injuries as a result of the faulty latch. There are more than 2.3 million vehicles affected by this recall.</p>\n<h3>Timeline of Ford&#8217;s Response</h3>\n<ul>\n<li>October 2015: Ford&#8217;s analysis of warranty and field data discovered the problem in the door latches and submitted the issue to Ford&#8217;s Critical Concern Review Group.</li>\n<li>December 2015 &#8211; March 2016: &nbsp;Ford conducted a return analysis and comprehensive data analysis of reports. The Fiesta and Fusion models were recalled as well.</li>\n<li>January 7, 2016: Ford opened an earlier investigation as the result of 2013-2015 investigation into similar reports that occurred from 2013 to 2015. Ford Escapes were mentioned a lot on those reports.</li>\n<li>March 3, 2016: The 2013 Ford Focus vehicles had notable problems with latches the ability to open.</li>\n<li>April 14, 2016: Although specific causes for the door latch malfunction could not be readily identified, Ford took notice of the fact that there were several instances of faulty door latches across various Ford vehicles.</li>\n<li>April &#8211; June 2016: Although there was a pattern in the gathered data, there was no hard evidence to prove the pinpoint location of the problem. Although the potential for a problem existed, there was no evidence of a precise solution.</li>\n<li>June 23, 2016: Ford noted patterns emerging from the data, but did not acknowledge anything specific.</li>\n<li>July 2016: Ford Focus and Escape vehicles with latches made from the same facility in Mexico reported issues with the vehicles. On July 29, 2016, Ford&#8217;s Field Review Committee approved a safety recall for the most at-risk vehicles based on the data presented to them.</li>\n<li>August 4-26, 2016: Through ongoing discussions with the National Highway Traffic Safety Administration, Ford extended their safety recall for every vehicle that falls under this category.</li>\n<li>September 1, 2016: Ford&#8217;s Field Review Committee reviewed the concern and approved action.</li>\n</ul>\n<h3>The Solution</h3>\n<p>Ford&#8217;s solution to the defect starts with notifying all of the owners of the problems associated with their vehicles. Next, dealerships will schedule appointments with the customers to replace the faulty door latches with improved parts, free of charge. Because replacement parts are limited, individual owners will be sent an interim notification beginning on October 3, 2016. Parts should become available during the second quarter of 2017, and customers will be notified when parts are available.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=8537","createdAt":"2016-10-28T04:12:06.000Z","date_gmt":"2016-10-28T17:57:06.000Z","updatedAt":"2020-10-03T02:03:49.000Z","modified_gmt":"2020-10-03T15:48:49.000Z","display_date":"October 28, 2016","sticky":false,"recall":false,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2016,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/10/shutterstock_224727334-1-768x511.jpg","alt_text":"","cld_public_id":"shutterstock_224727334-1","category":{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"},"tags":[],"categories":[{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"}]},{"id":8539,"title":"The Problem With Mazda Lift Gates","link":"https://www.motorsafety.org/problem-mazda-lift-gates/","status":"publish","slug":"problem-mazda-lift-gates","excerpt":"<p>Mazda vehicles saw lift gates falling unexpectedly on drivers and passengers. Since then, the company has issued a recall on affected vehicles.</p>\n","description":"<p><em>Washington, D.C. &#8211; October 26, 2016 &#8211;</em> The lift gate of Mazda vehicles are beginning to <a href=\"http://www-odi.nhtsa.dot.gov/acms/cs/jaxrs/download/doc/UCM539426/RCAK-16V644-6326.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">drop unexpectedly,</a> according to a memo released by the National Highway Traffic Administration. The result is usually not pretty for anyone involved. The individual working with the car is likely to be injured when the lift gate of a vehicle drops unexpectedly toward him or her. In a variety of vehicles, Mazda found that the struts of the lift gate may corrode over time, which is likely responsible for the gate dropping. The company is recalling Mazda3 and Mazdaspeed3s&nbsp;made between 2010 and 2013, Mazda5s&nbsp;from October 26, 2010 to June 22, 2015,&nbsp;CX-3 vehicles from June 1, 2015, to December 26, 2015, and CX-5s&nbsp;from December 15, 2011, to December &nbsp;26, 2015.<br />\n<span id=\"pk-id\"></span></p>\n<h3>The Defect</h3>\n<p>Although professionals are still working to find out the exact causes of such a problem in the lift gates, researchers believe that insufficient corrosion protective coating was applied in the first place. There are plenty of things that can cause corrosion to those parts. If materials like that are exposed to water that contains road salt, the compound can cause corrosion. If that is the case, the mechanisms holding the lift gates up will not be able to do their job properly. That is when issues like unexpected drops occur.</p>\n<h3>Timeline Of Mazda&#8217;s Response</h3>\n<p>Unlike other recall processes, Mazda has taken a relatively straightforward approach to this issue. Some manufacturers might let this kind of issue drag on for years, but in less than that long, Mazda is taking steps to fixing the problem. Here is a rough timeline for the actions by Mazda:</p>\n<ul>\n<li>January 2016: Mazda was notified that there was an investigation on the corrosion of parts that prevent lift gates from falling unexpectedly.</li>\n<li>March 2016: Mazda received information saying that salt water may be responsible for penetrating the gap between the outer tube and the end cap. Combined with temperature changes, corrosion can occur.</li>\n<li>April &#8211; August, 2016: An internal investigation was launched by leaders at Mazda. Although no broken parts were found, the outer tubes of some returned parts were confirmed to be corroded. Mazda then conducted an anti-corrosion evaluation. The results were that the anti-corrosion performances by certain vehicles were not up to par.</li>\n<li>August 30, 2016: There still isn&#8217;t enough evidence from global markets to cause Mazda manufacturers to panic. But Mazda professionals acknowledge that lift gates may fall or break off vehicles in the future if steps aren&#8217;t taken to prevent it. In an effort to get out ahead of any future problems, Mazda issued a recall.</li>\n</ul>\n<h3>The Solution</h3>\n<p>Mazda is doing their best to help people who have encountered this problem. In fact, Mazda dealers replace lift gates and their components free of charge. Mazda is planning on sending interim letters to car owners starting on November 1, 2016 and plan on sending secondary letters as parts become available. That&#8217;s the bad news &#8211; parts are currently unavailable. If you have any questions in the meantime, reach out to the Mazda customer service center at&nbsp;1-800-222-5500.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=8539","createdAt":"2016-10-26T01:29:47.000Z","date_gmt":"2016-10-26T15:14:47.000Z","updatedAt":"2020-10-03T02:06:42.000Z","modified_gmt":"2020-10-03T15:51:42.000Z","display_date":"October 26, 2016","sticky":false,"recall":false,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2016,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/10/shutterstock_1157879476-2-768x510.jpg","alt_text":"","cld_public_id":"shutterstock_1157879476-2","category":{"id":18,"name":"Mazda","slug":"mazda-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mazda.png"},"tags":[],"categories":[{"id":18,"name":"Mazda","slug":"mazda-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mazda.png"}]},{"id":8541,"title":"Service Brakes the Reason For Nissan Recalls","link":"https://www.motorsafety.org/service-brakes-reason-nissan-recalls/","status":"publish","slug":"service-brakes-reason-nissan-recalls","excerpt":"<p>Nissan had to recall quite a few vehicles due to a leak in brake fluid. As a result, fires broke out on a circuit board.</p>\n","description":"<p><em>Washington, D.C. &#8211; October&nbsp;25, 2016 &#8211;</em> A brake fluid leak in some Nissan vehicles may cause an electrical short which carries with it the <a href=\"http://www-odi.nhtsa.dot.gov/acms/cs/jaxrs/download/doc/UCM538889/RMISC-16V636-9733.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">risk of a fire</a> breaking out, according to a recall memo from the National Traffic Safety Administration. The Nissan vehicles mentioned in the report included the 2016-2017 Maxima, 2015-2017 Murano and 2015-2016 Murano hybrid. Additionally, the report mentioned that as many as 120,329 vehicles were affected by the issue. Nissan informed dealers on September 2, 2016, and began preparing notifications for the owners to go out via first class mail some time in the following 60 days.<br />\n<span id=\"pk-id\"></span></p>\n<h3>The Defect</h3>\n<p>The vehicles that are at risk for having the defect mentioned in the recall are equipped with actuators that were manufactured outside of specified dimensions. In fact, the wrong die temperatures may have resulted in the formation of seal hardness in the vehicles with Nissan&#8217;s Intelligent Cruise Control. If this occurs, the seal will likely leak brake fluid onto a circuit board. Although an ABS warning lamp, should be triggered in response to the leak, the an electrical short can occur and a fire could break out at that location in your vehicle.</p>\n<h3>Timeline Of Nissan&#8217;s Response</h3>\n<p>Nissan recommended that if the ABS light inside your Nissan vehicle stays illuminated for more than 10 seconds, you should pull over and park your car as soon as you can. Although it took a little time to investigate the issue, Nissan has done a good job of putting together a game plan to handle the recalls. Here are a few distinct actions that Nissan took over the course of first finding out about the problem to the issue of a recall:</p>\n<ul>\n<li>June 7, 2016: Nissan was first notified of an incident involving thermal damage to a 2016 Nissan maxima. There was an inspection of the vehicle scheduled immediately to determine the cause and origin of the problem.</li>\n<li>June 2016: After the inspection, Nissan determined that a fire did occur and likely originated in the area around the ABS actuator. Upon further investigation, it was made clear that the ABS warning lamp was on prior to the issue. Nissan proceeded to notify the ABS actuator unit supplier (ADVICS) and continued the investigation with the supplier.</li>\n<li>June 2016 &#8211; August 2016: In collaboration with ADVICS, Nissan attempted to determine whether or not this is an isolated incident or one that affects a collection of vehicles. Nissan also monitored other incidents that sound similar to this one more closely.</li>\n<li>August 24, 2016: Based on evidence from the investigation, Nissan determined that the defect was real and a risk to driver safety. As such, the company conducted a safety recall campaign to remedy the issue as much as possible.</li>\n</ul>\n<h3>The Solution</h3>\n<p>Every individual who responds to Nissan&#8217;s recall can have their vehicle examined at a dealership. Your Nissan professional should inspect the serial number of your ABS actuator to see if it was manufactured during an affected time. If it was, the dealer will replace your ABS actuator at no cost to you, the owner.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=8541","createdAt":"2016-10-25T04:27:39.000Z","date_gmt":"2016-10-25T18:12:39.000Z","updatedAt":"2020-10-03T02:08:49.000Z","modified_gmt":"2020-10-03T15:53:49.000Z","display_date":"October 25, 2016","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2016,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/10/shutterstock_775522840-1-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_775522840-1","category":{"id":14,"name":"Nissan","slug":"nissan-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/nissan_RM.png"},"tags":[],"categories":[{"id":14,"name":"Nissan","slug":"nissan-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/nissan_RM.png"}]},{"id":8543,"title":"Seat Defect Can Increase Chances Of Injury In Collision","link":"https://www.motorsafety.org/seat-defect-can-increase-chances-injury-collision/","status":"publish","slug":"seat-defect-can-increase-chances-injury-collision","excerpt":"<p>Volkswagen&#8217;s Audi Q7 is undergoing a recall because of the third row seat. Passengers may be unsafe in the event of a collision.</p>\n","description":"<p><em>Auburn Hills, MI &#8211; October 24, 2016 &#8211;</em> A manufacturing error in the third row seat of certain Audi Q7s may result in an <a href=\"http://www-odi.nhtsa.dot.gov/acms/cs/jaxrs/download/doc/UCM538875/RCLRPT-16V641-3614.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">increased chance of injury</a> during a collision, according to a memo from the National Traffic Safety Administration. The vehicles mentioned in the report from the manufacturer, Volkswagen, include Audi Q7 SUVs that were manufactured between August 17, 2015 to July 31, 2016. In the vehicles affected by the defect, the third row of seats is likely to move forward more than it should in the event of a collision.<br />\n<span id=\"pk-id\"></span></p>\n<h3>The Defect</h3>\n<p>The Audi Q7s that are at risk for the defect were manufactured with the wrong dimensions in the transverse pipe used to support the third row of seating. The improper construction of such a piece results in a weaker support system for the third row of seats, and hence, the increased chance of injury for passengers seated there in the event of a crash. The defect in the seating prevents 19,205 vehicles from conforming to Federal Motor Vehicle Safety Standard.</p>\n<h3>Timeline of Volkswagen&#8217;s Response</h3>\n<p>The Q7&nbsp;crossover vehicle from Audi has had problems up to this point already. Before this latest recall, Audi announced the recall of some of their Q7 vehicles due to inadequate exterior lighting. This problem with the seat is another, separate issue with the same model of vehicle which could pose a risk to passenger safety. In May of 2016, periodic quality testing first identified the issue. Immediately, Audi (Volkswagen) immediately launched an investigation to determine if the test failure was a result of a defective part or an incorrect test procedure. On August 25, 2016, the issue was presented at the Product Safety Committee. A decision was reached to conduct a compliance recall right away. Since the quality testing, Volkswagen has adjusted its manufacturing protocol to ensure that every Audi Q7&nbsp;made on or after August 1, 2016, would have third row seating made with the correct dimensions.</p>\n<h3>The Solution</h3>\n<p>Although the issue is present in vehicles already on the roads, Volkswagen announced that the recall for eligible vehicles will begin in October of 2016. Audi customers should expect to receive a letter in the mail stating the problem and how to most conveniently get it solved. That said, Audi should be notifying every individual driving one of the vehicles affected by the defect. To remedy the situation, dealerships should install additional back braces to support passengers in the case of a collision. If you&#8217;re worried that your vehicle may be at risk for the defect, don&#8217;t allow any passengers to sit in your third row of seating until you&#8217;ve taken it into a dealership for inspection. The adjustments to your faulty vehicle will be done free of charge, of course. If you have any more questions about the recall, don&#8217;t hesitate to reach out to your Volkswagen or Audi professional today.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=8543","createdAt":"2016-10-24T02:23:11.000Z","date_gmt":"2016-10-24T16:08:11.000Z","updatedAt":"2020-10-03T02:10:53.000Z","modified_gmt":"2020-10-03T15:55:53.000Z","display_date":"October 24, 2016","sticky":false,"recall":false,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2016,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/10/shutterstock_326386346-3-768x449.jpg","alt_text":"","cld_public_id":"shutterstock_326386346-3","category":{"id":6,"name":"Volkswagen","slug":"volkswagen-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/volkswagen.png"},"tags":[],"categories":[{"id":6,"name":"Volkswagen","slug":"volkswagen-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/volkswagen.png"}]},{"id":8545,"title":"Air Bag Software Issue for GM Vehicles","link":"https://www.motorsafety.org/air-bag-software-issue-gm-vehicles/","status":"publish","slug":"air-bag-software-issue-gm-vehicles","excerpt":"<p>In September, GM had to recall more than 4.3 million vehicles because of an issue with their airbag-software.</p>\n","description":"<p><em>Detroit, MI &#8211; Oct. 21, 2016 &#8211;</em> The software in the air bags of certain General Motors vehicles was the cause for the recall of about <a href=\"http://www.freep.com/story/money/cars/general-motors/2016/09/09/gm-recalls-air-bag/90125616/\" target=\"_blank\" rel=\"noopener noreferrer\">4.3 million vehicles</a> recently, according to the Detroit Free Press. The problem with the software is that, in certain circumstances, the electronic component tasked with deployment of the air bag will go into test-mode. If that was to occur, the result would be that the air bags would not deploy during a collision. For obvious reasons, that could translate to a major problem for the driver and passengers. Additionally, the seat belts may malfunction. So far, the defect has been linked to three injuries and even one death.<br />\n<span id=\"pk-id\"></span></p>\n<h3>The Defect</h3>\n<p>Unlike many other recalls, the defect is a problem with the software as opposed to any hardware components. There is a sensing and diagnostic module that regulates both air bag deployment and seat belt pretensioners. Seat belt pretensioners are the part of your seat belt that is perhaps most responsible for saving lives. When you are in a collision, the sensors will trigger action by a concealed piston. The piston will fire into spool at the center of your seatbelt, which will, in turn, tighten around the wearer of the seat belt. Being pulled tightly against the car seat does a couple of things. For starters, it positions the passenger for the best use of the air bags. Also, it <a href=\"http://auto.howstuffworks.com/car-driving-safety/safety-regulatory-devices/seatbelt-pretensioner.htm\" target=\"_blank\" rel=\"noopener noreferrer\">prevents the passenger from &#8220;submarining,&#8221;</a> according to How Stuff Works. Submarining is the dangerous act of a passenger being pulled violently under the dashboard. The GM vehicles that are recalled include the 2014-2015 Buick LaCrosse, Chevrolet SS and Spark EV; the 2014-2017 Chevrolet Corvette, Trax, Caprice PPV, Silverado 1500, Buick Encore and GMC Sierra 1500; as well as the 2015-2017 Chevrolet Tahoe, Suburban, Silverado HD, GMC Yukon, Yukon XL, Sierra HD, Cadillac Escalade and Escalade ESV.</p>\n<h3>Timeline Of GM&#8217;s Response</h3>\n<p>In May of 2016, a 2014 Chevy Silverado crashed and the air bags inside did not deploy. General Motors reached out to auto parts manufacturing company, Delphi, right away. After months of vigorous testing and simulations, GM decided to recall the vehicles ahead of any more issues in early September. Luckily, the company is confident that the solution is not an overly complicated one.</p>\n<h3><strong>The Solution</strong></h3>\n<p>Owners of vehicles involved in the recall can stop by their local dealership to get the necessary software update, free of charge. General Motors will be contacting owners of affected vehicles to make sure they are informed. In a statement, GM maintained that the cost of this recall would not be a material one. The statement also said that GM would include information in their third-quarter earnings report which is expected to be released sometime around the end of October. That&#8217;s good news for General Motors, because in 2014 it had to pay nearly $2 billion in damages, compensation, fines and settlements for another recall involving the ignition switch.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=8545","createdAt":"2016-10-21T01:38:07.000Z","date_gmt":"2016-10-21T07:23:07.000Z","updatedAt":"2020-10-03T02:12:45.000Z","modified_gmt":"2020-10-03T15:57:45.000Z","display_date":"October 21, 2016","sticky":false,"recall":false,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2016,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/10/shutterstock_1557125204-1-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_1557125204-1","category":{"id":72,"name":"GMC","slug":"gmc-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/gmc_RM.png"},"tags":[],"categories":[{"id":72,"name":"GMC","slug":"gmc-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/gmc_RM.png"}]},{"id":8551,"title":"Timeline Of Takata Recalls","link":"https://www.motorsafety.org/timeline-takata-recalls/","status":"publish","slug":"timeline-takata-recalls","excerpt":"<p>Takata has had a rough couple of years. They still have not fixed the problem with all of the defective air bag inflators.</p>\n","description":"<p><em>Detroit, MI &#8211;&nbsp;Oct.&nbsp;18, 2016 &#8211;</em> BMW announced that the company is recalling an additional <a href=\"http://www.wsj.com/articles/bmw-issues-recall-for-new-takata-air-bag-problem-1475265191\" target=\"_blank\" rel=\"noopener noreferrer\">4,000 vehicles</a>&nbsp;in the U.S. and Canada that have problems with the air bag inflators made by automotive parts manufacturer, Takata, according to the Wall Street Journal. The recall is for 2014-2015 X5s&nbsp;and 2015 X3s and X5s. BMW has not been the only car manufactuer that has had recall issues as a result of the Takata air bag components, however. The Takata&nbsp;air bag recall has been going on for quite some time now. Here is a timeline of events:<br />\n<span id=\"pk-id\"></span></p>\n<h3>May 19, 2015</h3>\n<p>The U.S. Department of Transportation urged parts manufacturer, Takata, to recall BMW, Chrysler, Daimler Trucks, Ford, General Motors, Honda, Mazda, Mitsubishi, Nissan, Subaru and Toyota vehicles that have defects with their frontal driver and side passenger air bag inflators. Up to this point, the defect had been responsible for six deaths. About 34 million vehicles were expected to be affected by the recall.</p>\n<h3>January 22, 2016</h3>\n<p>The National Highway Traffic Safety Administration made a couple of announcements, neither or which were positive. The agency announced that there would be be additional recalls of about 5 million vehicles made by Audi, BMW, Daimler Vans, Ford, Honda, Mazda, Mercedes Benz, Saab and Volkswagen. This came as a result of other, more saddening news of the ninth fatality in the U.S. (10th worldwide) as a result of the failed air bag inflators. The NHTSA said that a 2006 Ford Ranger involved in a crash in South Carolina shed more light on issues with the components of the air bag inflator.</p>\n<h3>February 12, 2016</h3>\n<p>Takata&nbsp;issued another recall of more vehicles, including BMW Daimler Vans, Sprinter Vans (labeled Mercedes-Benz, Dodge and Freightliner), Ford, Honda (and Acura), Mazda, Mercedes-Benz and Volkswagen with defective air bag inflators.</p>\n<h3>March 24, 2016</h3>\n<p>One week ahead of a March 31st deadline, BMW told to the NHTSA&nbsp;it would be unable to meet the deadline to supply sufficient parts to meet the need of fixing faulty inflators. The agency amended the deadline for BMW to have working parts by August 31, 2016, instead.</p>\n<h3>May 4, 2016</h3>\n<p>Nearly a year after the first round of recalls was issued by Takata, the recalls continued to expand to cover more defective air bags in various vehicles. Up to this point, the faulty Takata air bag inflators were responsible for 10 deaths and more than 100 injuries in the U.S. alone. The parts manufacturer had successfully&nbsp;recalled nearly 29 million vehicles. But the expansion called for the recall of an additional 35-40 million potentially affected vehicles.</p>\n<h3>September 24, 2016</h3>\n<p>A driver in Malaysia was killed in a car accident. Though there are still investigations of the Honda underway, professionals heavily suspect that air bags from Takata were the reason for the malfunction during impact. If investigators do prove that the air bags were behind the driver&#8217;s death, it would <a href=\"http://www.thecarconnection.com/news/1106427_takata-in-crisis-another-likely-airbag-death-a-criminal-probe-and-bankruptcy-in-the-works\" target=\"_blank\" rel=\"noopener noreferrer\">mark the 14th death</a> since the issues began more than one year ago, according to the Car Connection. Across the world in the U.S.,&nbsp;Takata began facing more and more legal trouble. The U.S. Department of Justice publicly stated that Takata mishandled the air bag defect.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=8551","createdAt":"2016-10-18T01:26:31.000Z","date_gmt":"2016-10-18T07:11:31.000Z","updatedAt":"2020-10-03T02:17:12.000Z","modified_gmt":"2020-10-03T16:02:12.000Z","display_date":"October 18, 2016","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2016,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/10/shutterstock_260704025-1-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_260704025-1","category":null,"tags":[],"categories":[]},{"id":8431,"title":"Steering Issues On-Target in New Mazda Recalls","link":"https://www.motorsafety.org/steering-issues-target-new-mazda-recalls/","status":"publish","slug":"steering-issues-target-new-mazda-recalls","excerpt":"<p>Road salt exposure could eventually make steering some Nissan vehicles more difficult.</p>\n","description":"<p><em>Washington, D.C. — Oct. 17, 2016 —&nbsp;</em>Ball joints in some Mazda vehicles are possibly vulnerable to a dangerous flaw. The model years in this recall range from 2007 to 2012, per&nbsp;official documents with the National Highway Traffic Safety Administration. In addition, the source said that&nbsp;<a href=\"http://www-odi.nhtsa.dot.gov/acms/cs/jaxrs/download/doc/UCM537169/RCLRPT-16V593-7677.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">190,102 Mazda CX-7 vehicles were potentially affected</a>, with the first related field report of this issue dating to August 2015.<br />\n<span id=\"pk-id\"></span></p>\n<p>The higher-priority vehicles for this recall are reportedly located in states that&nbsp;use lots of road salt for ice. That&#8217;s because driving on salted roads can inadvertently introduce salt&nbsp;water into the ball joints. Over time, this exposure could corrode the joints, eventually separating it from the lower control arm and making it more difficult for the driver to steer properly.</p>\n<p>Target regions include northern states like Indiana, Minnesota and New Hampshire, but also more southern states, such as Kentucky and West Virginia. Dealer notification is scheduled for September 30, with owner notification coming Oct.&nbsp;10. Dealers will replace left and right lower control arms after the recall campaign.</p>\n<p>As of this writing, the manufacturer has noted no injuries connected to this fault, and the report did not state any possible indications that the issue might be present.</p>\n<p>The Mazda recall is just one of the more recent to concern possible road-salt corrosion. Last October, approximately&nbsp;218,019 Nissan Versa vehicles were recalled because of the danger road salt posed to their front coil springs. Automotive News reported that corroded springs could eventually fracture, puncturing vehicle tires in the process.</p>\n<p>The Versa model years subject to this recall ranged from 2007 to 2012. Similar to the Mazda recall, this Nissan action particularly looked at the vehicles in particular states. Vehicles were produced between May 8, 2006 and Nov. 12, 2012.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=8431","createdAt":"2016-10-17T03:24:00.000Z","date_gmt":"2016-10-17T17:09:00.000Z","updatedAt":"2020-10-03T02:19:37.000Z","modified_gmt":"2020-10-03T16:04:37.000Z","display_date":"October 17, 2016","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2016,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/10/shutterstock_1608377680-1-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_1608377680-1","category":{"id":18,"name":"Mazda","slug":"mazda-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mazda.png"},"tags":[],"categories":[{"id":18,"name":"Mazda","slug":"mazda-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mazda.png"}]},{"id":8433,"title":"Windshield Wiper Module Issues Lead to GM Recall","link":"https://www.motorsafety.org/windshield-wiper-module-issues-lead-gm-recall/","status":"publish","slug":"windshield-wiper-module-issues-lead-gm-recall","excerpt":"<p>Several thousand vehicles were part of a GM recall.</p>\n","description":"<p><em>Warren, Mich. — Oct. 14, 2016 —&nbsp;</em>In the latest GM recall news, the manufacturer will address hundreds of thousands of its vehicles with windshield wiper system issues. According to official documents filed with the National Highway Traffic Safety Administration, the recall includes two 2013 vehicle models: the GMC Terrain and the Chevrolet Equinox.<br />\n<span id=\"pk-id\"></span></p>\n<p>Production periods for each of these affected models began on the same date, April 17, 2012. The Terrain production time range ended Aug. 13, 2013, while the Equinox production range ended Aug. 15. of the same year.</p>\n<p>Though the original Part 573 Safety Recall Report <a href=\"http://www-odi.nhtsa.dot.gov/acms/cs/jaxrs/download/doc/UCM538252/RCLRPT-16V582-8652.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">did not list the exact number of vehicles</a>, a later updated version listed the number as 367,808 potentially involved autos. All 100 percent of the recalled population is thought to be affected and have the defect.</p>\n<p>This source said that the ball joints on some wiper modules could wear down and possibly detach from their sockets and separate entirely. Doing so could disable at least one wiper, making it more difficult for drivers to see during inclement weather.</p>\n<p>GM first received report of the possible problems&nbsp;Dec. 15, 2015 through one of its staff members in Canada. The official investigation began Mar. 9, 2016, and the decision to finally conduct the recall came later, in August. The root cause of the ball joint corrosion issues was unidentified as of Aug. 18. The report did list the component supplier, Mitsuba, and noted that it is based in Monroeville, Indiana.</p>\n<p>An Aug. 2 dealer-facing notice said that the remedy is still forthcoming and will appear in a later bulletin. However, the source did state that an update to the Global Warranty Management system&#8217;s&nbsp;Investigate Vehicle History would help dealers prepare by identifying the affected vehicles.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=8433","createdAt":"2016-10-14T04:36:07.000Z","date_gmt":"2016-10-14T10:21:07.000Z","updatedAt":"2020-10-05T06:51:35.000Z","modified_gmt":"2020-10-05T20:36:35.000Z","display_date":"October 14, 2016","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2016,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/10/shutterstock_101343637-768x510.jpg","alt_text":"","cld_public_id":"shutterstock_101343637","category":{"id":72,"name":"GMC","slug":"gmc-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/gmc_RM.png"},"tags":[],"categories":[{"id":72,"name":"GMC","slug":"gmc-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/gmc_RM.png"}]},{"id":8427,"title":"NHTSA Investigation into Tesla Accident Ongoing","link":"https://www.motorsafety.org/nhtsa-investigation-tesla-accident-ongoing/","status":"publish","slug":"nhtsa-investigation-tesla-accident-ongoing","excerpt":"<p>A Tesla autopilot failure has prompted investigations from the NHTSA.</p>\n","description":"<p><em>Washington, D.C. — Oct. 12, 2016 —&nbsp;</em>The National Highway Traffic Safety Administration is investigating a crash centering around the Tesla Model S and its autopilot feature. Business Insider recently included updates on the effort.<br />\n<span id=\"pk-id\"></span></p>\n<p>The accident took place May 7, and involved 40-year old Tesla driver Joshua Brown, who reportedly collided with a nearby fence when a trailer truck passed in front of him. The autopilot reportedly failed to recognize the oncoming trailer and therefore didn&#8217;t press on the brakes. The incident has not prompted a recall as of yet, but an investigation could theoretically lead to further action.</p>\n<p>However, a June blog post from Tesla that appeared in the source stated that the NHTSA&#8217;s looking into this issue is &#8220;simply a preliminary evaluation to determine whether the system worked according to expectations.&#8221; The blog also explained that autopilot can only be used with acknowledgement from the user, and is initially not activated in vehicles.</p>\n<p>Aside from this, the Tesla Model S has also appeared in recall news due to seat belt problems. A November 2015&nbsp;recall saw a specific range of vehicles included because seat belts were not connected to the outboard lap pretensioner correctly. The recall included&nbsp;58,773 vehicles that were potentially subject to the condition.</p>\n<p>The fix for this problem required possible reassembly if the front belts in the vehicle aren&#8217;t connected. Affected models included Model S units with model years from between 2012 and 2015, with production rates ranging from May 31, 2012, to Nov. 12, 2015. An improperly bolted seat belt anchor could leave passengers insufficiently restrained during an accident, the Part 573 Safety Recall Report said.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=8427","createdAt":"2016-10-12T03:12:24.000Z","date_gmt":"2016-10-12T16:57:24.000Z","updatedAt":"2020-10-29T00:28:36.000Z","modified_gmt":"2020-10-29T14:13:36.000Z","display_date":"October 12, 2016","sticky":false,"recall":false,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2016,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/10/White-Tesla-car-Model-S-768x512.jpg","alt_text":"","cld_public_id":"White-Tesla-car-Model-S","category":null,"tags":[],"categories":[]},{"id":8351,"title":"Two Ford Recalls Address Fuel Pump Issues","link":"https://www.motorsafety.org/two-ford-recalls-address-fuel-pump-issues/","status":"publish","slug":"two-ford-recalls-address-fuel-pump-issues","excerpt":"<p>Two Ford recalls have addressed separate fuel-pump-related issues.</p>\n","description":"<p><em>Dearborn, Mich. — Oct. 05, 2016 —&nbsp;</em>A pair of Ford recalls will address a wide range of vehicles produced for recent model years. In a single press release, the manufacturer announced the different actions, which include police vehicles as well as other models. Two of these were safety recalls centered around problems with fuel pumps.<br />\n<span id=\"pk-id\"></span></p>\n<p>The first of these involved control modules that could unexpectedly stall engines. Of the two recalls, this <a href=\"https://media.ford.com/content/fordmedia/fna/us/en/news/2016/08/24/ford-issues-two-safety-recalls-and-one-safety-compliance-recall-.html\" target=\"_blank\" rel=\"noopener noreferrer\">impacted the largest amount of models</a>, affecting the Ford Flex, Taurus and Police Interceptor units, as well as Lincoln MKS and MKT vehicles, for a total population of 88,151 autos. Model years for all of these units in the first recall ranged from 2013 to 2015.</p>\n<p>The other recall concerned 2,472 2015 and 2016 Ford Transit vehicles. While engines in these units could also potentially stall, the release said the cause was different: In this case, the problem came from malfunctioning fuel injection pumps.</p>\n<p>Neither of these recalls have been connected to any accident reports, as far as Ford is aware. In each case, dealers will inspect and replace compromised parts.</p>\n<p>Ford conducted another recall for 2015 Ford Transit models earlier this year. According to documents filed by&nbsp;the National Highway Traffic Safety Administration, these vans could potentially contain deteriorating lift platforms, making it difficult to bring wheelchairs into the vans. The Part 573 Safety Recall Report said that the platform pivot plates in these vehicles would have visible cracking.</p>\n<p>Although this last recall involved Ford vehicles, it came from the Massachusetts-based manufacturer New England Wheels. At the time of release, May 17, the report said that it could not list specific remedy details, with component supplier Ricon&nbsp;explaining the process in an April 29 notice&nbsp;instead.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=8351","createdAt":"2016-10-05T02:14:30.000Z","date_gmt":"2016-10-05T15:59:30.000Z","updatedAt":"2020-10-03T02:33:32.000Z","modified_gmt":"2020-10-03T16:18:32.000Z","display_date":"October 05, 2016","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2016,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/10/shutterstock_347502515-1-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_347502515-1","category":{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"},"tags":[],"categories":[{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"}]},{"id":8347,"title":"Acceleration Problems Affect Some Mitsubishi Vehicles in Recall","link":"https://www.motorsafety.org/acceleration-problems-affect-mitsubishi-vehicles-recall/","status":"publish","slug":"acceleration-problems-affect-mitsubishi-vehicles-recall","excerpt":"<p>Mitsubishi has recalled several vehicles under a single action.</p>\n","description":"<p><em>Cypress, Calif. — Oct. 04, 2016 —&nbsp;</em>One of the latest Mitsubishi recalls involves concerns over possible problems that might appear during acceleration. Earlier this year, between January and February, the manufacturer reportedly received&nbsp;claims of stopping vehicles, according to documents from the National Highway Traffic Safety Administration.<br />\n<span id=\"pk-id\"></span></p>\n<p>The Part 573 Safety Recall Report <a href=\"http://www-odi.nhtsa.dot.gov/acms/cs/jaxrs/download/doc/UCM535168/RCLRPT-16V563-5583.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">includes&nbsp;82,436 potentially affected vehicles</a>, including the&nbsp;2015 Mitsubishi Outlander Sport and 2016 Outlander Sport, Outlander and Lancer models. The combined production dates range from Jun. 25, 2014 to Jul. 8, 2016.</p>\n<p>In these autos, the Constant Velocity Transmission system could lead to a hesitant acceleration. As the source described, this is due to a temporary loss of signal in the range switch and could require dealers to reprogram the CVT-ECU to disregard the signal loss.</p>\n<p>To address the problem, the manufacturer addressed range switches in the affected models on different dates in 2016: the Outlander and Lancer vehicles on Feb.&nbsp;22 and the the Outlander Sport on April 6. A new spring will reportedly keep the range switch from losing signal momentarily.</p>\n<p>The manufacturer notice for dealers said that the engine in affected vehicles will reduce engine torque when the range switch loses its signal. Dealers were cautioned to ensure that vehicles aren&#8217;t delivered without being repaired first. They were also advised to use a backup battery during the reprogramming procedure to keep a steady power supply&nbsp;at all times.</p>\n<p>Although all of the vehicles were included in a single report, an&nbsp;Advance Technical Information Notice stated that two different campaign numbers are involved. The 2015 Outlander Sport is part of campaign C1606Z, while the 2016 vehicles are included under&nbsp;C1607Z.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=8347","createdAt":"2016-10-04T01:11:13.000Z","date_gmt":"2016-10-04T14:56:13.000Z","updatedAt":"2020-10-03T02:35:58.000Z","modified_gmt":"2020-10-03T16:20:58.000Z","display_date":"October 04, 2016","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2016,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/10/shutterstock_244538788-1-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_244538788-1","category":{"id":30,"name":"Mitsubishi","slug":"mitsubishi-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mitsubishi.png"},"tags":[],"categories":[{"id":30,"name":"Mitsubishi","slug":"mitsubishi-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mitsubishi.png"}]}]