[{"id":8326,"title":"Honda Recalls 2016 Vehicles for Tail Light Issues","link":"https://www.motorsafety.org/honda-recalls-2016-vehicles-tail-light-issues/","status":"publish","slug":"honda-recalls-2016-vehicles-tail-light-issues","excerpt":"<p>LED problems could require replacements for both taillights in some Honda vehicles.</p>\n","description":"<p>Torrance, Calif. — Sept. 30, 2016 — Some Honda vehicles could fail to comply with Federal Motor Vehicle Safety Standards guideline 108&nbsp;&#8211; &#8220;Lamps, Reflective Devices, and Assoc. Equipment.&#8221;&nbsp;The original acknowledgement, dated for Aug.&nbsp;10, stated that some 2016 Honda Civic vehicles may potentially come with faulty lights.<br />\n<span id=\"pk-id\"></span></p>\n<p>The manufacturer reported the issue Jul. 8, and it&nbsp;<a href=\"http://www-odi.nhtsa.dot.gov/acms/cs/jaxrs/download/doc/UCM537255/RCLRPT-16V526-5764.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">could affect 11,846 2-door vehicles</a>. In these autos, the source said, circuit board damage could affect the lights and make vehicles harder to see. All of the included vehicles were produced between Feb. 23 and May 20.</p>\n<p>According to the Part 573 Safety Recall Report, the first vehicles with these issues were discovered May 24 as part of a vehicle quality check. The discovery led to the June 30 decision to conduct a recall, after circuit boards were possibly damaged in transit.</p>\n<p>No specific signs for determining if the problem was present were listed. The remedy requires dealers to inspect Honda tail light assemblies. The report also said that there were no injuries related to this defect as of June 23.</p>\n<p>The affected component comes from supplier Automotive Lighting LLC, based in Auburn Hills, Mich. Owner notification was scheduled Aug. 8, almost a full month after dealer notification on July 9. The report said that owners would be notified by mail if they were subject to this recall.</p>\n<p>An instruction document from the manufacturer goes into greater detail about the procedures needed to repair the vehicles. Both the right and left taillight assemblies may be necessary for the remedy, depending on the specific case. The procedure will have dealers remove the trunk rear side trim panels to install either one or both taillights.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=8326","createdAt":"2016-09-30T03:03:17.000Z","date_gmt":"2016-09-30T16:48:17.000Z","updatedAt":"2020-10-03T02:38:09.000Z","modified_gmt":"2020-10-03T16:23:09.000Z","display_date":"September 30, 2016","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2016,"month":9,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/09/shutterstock_651579124-2-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_651579124-2","category":{"id":4,"name":"Honda","slug":"honda-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/honda_ms.png"},"tags":[],"categories":[{"id":4,"name":"Honda","slug":"honda-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/honda_ms.png"}]},{"id":8248,"title":"New Suspension-Related Recall is Third for Several Toyota Vehicles","link":"https://www.motorsafety.org/new-suspension-related-recall-third-several-toyota-vehicles/","status":"publish","slug":"new-suspension-related-recall-third-several-toyota-vehicles","excerpt":"<p>Toyota&#8217;s new recall is actually a response to two previous ones.</p>\n","description":"<p><em>Jacksonville, Fla. — September 28, 2016 —&nbsp;</em>The Los Angeles Times recently wrote about a recall that affects thousands of Toyota RAV4 SUVs and&nbsp;Lexus HS250 hybrid sedans. According to the source, the issue affects vehicles of these&nbsp;two makes <a href=\"http://www.latimes.com/business/la-fi-toyota-recall-20160812-snap-story.html\" target=\"_blank\" rel=\"noopener noreferrer\">from the model years 2006 to 2011.</a><br />\n<span id=\"pk-id\"></span></p>\n<p>Rusty suspension arms in these automobiles&nbsp;could eventually detach from affected vehicles and leave occupants in danger. Before this most recent action, the same vehicles had been reportedly recalled twice for loose suspension issues. The source said dealers will address the problem by replacing the defective&nbsp;suspension-arm assemblies.</p>\n<p>Other Toyota recalls have affected the 2011 RAV4 as well. A June recall included RAV4 units with model years ranging between 2006 and 2011 for a seat-heater electrical wiring problem. According to the source, compressing seat cushions in these vehicles could damage the wiring and increase the risk of fire.</p>\n<p>This action included 13 other Toyota vehicles and the total affected model years included vehicles dating&nbsp;as far back as 1987 and as recent as 2012. The component manufacturer involved in the case,&nbsp;Marketing World Wide, Inc, is no longer in business, according to the National Highway Traffic Safety Administration&#8217;s Safety Recall Report.</p>\n<p>The remedy for this wiring problem involved using a &#8220;copper strand heating element&#8221; to disconnect the heaters. The original owner notification date was planned for the 15-day period between July 14 and 29.</p>\n<p>As of this writing, the NHTSA recall database only lists the current suspension recall for the&nbsp;Lexus HS250 hybrid, although it originally dates it back to 2012. Updated instructions show that only a certified Chassis Expert, Master&nbsp;and Master Diagnostic Technicians can perform the necessary repairs.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=8248","createdAt":"2016-09-28T01:28:37.000Z","date_gmt":"2016-09-28T15:13:37.000Z","updatedAt":"2020-10-03T02:41:20.000Z","modified_gmt":"2020-10-03T16:26:20.000Z","display_date":"September 28, 2016","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2016,"month":9,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/09/shutterstock_610599458-1-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_610599458-1","category":{"id":17,"name":"Toyota","slug":"toyota-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/toyota_ms.png"},"tags":[],"categories":[{"id":17,"name":"Toyota","slug":"toyota-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/toyota_ms.png"}]},{"id":8244,"title":"GM Recalls Buick Verano Vehicles for Fuel Line Problems","link":"https://www.motorsafety.org/gm-recalls-buick-verano-vehicles-fuel-line-problems/","status":"publish","slug":"gm-recalls-buick-verano-vehicles-fuel-line-problems","excerpt":"<p>Nearly 200 vehicles were part of a recent GM recall due to fuel line concerns.</p>\n","description":"<p><em>Warren, Mich. — September 27, 2016 —&nbsp;</em>In recent GM recall news, some 2016 Buick Verano autos may be subject to a fire hazard due to fuel line defects. The Part 573 Safety Recall Report from the National Highway Traffic Safety Administration website stated that affected autos <a href=\"http://www-odi.nhtsa.dot.gov/acms/cs/jaxrs/download/doc/UCM537244/RCLRPT-16V595-6273.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">have a 2.0 liter turbocharged engine</a> and were manufactured between Feb. 16 and May 12, 2016.<br />\n<span id=\"pk-id\"></span></p>\n<p>This source said that fuel lines in these Buicks could fail if they make contact with heated sections of the engine. This could lead to a fire if the lines in question are worn away enough, causing fuel to leak out. A total of 189 vehicles are potentially involved in this action, and all 100 percent of them are estimated to have the defect.</p>\n<p>The first engine fire associated with this problem occurred June 20 in the car of a GM employee, according to the Report. As of Aug. 10, this was the only fire caused by this defect that had been seen in the field.</p>\n<p>Dealer Notification was planned for Aug. 10, and the remedy requires the dealer to replace the fuel line assembly entirely. Since the defect comes from&nbsp;improperly&nbsp;assembled fuel lines, the new replacement assemblies will have the proper engine compartment routing. GM found out that the vehicle issue stemmed from &#8220;poor operator training&#8221; on July 18.</p>\n<p>A recall bulletin from the manufacturer listed all of the parts needed to complete the recall&#8217;s system replacement. This list includes eight parts total, such as a fuel-feed pipe and charge air cooler inlet air tube adapter seal for each vehicle.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=8244","createdAt":"2016-09-27T02:23:55.000Z","date_gmt":"2016-09-27T15:08:55.000Z","updatedAt":"2020-10-03T02:42:57.000Z","modified_gmt":"2020-10-03T16:27:57.000Z","display_date":"September 27, 2016","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2016,"month":9,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/09/shutterstock_1351452701-1-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_1351452701-1","category":{"id":37,"name":"GM","slug":"gm-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/gm.png"},"tags":[],"categories":[{"id":37,"name":"GM","slug":"gm-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/gm.png"}]},{"id":8246,"title":"Kia Recalls Sorrento Vehicles after Improper Welding Found","link":"https://www.motorsafety.org/kia-recalls-sorrento-vehicles-improper-welding-found/","status":"publish","slug":"kia-recalls-sorrento-vehicles-improper-welding-found","excerpt":"<p>Some 2016 Kia Sorrento vehicles could have dangerous welds.</p>\n","description":"<p><em>Irvine, Calif. — September 26, 2016 —&nbsp;</em>A bad weld in some 2016 Kia Sorrento vehicles could leave occupants at risk of crashing. &nbsp;Just 1 percent of the total recalled population is estimated to have this defect, according to the Part 573 Safety Recall Report filed with the National Highway Traffic Safety Administration.<br />\n<span id=\"pk-id\"></span></p>\n<p>That report also stated that <a href=\"http://www-odi.nhtsa.dot.gov/acms/cs/jaxrs/download/doc/UCM529878/RCLRPT-16V480-3192.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">7,901 of these vehicles could potentially see a weld break</a>&nbsp;and impact both vehicle performance and safety. The source traced the problem back to supplier&nbsp;Hwashin America Corporation,&nbsp;which&nbsp;oversaw the improper&nbsp;welding process that left an assist arm bracket disconnected from the vehicle&#8217;s rear crossmember. Owners may be able to tell that their vehicle has this problem if they hear &#8220;a popping or clunking noise&#8221; from the breaking tack welds.</p>\n<p>To prevent this problem from happening in the future, the supplier reportedly used an air pressure valve and limit sensor to correct the welding process. The vehicles addressed in this recall make up two distinct ranges of production years: one between May 29 and Nov. 16, 2015, and the other spanning Jan. 14 and Feb. 11, 2016. Dealers can replace the crossmember&nbsp;assembly as needed, the report added.</p>\n<p>A July 21 safety bulletin from the manufacturer urged owners to locate their nearest Kia dealer and have a professional inspect the assembly. The bulletin said that the inspection alone (without the replacement) would require approximately one hour to complete.</p>\n<p>Owners who have already paid to treat this issue could potentially be eligible for reimbursement under Kia&#8217;s General Reimbursement Plan, the statement added. The original report listed the dealer notification date as July 15 and the owner notification date as July 21.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=8246","createdAt":"2016-09-26T03:19:26.000Z","date_gmt":"2016-09-26T17:04:26.000Z","updatedAt":"2020-10-03T03:55:11.000Z","modified_gmt":"2020-10-03T17:40:11.000Z","display_date":"September 26, 2016","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2016,"month":9,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/09/shutterstock_1012368922-2-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_1012368922-2","category":{"id":32,"name":"Kia","slug":"kia-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/kia_RM.png"},"tags":[],"categories":[{"id":32,"name":"Kia","slug":"kia-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/kia_RM.png"}]},{"id":8239,"title":"After Fuel Concerns, Mitsubishi Recalls Outlander Sport Vehicles","link":"https://www.motorsafety.org/fuel-concerns-mitsubishi-recalls-outlander-sport-vehicles/","status":"publish","slug":"fuel-concerns-mitsubishi-recalls-outlander-sport-vehicles","excerpt":"<p>A transmission problem in some Mitsubishi vehicles could cause sudden failures and a fire hazard.</p>\n","description":"<p><em>Cypress, Calif. — September 23, 2016 —&nbsp;</em>Some improperly placed transmission hose clamps have launched a Mitsubishi recall. The manufacturer&#8217;s new action addresses a possible fire hazard, though there have been no confirmed reports of such as of this writing, according to Autoblog.<br />\n<span id=\"pk-id\"></span></p>\n<p>The recall includes exactly&nbsp;45,731 potentially affected vehicles, as documents from the National Highway Traffic Safety Administration report. All of the concerned units are 2015 Outlander Sports produced between June 24, 2014 and Nov. 25, 2015. The&nbsp;continuously variable transmission fluid hoses in these vehicles may reportedly feature clamps that aren&#8217;t securely attached.</p>\n<p>This, in turn, could allow the hose to detach and leak transmission fluid, potentially hurting the transmission as well as causing a fire hazard. The report said that each of these vehicles contains 10 susceptible hose clamps. Drivers can look for a warning light on the dashboard as a possible sign of this defect, along with possible shaking.</p>\n<p>Because the problem centers around the included clamps, no outside component manufacturer was associated with this issue. According to the Part 573 Safety Recall report, dealers <a href=\"http://www-odi.nhtsa.dot.gov/acms/cs/jaxrs/download/doc/UCM534190/RCLRPT-16V548-9399.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">can look at each of the ten clamps</a> and release them if necessary.</p>\n<p>The manufacturer decided to conduct this recall on July 14, 2016. The first warranty claim related to this issue dates back to Dec. 16, 2015, when an Outlander Sport suddenly came to a stop after a transmission hose disconnected. Other claims came in March, May and June 2016: Of these, the vehicle with the highest mileage was identified March&nbsp;3 and had accumulated 18,446 miles.</p>\n<p>No recall notification schedule was listed for owners or dealers in the 573 report, though the did say it would update these later.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=8239","createdAt":"2016-09-23T01:14:12.000Z","date_gmt":"2016-09-23T14:59:12.000Z","updatedAt":"2020-10-03T03:57:39.000Z","modified_gmt":"2020-10-03T17:42:39.000Z","display_date":"September 23, 2016","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2016,"month":9,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/09/shutterstock_482290240-1-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_482290240-1","category":{"id":30,"name":"Mitsubishi","slug":"mitsubishi-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mitsubishi.png"},"tags":[],"categories":[{"id":30,"name":"Mitsubishi","slug":"mitsubishi-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mitsubishi.png"}]},{"id":8120,"title":"Door Latch Problems Reason for New Ford Recalls","link":"https://www.motorsafety.org/door-latch-problems-reason-new-ford-recalls/","status":"publish","slug":"door-latch-problems-reason-new-ford-recalls","excerpt":"<p>Several Ford brands have possible latching issues.</p>\n","description":"<p><em>Dearborn, Mich. — September 19, 2016 —&nbsp;</em>According to The Associated Press, new Ford recalls target&nbsp;several different vehicle&nbsp;brands <a href=\"http://www.nytimes.com/aponline/2016/08/04/business/ap-us-ford-recall.html?_r=1\" target=\"_blank\" rel=\"noopener noreferrer\">due to&nbsp;an issue with door latches</a>. The source said that some of its autos have door-latch problems&nbsp;that could open unexpectedly, especially in hotter climates.<br />\n<span id=\"pk-id\"></span></p>\n<p>The AP also said that the recall takes place in 16 states as well as Mexico. The target states will take the priority during the recall, with dealers replacing all of the latches in vehicles in these areas, while other states will simply see dealers replace latches as needed. Affected model years range from 2012 to 2016, and vehicle types include C-Max and Focus cars as well as various&nbsp;vans and SUVs.</p>\n<p>Altogether, the recall reportedly concerns around 830,000 vehicles across all countries. Some of the vehicles involved in this action have been subject to other Ford recalls in recent years, such as the 2015 C-MAX and Ford Focus.</p>\n<p>Both of these were part of a 2015 recall concerning&nbsp;Federal Motor Vehicle Safety Standard Number 114. This standard targets &#8220;Theft Protection and Rollaway Prevention.&#8221;&nbsp;In this case, vehicle owners were warned that the engine could run even if the ignition was stopped. This would have left the&nbsp;374,781 potentially affected units&nbsp;at greater risk of a crash.</p>\n<p>The 2013 C-MAX was part of an even earlier effort in 2014 meant to draw attention to Restraint Control Modules that could short-circuit, setting off the air bag warning lamp. The C-MAX autos included in this recall were produced between Jan. 9, 2012 and Nov. 21, 2013. Multiple systems were thought to be hurt by this defect.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=8120","createdAt":"2016-09-19T03:39:27.000Z","date_gmt":"2016-09-19T17:24:27.000Z","updatedAt":"2020-10-03T04:03:49.000Z","modified_gmt":"2020-10-03T17:48:49.000Z","display_date":"September 19, 2016","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2016,"month":9,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/09/shutterstock_1301360803-2-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_1301360803-2","category":{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"},"tags":[],"categories":[{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"}]},{"id":8114,"title":"Nissan Recalls Hybrid Vehicles for Powertrain Module Problems","link":"https://www.motorsafety.org/nissan-recalls-hybrid-vehicles-powertrain-module-problems/","status":"publish","slug":"nissan-recalls-hybrid-vehicles-powertrain-module-problems","excerpt":"<p>A new Hybrid vehicle issue requires attention from Nissan dealers.</p>\n","description":"<p><em>Franklin, Tenn. — September 16, 2016 —&nbsp;</em>A group of 1,140 Nissan vehicles may experience engine shutdown in some circumstances. According to the Part 573 Safety Recall Support, submitted July&nbsp;8, the recall affects both 2012 and 2013 Infiniti M35 Hybrid models. The ones concerned were <a href=\"http://www-odi.nhtsa.dot.gov/acms/cs/jaxrs/download/doc/UCM533346/RCLRPT-16V527-4481.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">specifically produced between March 23, 2010 and September 9, 2013.</a><br />\n<span id=\"pk-id\"></span></p>\n<p>As the report described, the cooling systems in these vehicles could malfunction, leading them to possibly overheat. While this would set off the warning lamp, the source said that occupants could ignore this sign, putting themselves in potential danger. This would not affect the brakes, but it would possibly stop the engine, leaving passengers and drivers at risk of an accident.</p>\n<p>Nissan has investigated the issue since April and is having dealers reprogram software in affected vehicles free of charge for owners. The campaign&#8217;s&nbsp;Aftersales Retailer Support document went into further detail about this action, describing exactly how the vehicles in question are distributed: The majority (1,130 units) are in the U.S., with 94 in Canada, six in Puerto Rico and four in Guam.</p>\n<p>This notice also said that the affected vehicles were manufactured in Tochigi, Japan. No parts are apparently&nbsp;necessary for the repair other than the software, already available through ASIST. Though the advisory said that dealer repair times could vary, it also estimated that the repair process would take &#8220;approximately 1 hour.&#8221;</p>\n<p>All authorized Infiniti dealers are supposedly able to conduct this service, but they are cautioned to update their software and turn off external devices before preparing to fix the issue.</p>\n<p>Earlier this year, other Infiniti vehicles, including different years of the&nbsp;QX60 and Q50 models, were part of a different recall for possible Occupant Classification System issues. All together,&nbsp;3,177,645 were potentially affected.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=8114","createdAt":"2016-09-16T04:33:14.000Z","date_gmt":"2016-09-16T18:18:14.000Z","updatedAt":"2020-10-03T04:05:59.000Z","modified_gmt":"2020-10-03T17:50:59.000Z","display_date":"September 16, 2016","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2016,"month":9,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/09/shutterstock_62849281-2-768x476.jpg","alt_text":"","cld_public_id":"shutterstock_62849281-2","category":{"id":14,"name":"Nissan","slug":"nissan-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/nissan_RM.png"},"tags":[],"categories":[{"id":14,"name":"Nissan","slug":"nissan-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/nissan_RM.png"}]},{"id":8110,"title":"Chance of Fire Prompts General Motors Recalls","link":"https://www.motorsafety.org/chance-fire-prompts-general-motors-recalls/","status":"publish","slug":"chance-fire-prompts-general-motors-recalls","excerpt":"<p>One model of 2011 Buick is the subject of a fire risk-related recall.</p>\n","description":"<p><em>Warren, Mich. — September 13, 2016 —&nbsp;</em>Wiring issues may make a fire more likely to break out in one Buick model. Although there is no remedy scheduled as of this writing, one of the more recent General Motors recalls addresses this problem. The component manufacturer in this recall is&nbsp;Lear Corporation, based in Germany.<br />\n<span id=\"pk-id\"></span></p>\n<p>The official Part 573 Safety Recall Report on the National Highway Traffic Safety Administration website said that the recall potentially involves 42,984 2011 Buick Regals. A full 100 percent of these are thought to have a wiring harness problem&nbsp;that&nbsp;<a href=\"http://www-odi.nhtsa.dot.gov/acms/cs/jaxrs/download/doc/UCM531884/RCLRPT-16V517-1917.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">could wear down the wires themselves.</a></p>\n<p>This chafing could potentially lead to a short circuit, which in turn could start a fire within the vehicle. In addition, the report cited other possible side effects, such as smoke, sparks and flickering instrument-panel lights. Despite this, it did not list any signs to be taken as &#8220;identification&#8221; of the defect.</p>\n<p>The fix requires dealers to repair faulty wiring, if needed, after inspecting and securing the harness. There is also no apparent danger of wire chafing in similar vehicles manufactured after 2011 in Russelheim.</p>\n<p>Though the decision to conduct the recall only came June 29, it dates back to Dec. 21, 2015. On that date, the source said, customer reports of fire led to a a Speak Up for Safety report.</p>\n<p>A July 7 notice for dealers said that the parts necessary to conduct this recall fix were not currently available: dealers can only proceed once they are. This statement also announced that the Global Warranty Management system would update to reflect the new recall, as a way for dealers to prepare to address owner concerns.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=8110","createdAt":"2016-09-13T04:18:35.000Z","date_gmt":"2016-09-13T17:03:35.000Z","updatedAt":"2020-10-03T04:09:55.000Z","modified_gmt":"2020-10-03T17:54:55.000Z","display_date":"September 13, 2016","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2016,"month":9,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/09/shutterstock_72015151-1-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_72015151-1","category":{"id":37,"name":"GM","slug":"gm-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/gm.png"},"tags":[],"categories":[{"id":37,"name":"GM","slug":"gm-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/gm.png"}]},{"id":8107,"title":"Takata Air Bag Recall Expands to Include More Jaguar Vehicles","link":"https://www.motorsafety.org/takata-air-bag-recall-expands-include-jaguar-vehicles/","status":"publish","slug":"takata-air-bag-recall-expands-include-jaguar-vehicles","excerpt":"<p>Jaguar Land Rover added new vehicles to the Takata air bag recalls.</p>\n","description":"<p><em>Mahwah, NJ — September 12, 2016 — </em>Jaguar Land Rover, owned by Tata Motors (NYSE:TTM) is expanding two recalls. A Jaguar recall will now cover 20,107 XF&#8217;s, and a Land Rover recall will now cover a total of 34,738 Range Rovers. The recalls include the following models:</p>\n<ul>\n<li><strong>2009-2011 Jaguar XF</strong></li>\n<li><strong>2007-2011 Land Rover Range Rover</strong></li>\n</ul>\n<h2><strong>Recall summary</strong></h2>\n<p>The vehicles in question are equipped with potentially dangerous Takata airbags. In both cases, the problem comes from the degraded air bag inflators, which could trigger a dangerous rupture and combustion. The risk is higher in hot climates, which is why these areas are the priority for the recall.</p>\n<p>A June 1 <a href=\"https://static.nhtsa.gov/odi/rcl/2016/RCAK-16V374-6666.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">acknowledgment document</a> said that 20,016 Jaguar XF vehicles were affected, while the corresponding Land Rover document cited 34,334 units. The XF vehicles in this recall were manufactured between 2007 and 2011, while the Land Rover manufacture years fell from 2006 to 2011.</p>\n<p>The Part 573 Safety Recall Reports for each of these Jaguar recalls include comments from Takata on the exact way this problem could affect drivers.</p>\n<blockquote>\n<p>&#8220;The propellant wafers in some of the subject inflators may degrade over time, which could lead to over-aggressive combustion in the event the air bag is activated. Overly aggressive combustion creates excessive internal pressure when the inflator is activated, which may cause the inflator body to rupture.&#8221;</p>\n</blockquote>\n<p>NHTSA also keeps a running list of recall progress by make. As of July 15, a total 9,348,948 air bag inflators have been repaired across all models. Jaguar and Land Rover were not mentioned on the completion page, and each was noted as having only a single range of vehicles involved by this time frame.</p>\n<h2><strong>The repair</strong></h2>\n\n\n<p>Jaguar and Land Rover dealers will replace the passenger front airbag, free of charge. Both recalls began in March 2017.</p>\n\n\n\n<h2><strong>Is your vehicle part of the recall?</strong></h2>\n\n\n\n<p>Over 54,000 vehicles were originally part of this recall. As of April 9, 2021 – the last date information was available – 37,592 airbags had been replaced. To see if your car still needs to be repaired, use MotorSafety’s<a href=\"https://www.motorsafety.org/\"> free lookup tool</a>.</p>\n","source":"https://recallmasters.com/?p=8107","createdAt":"2016-09-12T01:14:43.000Z","date_gmt":"2016-09-12T14:59:43.000Z","updatedAt":"2021-06-24T08:13:52.000Z","modified_gmt":"2021-06-24T21:58:52.000Z","display_date":"September 12, 2016","sticky":false,"recall":true,"authors":[{"id":6,"name":"MotorSafety.org","slug":"motorsafety"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"16V374000","recall_date":"May 27, 2016","meta_title":"","meta_description":"","meta_keywords":"","custom_schema":""},"year":2016,"month":9,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/09/shutterstock_1071461693-2-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_1071461693-2","category":{"id":103,"name":"Land Rover","slug":"land-rover-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/landrover_RM.png"},"tags":[{"id":1757,"name":"2007-2011 Land Rover Range Rover recall","slug":"2007-2011-land-rover-range-rover-recall"},{"id":1758,"name":"Land Rover airbag recall","slug":"land-rover-airbag-recall"},{"id":635,"name":"Takata air bags","slug":"takata-air-bags"}],"categories":[{"id":103,"name":"Land Rover","slug":"land-rover-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/landrover_RM.png"}]},{"id":8058,"title":"Multiple Vehicles Part of Volkswagen Recalls","link":"https://www.motorsafety.org/multiple-vehicles-part-volkswagen-recalls/","status":"publish","slug":"multiple-vehicles-part-volkswagen-recalls","excerpt":"<p>Four different brands were affected by recent Volkswagen recalls.</p>\n","description":"<p><em>Auburn Hills, Mich. — September 9, 2016 —&nbsp;</em>A new Volkswagen recall will address problems with child locks in four different brands of&nbsp;vehicles released in 2016. Official information filed with the National Highway Traffic Safety Administration said that just 1&nbsp;percent&nbsp;of the 5,658 potentially involved vehicles was estimated to have the defect. The Part 573 Safety Recall Report was submitted on June 22.<br />\n<span id=\"pk-id\"></span></p>\n<p>This document further described the four models subject to recall: <a href=\"http://www-odi.nhtsa.dot.gov/acms/cs/jaxrs/download/doc/UCM528575/RCLRPT-16V464-1797.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">the CC, e-Golf, Golf R and&nbsp;Tiguan</a>. Although they all have the same model year, the collective production rates range from November 25, 2015 to February 3, 2016.</p>\n<p>The rear-door child safety locks in these autos could disengage due to certain outside vibrations. Since the locks are supposed to prevent children from opening rear car doors, disabling them could inadvertently give children the chance to exit the vehicle.</p>\n<p>Though the defect was officially determined June 15, the research goes back as far as January 25. Lock functionality was tested in a full production check after the issue was first discovered that same month. To fix the issue, the report said dealers will replace the locks. The production was reportedly remedied &#8220;by 100 percent inspection&#8221; by January 25, with certain molding cavities now prohibited.</p>\n<p>Aston Martin also recently recalled several vehicles for door-lock issues. Last month, CNET&nbsp;reported on the&nbsp;6,076 vehicles that did not comply with&nbsp;Federal Motor Vehicle Safety Standard #206. Model years ranged from 2010 to 2016, and encompassed a group of eight different models.</p>\n<p>Although doors in these cars could potentially lock from the outside, trapping occupants, the problem was described as not a defect so much as an unexpected side effect of a double-sided safety system. The fix involved upgrading car software.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=8058","createdAt":"2016-09-09T02:09:21.000Z","date_gmt":"2016-09-09T15:54:21.000Z","updatedAt":"2020-10-03T04:14:40.000Z","modified_gmt":"2020-10-03T17:59:40.000Z","display_date":"September 09, 2016","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2016,"month":9,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/09/shutterstock_788667736-1-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_788667736-1","category":{"id":6,"name":"Volkswagen","slug":"volkswagen-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/volkswagen.png"},"tags":[],"categories":[{"id":6,"name":"Volkswagen","slug":"volkswagen-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/volkswagen.png"}]},{"id":8036,"title":"Porsche Recalls Spyder Vehicles","link":"https://www.motorsafety.org/porsche-recalls-spyder-vehicles/","status":"publish","slug":"porsche-recalls-spyder-vehicles","excerpt":"<p>A new Porsche recall concerns improper screws that could put drivers at risk.</p>\n","description":"<p><em>Atlanta, Georg. — September 07, 2016 —&nbsp;</em>A new recall concerns 306 2015 Porsche 918 Spyder vehicles. The official Part 573 Safety Recall Report on this issue said that the seat belt mount and reels in these vehicles may have been <a href=\"http://www-odi.nhtsa.dot.gov/acms/cs/jaxrs/download/doc/UCM532109/RCLRPT-16V520-3496.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">secured with the wrong screws</a>. As such, occupants could be at a higher risk of crash than usual.<br />\n<span id=\"pk-id\"></span></p>\n<p>If the seat belts in these Porsches are removed, the report said, new screws are needed to put them back into place. Owners, drivers and passengers might notice &#8220;clicking noises,&#8221; the source said, as well as new stiffness with the seat belt, which won&#8217;t be able to swiftly move around as would&nbsp;normally be&nbsp;seen.</p>\n<p>The report also said that the issue with the screws was first noticed May 30, 2016, though the recall itself wasn&#8217;t put into action until July 4. Though this document didn&#8217;t list the official recall schedule, it did state that the remedy would involve inspecting the screws and competing repairs depending on the situation.</p>\n<p>Other Porsche recalls include a June action involving vehicles of the same make and model year, one which left vehicles at possible risk of fire. These were manufactured between February 25, 2014 and April 29, 2015, potentially affecting as many as 223 vehicles.</p>\n<p>The danger came from the included wiring harnesses, which could possibly spark a fire if they make contact with the engine heat insulation plate. These harnesses, which connected the left radiator fans in targeted vehicles, were accessed through the vehicles&#8217; engine compartments. The wire chafing issue was attributed to two 2015 field incidents, one in April and the other in May.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=8036","createdAt":"2016-09-07T02:24:42.000Z","date_gmt":"2016-09-07T16:09:42.000Z","updatedAt":"2020-10-03T04:16:42.000Z","modified_gmt":"2020-10-03T18:01:42.000Z","display_date":"September 07, 2016","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2016,"month":9,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/09/shutterstock_1768986239-1-768x576.jpg","alt_text":"","cld_public_id":"shutterstock_1768986239-1","category":{"id":25,"name":"Porsche","slug":"porsche-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/porsche.jpg"},"tags":[],"categories":[{"id":25,"name":"Porsche","slug":"porsche-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/porsche.jpg"}]},{"id":8034,"title":"What the Chevrolet Cruze Recalls Mean","link":"https://www.motorsafety.org/chevrolet-cruze-recalls-mean/","status":"publish","slug":"chevrolet-cruze-recalls-mean","excerpt":"<p>Several 2016 Chevrolet Cruze vehicles are part of a recall stemming from safety code concerns.</p>\n","description":"<p><em>Warren, Mich. — September 6, 2016 —&nbsp;</em>A Part 573 Safety Recall report&nbsp;submitted June 29 concerned <a href=\"http://www-odi.nhtsa.dot.gov/acms/cs/jaxrs/download/doc/UCM530802/RCLRPT-16V498-3931.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">approximately&nbsp;32,913 Chevrolet Cruze vehicles</a>. In these autos, the source said, headlamp lenses do not come bearing the proper aiming identifier code. The report said that this represents noncompliance with Federal Motor Vehicle Safety Standard No. 108, which could apply even though the units were properly aligned during production.<br />\n<span id=\"pk-id\"></span></p>\n<p>The larger cause of the issue was described as a headlamp supplier etching equipment programming error. Because of this issue, the lenses did not contain the right codes, potentially making it hard for services to adjust the headlamps properly.</p>\n<p>This report came just over a month after the first notice of the issue, on May 25. General Motors&#8217; official investigation opened June 2, with the voluntary recall action launching June 22. To address the problem, the manufacturer said it would mail both owners and dealers the necessary labels.</p>\n<p>These labels contain four categories of information about the recalled component: the necessary name, description, part number and country of origin. The codes should appear on the headlamps&nbsp;in vehicles made after May 26, 2016.</p>\n<p>Other Chevrolet recalls have included the Cruze model. A more recent one concerned a different FMVSS, number 114. This action included not just 2016 Cruzes but also&nbsp;other Chevrolet models, such as the&nbsp;Malibu and Equinox.</p>\n<p>All of these cars could have a defect making it possible to roll away if the ignition key is removed while the transmission is in park. The component supplier involved in this case is Alps Electronics, another outfit based out of Warren, Michigan. New housings were used to remedy the problem. This safety recall officially began after June 23, 2016, on the decision of the Safety Field Action Decision Authority.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=8034","createdAt":"2016-09-06T04:20:53.000Z","date_gmt":"2016-09-06T18:05:53.000Z","updatedAt":"2020-10-03T04:18:46.000Z","modified_gmt":"2020-10-03T18:03:46.000Z","display_date":"September 06, 2016","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2016,"month":9,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/09/shutterstock_625027316-1-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_625027316-1","category":{"id":12,"name":"Chevrolet","slug":"chevrolet-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/chevy_ms.png"},"tags":[],"categories":[{"id":12,"name":"Chevrolet","slug":"chevrolet-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/chevy_ms.png"}]}]