[{"id":12361,"title":"Ford recalls trucks with defective shift linkage components","link":"https://www.motorsafety.org/ford-recalls-trucks-defective-shift-linkage-components/","status":"publish","slug":"ford-recalls-trucks-defective-shift-linkage-components","excerpt":"<p>Ford Motor Company has recalled more than 11,700 vehicles potentially equipped with defective shift linkage components.</p>\n","description":"<p>Dearborn, Mich. &#8211; Nov. 30, 2017 &#8211; Ford Motor Company has recalled more than 11,700 vehicles potentially equipped with <a href=\"https://static.nhtsa.gov/odi/rcl/2017/RCLRPT-17V671-6993.pdf\">defective shift linkage components</a>, according to documentation submitted to the National Highway Transportation Safety Administration. The campaign affects 2017 Ford F-150 pickup trucks produced between between Aug. 23, 2016 and Aug. 9, 2017. The car manufacturer suspects just 7 percent of the models referenced in the action contain the defective features.</p>\n<h3>The Defect</h3>\n<p>The affected vehicles contain transmission shift linkages with pins that are prone to slipping out due to the presence of non-uniform gaps between the inner and outer coils. Engineers at Ford believe the pins may also feature undersized diameters, further increasing the likelihood of pin slippage. Should this occur, gear changes initiated by drivers will not register. Owners who have experienced this have reported viewing inaccurate information on the shift indicator. The condition may result in unintended vehicle movement, which poses a serious threat to owners. However, Ford has yet to receive reports connecting the defective pins to any accidents or injuries.</p>\n<h3>Timeline of Events</h3>\n<p>In June 2017, <span title=\"This is meant to be deleted.\">the </span>Ford<span title=\"This is a suggestion for revision.\">&#8216;s</span>&nbsp;Critical Concern Review Group received a report detailing an instance in which the 10-speed transmission in one vehicle failed to function properly. Engineers reviewed parts from the vehicle and found evidence that the transmission shift linkage pin could come out with ease. The CCRG&nbsp;launched an investigation and directed production personnel to alter assembly line processes to ensure that pin diameters were correct.</p>\n<p>Over the course of July and August, Ford reviewed numerous reports wherein customers attested to experiencing &#8220;looseness&#8221; when attempting to operate the shift lever, which failed to move <span title=\"This is a suggestion for revision.\">the&nbsp;</span>gears. Quality assurance personnel tested the problematic shift assemblies mentioned in the reports and compared them to functioning alternatives. There was an immense difference in usability, indicating that there was a significant problem.</p>\n<p>In September, the automaker continued to review incoming field reports related to the defect while <span title=\"This is repetitive, please revise it.\">also </span>checking production records to ascertain the extent of the issue. Meanwhile, engineering personnel conducted further tests and discovered a connection between assembly line pin insertion force and pin dislodgment susceptibility. These technical experts <span title=\"This is repetitive, please revise it.\">also </span>found that the the problematic transmission shift linkage pins had irregular coil spacing.</p>\n<p>On Oct. 16, the Ford&nbsp;Field Review Committee evaluated all of the available evidence related to the potentially defective features and decided to launch a voluntary safety recall. Ford notified dealers of the action Oct. 24.</p>\n<h3>The Solution</h3>\n<p>Ford has directed dealers to <a href=\"https://static.nhtsa.gov/odi/rcl/2017/RCAK-17V671-4303.pdf\">replace the defective transmission linkage pins</a> with new parts free of charge, according to an NHTSA recall acknowledgement document. The automaker intends to contact owners Dec.11 via first-class mail. Those in need of more immediate assistance can connect with Ford customer service at (866) 436-7332. Callers should use the internal recall identification code 17S36. Owners can also contact the NHTSA directly using its Vehicle Safety Hotline at (888) 327-4236.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.recallmasters.com/?p=12361","createdAt":"2017-11-30T04:18:38.000Z","date_gmt":"2017-11-30T18:03:38.000Z","updatedAt":"2020-10-04T00:04:56.000Z","modified_gmt":"2020-10-04T13:49:56.000Z","display_date":"November 30, 2017","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2017,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2017/11/2011-Ford-F-150-768x512.jpg","alt_text":"","cld_public_id":"2011-Ford-F-150","category":{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"},"tags":[],"categories":[{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"}]},{"id":12363,"title":"Chrysler recalls vehicles with defective oil pump housings","link":"https://www.motorsafety.org/chrysler-recalls-vehicles-defective-oil-pump-housings/","status":"publish","slug":"chrysler-recalls-vehicles-defective-oil-pump-housings","excerpt":"<p>Chrysler Fiat Automobiles has recalled more than 350 vehicles potentially equipped with defective oil pump housings.</p>\n","description":"<p>&nbsp;</p>\n<p>Auburn Hills, Mich. &#8211; Nov. 30, 2017 &#8211; Fiat Chrysler Automobiles has recalled more than 350 vehicles potentially equipped with <a href=\"https://static.nhtsa.gov/odi/rcl/2017/RCLRPT-17V670-5962.PDF\">defective oil pump housings</a>, according to documentation submitted to the National Highway Transportation Safety Administration. The campaign affects 2018 Jeep Compass sport utility vehicles produced on Sept. 11, 2017 and Jeep Cherokee sport utility vehicles produced between Sept. 9, 2017 and Sept. 28, 2017. FCA estimates that just 1 percent of the vehicles referenced in the action possess the defective features.</p>\n<h3>The Defect</h3>\n<p>The affected models include 2.4 liter engines that were constructed using cracked oil pump housings that are prone to failure. Should failure occur, the vehicle engine will stall without warning. This poses a serious safety threat to owners as an unexpected stall could result in a collision. That said, FCA has not received any reports connecting&nbsp;the defective feature to accidents or injuries.</p>\n<h3>Timeline of Events</h3>\n<p>On Sept. 13, 2017, an oil pump supplier collaborating with FCA notified that company that cracks had been discovered in the housing for multiple oil pumps. Two days later, the FCA&nbsp;Vehicle Safety and Regulatory Compliance committee launched an investigation into the matter, which engineers at assembly plants in Toluca, Mexico and&nbsp;Belvedere, Illinois had independently confirmed via separate&nbsp;Product Related Issue reports.</p>\n<p>Throughout September and October, FCA confirmed the existence of the defective components in finished vehicles through production inspections and parts data. On Oct. 5, the automaker finished gathering data and submitted the evidence to the&nbsp;Vehicle Regulations Committee, which decided to conduct a voluntary safety recall Oct. 17. FCA notified dealers Oct. 24.</p>\n<h3>The Solution</h3>\n<p>The car manufacturer has directed dealers to inspect and <a href=\"https://static.nhtsa.gov/odi/rcl/2017/RCAK-17V670-1312.pdf\">replace the oil pump housing assemblies</a> in affected vehicles free of charge, according to an NHTSA recall acknowledgement document. FCA plans to notify owners on or around Dec. 13. Those in need of more immediate assistance can contact FCA customer service at (800) 853-1403. Callers should use the internal recall identification code T65. Owners can also reach out to the NHTSA directly using its Vehicle Safety Hotline at (888) 327-4236.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.recallmasters.com/?p=12363","createdAt":"2017-11-30T04:17:44.000Z","date_gmt":"2017-11-30T18:02:44.000Z","updatedAt":"2020-10-04T00:06:23.000Z","modified_gmt":"2020-10-04T13:51:23.000Z","display_date":"November 30, 2017","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2017,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2017/11/Dark-blue-Jeep-Compass-768x514.jpg","alt_text":"","cld_public_id":"Dark-blue-Jeep-Compass","category":{"id":20,"name":"Chrysler","slug":"chrysler-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/chrysler_RM.png"},"tags":[],"categories":[{"id":20,"name":"Chrysler","slug":"chrysler-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/chrysler_RM.png"},{"id":33,"name":"Jeep","slug":"jeep-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/jeep_ms.png"}]},{"id":12365,"title":"Subaru recalls vehicles with defective floor mat brackets","link":"https://www.motorsafety.org/subaru-recalls-vehicles-defective-floor-mat-brackets/","status":"publish","slug":"subaru-recalls-vehicles-defective-floor-mat-brackets","excerpt":"<p>Subaru of America has recalled more than 2,300 vehicles potentially equipped with defective floor mat brackets.</p>\n","description":"<p>&nbsp;</p>\n<p>Cherry Hill, N.J. &#8211; Nov. 30, 2017 &#8211; Subaru of America has recalled more than 2,300 vehicles potentially equipped with <a href=\"https://static.nhtsa.gov/odi/rcl/2017/RCLRPT-17V701-8928.PDF\">defective floor mat brackets</a>, according to documentation submitted to the National Highway Transportation Safety Administration. The campaign affects 2018 Subaru Crosstrek sport utility vehicles produced between May 16, 2017 and Sept. 7, 2017. The automaker estimates that all of the models referenced in the recall contain the defective parts.</p>\n<h3>The Defect</h3>\n<p>The affected models feature defective driver-side floor mat retention brackets that do not sufficiently secure floor mats. As a result, these fixtures can move out of position during vehicle operation and interfere with pedal usage, posing a serious threat to drivers. However, Subaru has yet to receive any reports linking the defective components to any accidents or injuries.</p>\n<h3>Timeline of Events</h3>\n<p>On Oct. 17, 2017, the automaker received a field report detailing an instance in which the driver-side floor mat in a 2018 Crosstrek slipped out of position. Over the next 12 days, Subaru engineers conducted an internal investigation, eventually determining that the floor mat retention brackets installed in the vehicle were defective. On Oct. 31, quality assurance and safety officials for the company decided that the features posed a serious hazard to owner and chose to launch a voluntary safety recall.</p>\n<p>Subaru notified dealers of the impending recall&nbsp;Nov. 1.</p>\n<h3>The Solution</h3>\n<p>The car manufacturer has directed dealers to <a href=\"https://static.nhtsa.gov/odi/rcl/2017/RCAK-17V701-4942.pdf\">inspect the floor mat retention brackets</a> in affected and replace them, free of charge, if necessary, according to an NHTSA recall acknowledgement document. Subaru began contacting owners Nov. 14. Those who need additional assistance can contact Subaru customer service at (800) 782-2783. Callers should use the internal recall reference code WTR-77. Owners can also connect with the NHTSA directly using its Vehicle Safety Hotline at (888) 327-4236.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.recallmasters.com/?p=12365","createdAt":"2017-11-30T04:16:57.000Z","date_gmt":"2017-11-30T18:01:57.000Z","updatedAt":"2020-10-04T00:07:06.000Z","modified_gmt":"2020-10-04T13:52:06.000Z","display_date":"November 30, 2017","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2017,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2017/11/Subaru-Crosstrek-768x512.jpg","alt_text":"","cld_public_id":"Subaru-Crosstrek","category":{"id":24,"name":"Subaru","slug":"subaru-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/subaru_ms.png"},"tags":[],"categories":[{"id":24,"name":"Subaru","slug":"subaru-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/subaru_ms.png"}]},{"id":12367,"title":"Honda recalls vehicles with defective driveshafts","link":"https://www.motorsafety.org/honda-recalls-vehicles-defective-driveshafts/","status":"publish","slug":"honda-recalls-vehicles-defective-driveshafts","excerpt":"<p>American Honda Motor Company has recalled more than 5,400 believed to contain defective right halfshafts.</p>\n","description":"<p>&nbsp;</p>\n<p>Torrance, Calif. &#8211; Nov. 30, 2017 &#8211; American Honda Motor Company has recalled more than 5,400 believed to contain <a href=\"https://static.nhtsa.gov/odi/rcl/2017/RMISC-17V706-1657.pdf\">defective right halfshafts</a>, according to an internal defect information report submitted to the National Highway Transportation Safety Administration. The campaign affects 2017 Honda Civic sedans produced between Aug. 30, 2017 and Sept. 30, 2017, as well as Honda Civic coupes that rolled off the assembly line between Aug. 10, 2017 and Oct. 3, 2017. The automaker is unsure how many of the vehicles referenced in the action are equipped with the defective parts.</p>\n<h3>The Defect</h3>\n<p>Affected models could be equipped with right halfshafts that did not receive proper heat treatment during production and are therefore not structurally sound. As a result, vehicle load and operational stress may fracture these components, leading to the immediate loss of motive power. Should this breakage occur while the vehicle is parked without the emergency brake engaged, it could roll away.</p>\n<p>The defective halfshafts pose a serious hazard to owners. However, Honda has not received reports connecting the defect to any accidents or injuries as yet.</p>\n<h3>Timeline of Events</h3>\n<p>On Sept. 30, 2017, engineers at a Honda production facility conducted a post-assembly road test during which a new vehicle lost motive power due to the sudden fracture of the right halfshaft. The automaker immediately instituted a yard hold and launched an internal investigation into issue. Quality assurance personnel reviewed existing production processes and found that a parts supplier had used defective equipment to cool halfshafts following heat treatment. This oversight inhibited the&nbsp;parts&#8217;&nbsp;structural integrity.</p>\n<p>On Nov. 2, Honda decided to conduct a voluntary safety recall to address the issue. The vehicle manufacturer notified dealers Nov. 3.</p>\n<h3>The Solution</h3>\n<p>Honda has directed dealers to <a href=\"https://static.nhtsa.gov/odi/rcl/2017/RCAK-17V706-9844.pdf\">replace the halfshafts</a> in affected models free of charge, according to an NHTSA recall acknowledgement document. The company intends to notify owners via first-class mail Dec. 15. Those in need of more immediate assistance can contact Honda customer service at (888) 234-2138. Callers should use the internal recall reference code K0E. Owners can also contact the NHTSA directly using its Vehicle Safety Hotline at (888) 327-4236.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.recallmasters.com/?p=12367","createdAt":"2017-11-30T04:15:53.000Z","date_gmt":"2017-11-30T18:00:53.000Z","updatedAt":"2020-10-04T00:07:54.000Z","modified_gmt":"2020-10-04T13:52:54.000Z","display_date":"November 30, 2017","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2017,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2017/11/red-Honda-Civic-RS-768x512.jpg","alt_text":"","cld_public_id":"red-Honda-Civic-RS","category":{"id":4,"name":"Honda","slug":"honda-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/honda_ms.png"},"tags":[],"categories":[{"id":4,"name":"Honda","slug":"honda-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/honda_ms.png"}]},{"id":12340,"title":"Toyota recalls hybrids with defective fuses","link":"https://www.motorsafety.org/toyota-recalls-hybrids-defective-fuses/","status":"publish","slug":"toyota-recalls-hybrids-defective-fuses","excerpt":"<p>Toyota Motor Engineering and Manufacturing has recalled more than 39,000 vehicles potentially equipped with defective fuses.</p>\n","description":"<p>&nbsp;</p>\n<p>Plano, TX &#8211; Nov. 30, 2017 &#8211; Toyota Motor Engineering and Manufacturing has recalled more than 39,000 vehicles potentially equipped with <a href=\"https://static.nhtsa.gov/odi/rcl/2017/RCLRPT-17V718-8033.PDF\">defective fuses</a>, according to documentation submitted to the National Highway Transportation Safety Administration. The campaign affects 2012-2015 Toyota Prius PHV plug-in hybrid sedans manufactured between July 20, 2011 and Jan. 8, 2015. Toyota is unsure what percentage of the vehicles referenced in the recall actually contain the defective components.</p>\n<h3>The Defect</h3>\n<p>The affected sedans may contain electric vehicle fuses prone to fracture following excessive thermal stress. Normally, this condition develops during high-load driving maneuvers such as prolonged ascents. In instances in which the fuse fractures and subsequently opens while in operation, the vehicle may lose power or continue to function but with reduced capacity. This defect poses a serious risk to owners, as the sudden loss of motive power could increase the likelihood of an accident. However, Toyota has yet to receive reports linking the damage-prone fuse to any accidents or injuries.</p>\n<h3>Timeline of Events</h3>\n<p>Toyota received a field report from the European market in August 2014 detailing an instance in which a Prius PHV sedan <a href=\"https://static.nhtsa.gov/odi/rcl/2017/RMISC-17V718-0390.pdf\">lost motive power</a>, triggering interior warning lights, according to a chronology document submitted to the NHTSA. A dealer determined that the hybrid battery was the root cause of the event and installed a replacement, eventually sending the damaged original to the Toyota home office for further evaluation. Here, engineers found that the EV fuse was fractured and ultimately attributed the problem to an installation error. Toyota reviewed its production processes and eventually determined the fuse was bent during manufacturing, inhibiting its durability. The automaker updated its processes to prevent similar problems in February 2015.</p>\n<p>In March 2015, Toyota received additional reports from the U.S. market. Engineers for the company inspected fuses from six vehicles, four of which showed signs of fracturing. Toyota began to consider that these defective parts were not the result of flawed manufacturing workflows, but the product of deeper mechanical issues, specifically excessive current generated during high-load driving. However, the car company could not replicate the issue in-house and put a hold on ongoing investigations related to the defective fuses in June 2017.</p>\n<p>Then, one month later, another report came in outlining a situation in which an owner in Japan lost motive power in the middle of an intersection. The EV fuse installed in the vehicle was fractured. The driver told Toyota officials that he frequently drove up inclines under electric power only. Engineers attempted to replicate the problem by driving the exact same route the owner had driven but were once again unable to do so. However, they did record data that indicated prolonged large current flow. This information led them to perform additional tests during which vehicles were subjected to multiple slow-speed ascents. During these trials, the engineers were able to replicate the fuse fracture.</p>\n<p>On Nov. 9, 2017, Toyota launched a voluntary safety recall to address the issue. The automaker notified dealers Nov. 14.</p>\n<h3>The Solution</h3>\n<p>Toyota has directed dealers to <a href=\"https://static.nhtsa.gov/odi/rcl/2017/RCAK-17V718-6278.pdf\">replace the EV fuses</a> in affected vehicles free of charge, according to an NHTSA recall acknowledgement document. The car manufacturing company intends to notify owners via first-class mail Jan. 8, 2018. Those in need of more immediate assistance can contact Toyota customer service personnel at (800) 331-4331. Callers should use the internal recall identification code H0R. Owners can also contact the NHTSA directly using the toll-free Vehicle Safety Hotline at (888) 327-4236.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.recallmasters.com/?p=12340","createdAt":"2017-11-30T04:14:49.000Z","date_gmt":"2017-11-30T17:59:49.000Z","updatedAt":"2020-10-04T00:08:42.000Z","modified_gmt":"2020-10-04T13:53:42.000Z","display_date":"November 30, 2017","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2017,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2017/11/2019-Toyota-Prius-Prime-768x512.jpg","alt_text":"","cld_public_id":"2019-Toyota-Prius-Prime","category":{"id":17,"name":"Toyota","slug":"toyota-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/toyota_ms.png"},"tags":[],"categories":[{"id":17,"name":"Toyota","slug":"toyota-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/toyota_ms.png"}]},{"id":12443,"title":"Mercedes recalls thousands of vehicles with defective sunroofs","link":"https://www.motorsafety.org/mercedes-recalls-thousands-vehicles-defective-sunroofs/","status":"publish","slug":"mercedes-recalls-thousands-vehicles-defective-sunroofs","excerpt":"<p>Mercedes-Benz USA recently issued a recall for nearly 9,400 vehicles nationwide.</p>\n","description":"<p>&nbsp;</p>\n<p>Jacksonville, Florida &#8211; Nov. 29, 2017 &#8211; The luxury auto maker Mercedes-Benz USA recently issued a recall for nearly 9,400 vehicles nationwide that may have been <a href=\"https://www.nhtsa.gov/recalls?nhtsaId=17V715\" target=\"_blank\" rel=\"noopener noreferrer\">equipped with defective sunroof panels</a>, according to a letter filed with the National Highway Transportation Safety Administration. The recall effort affects the three different types of Mercedes-Benz&#8217;s popular GLC 300 &#8211; the standard version, the GLC 300&nbsp;4MATIC and the GLC 300&nbsp;AMG &#8211; produced between March 7 and Aug. 4, 2017.</p>\n<p>Mercedes-Benz projects that this represents about 1 percent&nbsp;of the vehicles&nbsp;manufactured as&nbsp;those models.</p>\n<h3>The Defect</h3>\n<p>Specifically, the vehicles being recalled have panoramic sunroof paneling &#8211; on both the front and side panels &#8211; that does not meet bonding requirements, and could therefore detach from the vehicle while driving. That, in turn, is expected to increase the risk of crash or injury for vehicles behind the affected&nbsp;GLC 300s.</p>\n<p>This issue arose&nbsp;because of a &#8220;supplier production deviation,&#8221; Mercedes-Benz noted.</p>\n<h3>Timeline of Events</h3>\n<p>In June, Daimler Auto Group started to investigate the issue, based upon two separate incidents in which drivers saw the paneling around their sunroofs detach. And while no damages or injuries to third parties were reported, the company determined that additional analysis of the situation was required. The following month, DAG&nbsp;began testing the parts with the help of a supplier, and found that the adhesive used to bond the panels to the vehicles were outside of specifications.</p>\n<p>In August, more investigations found that only certain&nbsp;panoramic sunroofs were affected by the adhesive deviation, which led to a review of documents to determine which sunroofs &#8211; and subsequently, the associated vehicle models &#8211; were affected. Then in October, DAG did further analysis to identify how many affected vehicles were in the field. Finally, the company found that it could not rule out the safety risk that led to the recall in November.</p>\n<h3>The Solution</h3>\n<p>As of the start of December, local authorized Mercedes-Benz dealers are now directed to inspect the bonding on panoramic sunroof paneling on suspected affected vehicles, and rework it as needed to ensure the panel bonding is within specification once again. All those costs will be covered under new vehicle warranties. Owners will be notified starting Dec. 8.</p>\n<p>At that point, owners will be able to call either Mercedes-Benz USA&#8217;s customer service line at&nbsp;1-800-367-6372, or the&nbsp;National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236. They can also visit www.safercar.gov for more information.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.recallmasters.com/?p=12443","createdAt":"2017-11-29T04:08:36.000Z","date_gmt":"2017-11-29T17:53:36.000Z","updatedAt":"2020-10-04T05:37:27.000Z","modified_gmt":"2020-10-04T19:22:27.000Z","display_date":"November 29, 2017","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2017,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2017/11/Mercedes-benz-ML-2015-768x421.jpg","alt_text":"","cld_public_id":"Mercedes-benz-ML-2015","category":{"id":5,"name":"Mercedes-Benz","slug":"mercedes-benz-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mercedes_RM.png"},"tags":[],"categories":[{"id":5,"name":"Mercedes-Benz","slug":"mercedes-benz-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mercedes_RM.png"}]},{"id":12216,"title":"Honda recalls minivans with defective seats","link":"https://www.motorsafety.org/honda-recalls-minivans-defective-seats/","status":"publish","slug":"honda-recalls-minivans-defective-seats","excerpt":"<p>American Honda Motor Company has recalled approximately 800,000 vehicles potentially equipped with defective seats.</p>\n","description":"<p>&nbsp;</p>\n<p>Torrance, Calif. &#8211; Nov. 22, 2017 &#8211; American Honda Motor Company has recalled approximately 800,000 vehicles that could potentially be equipped with <a href=\"http://hondanews.com/releases/statement-by-american-honda-regarding-second-row-outboard-seat-recall-2011-2017-honda-odyssey\">defective seats</a>, according to a company press release. The safety campaign affects 2011-2017 Honda Odyssey minivans. The automaker has not announced what percentage of the models referenced in the action actually contain the defective parts.</p>\n<h3>The Defect</h3>\n<p>Affected vehicles are believed to&nbsp;contain second-row outboard seats that do not properly latch after adjustment or removal. This poses a serious risk to occupants, as the seats may lurch forward suddenly when drivers apply the brakes, thus increasing the likelihood of injury. As of now,&nbsp;Honda has received 46 reports referencing injuries connected to the defective seating.</p>\n<h3>Timeline of Events</h3>\n<p>The automaker has not yet released details into the investigation that led to the recall.</p>\n<h3>The Solution</h3>\n<p>Honda engineers are in the process of developing a sustainable solution to the problem. In the meantime, the car company has <a href=\"http://staging.owners.honda.com/service-maintenance/static/pdfs/6SH%20Second%20Row%20Seat%20Instructions%20Final.pdf\">published reference materials</a> that show owners how to properly lock the back seats in place and mitigate the risks associated with the defect. A video displaying the same procedures will follow soon. Honda intends to notify vehicle&nbsp;owners via first-class mail in late December. Individuals in possession of the recalled vehicles who require more immediate help can call customer service personnel at (888) 234-2138. Owners can also contact the National Highway Transportation Safety Administration directly using the organizations&#8217; toll-free Vehicle Safety Hotline at (888) 327-4236.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.recallmasters.com/?p=12216","createdAt":"2017-11-22T06:29:37.000Z","date_gmt":"2017-11-22T20:14:37.000Z","updatedAt":"2020-10-04T00:10:23.000Z","modified_gmt":"2020-10-04T13:55:23.000Z","display_date":"November 22, 2017","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2017,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2017/11/Honda-Odyssey-2018-768x512.jpg","alt_text":"","cld_public_id":"Honda-Odyssey-2018","category":{"id":4,"name":"Honda","slug":"honda-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/honda_ms.png"},"tags":[],"categories":[{"id":4,"name":"Honda","slug":"honda-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/honda_ms.png"}]},{"id":12213,"title":"GM recalls vehicles with defective fuel sensors","link":"https://www.motorsafety.org/gm-recalls-vehicles-defective-fuel-sensors/","status":"publish","slug":"gm-recalls-vehicles-defective-fuel-sensors","excerpt":"<p>General Motors has recalled more than 35,000 GMC and Chevrolet pickup trucks with potentially equipped with defective fuel tank sensors.</p>\n","description":"<p>Warren, Mich. &#8211; Nov. 21, 2017 &#8211; General Motors has recalled more than 35,000 vehicles potentially equipped with <a href=\"https://static.nhtsa.gov/odi/rcl/2017/RCLRPT-17V664-3511.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">defective fuel tank sensors</a>, according to documentation submitted to the National Highway Transportation Safety Administration. The campaign affects 2011-2015 Chevrolet Silverado 3500 and GMC Sierra 3500 pickup trucks produced between May 24, 2010 and Sept. 30, 2015. GM believes all of the vehicles named in the recall contain the defective parts.</p>\n<h2>The Defect</h2>\n<p>Affected models include dual fuel tank assemblies. The first of these tanks includes a defective fuel-level sensor that sometimes stalls in the lowest position, offering an inaccurate reading and increasing the likelihood of overfilling and tank expansion. This, in turn, could then allow the tank to come into contact with the moving driveshaft, creating a hole and causing fuel leakage. As a result, the defect poses a serious threat to occupants. However, GM has received no reports linking the defective component to any accidents or injuries thus far.</p>\n<h2>Timeline of Events</h2>\n<p>In April 2017, the NHTSA notified GM about a vehicle owner questionnaire it had received that detailed an instance of fuel leakage in a 2015 GMC Silverado 3500 pickup. One month later, the GM engineers familiar with the VOQ submitted a report via the company&#8217;s Speak Up For Safety program. The automaker launched an internal investigation in response to the submission on May 16.</p>\n<p>Over the course of May, June and July, engineers evaluated field data to pinpoint the root cause of the leakage, which apparently initiated in the front fuel tank. On July 27, GM met with the NHTSA to review the results of the three-month inquiry. The two parties came to the conclusion that the fuel leaks were not developing in vehicles manufactured after 2015. In August, GM completed a design failure mode and affect analysis, and determined that the problem was confined to Chevrolet Silverado 3500 and GMC Sierra 3500 trucks equipped with dual fuel tanks. These vehicles were manufactured without beds and other conventional pickup features, as they were intended for commercial use or modification.</p>\n<p>GM personnel reviewed the matter in two separate sessions on Aug. 28 and Sept. 25. The NHTSA revaluated the defect on Oct. 2 as well. The GM Safety and Field Action Decision Authority looked over the issue Oct. 12 and decided to conduct a voluntary safety recall. GM notified dealers Oct. 19.</p>\n<h2>The Solution</h2>\n<p>GM has directed dealers to inspect the front fuel tanks in the affected models and either replace the rear tank fuel pumps or <a href=\"https://static.nhtsa.gov/odi/rcl/2017/RCAK-17V664-1627.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">updated the fuel sensor software</a>, according to an NHTSA recall acknowledgement document. These fixes, which will be ready for implementation in early 2018, are to be executed free of charge. The automaker plans send an initial notification to owners via first-class mail Dec. 18 and follow-up document in February 2018, when the remedy is ready for implementation. Owners in need of more immediate assistance can contact Chevrolet customer service at (800) 222-1020 or GMC customer service at (800) 462-8782. Callers should use the GM recall identification number 17399.</p>\n<p>Owners can also contact the NHTSA directly using the toll-free Vehicle Safety Hotline at (888) 3274236.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.recallmasters.com/?p=12213","createdAt":"2017-11-21T06:28:34.000Z","date_gmt":"2017-11-21T20:13:34.000Z","updatedAt":"2020-10-27T01:25:40.000Z","modified_gmt":"2020-10-27T15:10:40.000Z","display_date":"November 21, 2017","sticky":false,"recall":true,"authors":[{"id":6,"name":"MotorSafety.org","slug":"motorsafety"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"17V664000","recall_date":"October 9, 2017"},"year":2017,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2017/11/GMC-truck-768x512.jpg","alt_text":"","cld_public_id":"GMC-truck","category":{"id":12,"name":"Chevrolet","slug":"chevrolet-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/chevy_ms.png"},"tags":[{"id":1724,"name":"2011-2015 Chevrolet Silverado recall","slug":"2011-2015-chevrolet-silverado-recall"},{"id":1723,"name":"2011-2015 GMC Sierra 3500 recall","slug":"2011-2015-gmc-sierra-3500-recall"},{"id":1725,"name":"Chevrolet fuel tank sensor","slug":"chevrolet-fuel-tank-sensor"},{"id":1726,"name":"GMC fuel tank sensor","slug":"gmc-fuel-tank-sensor"}],"categories":[{"id":12,"name":"Chevrolet","slug":"chevrolet-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/chevy_ms.png"},{"id":72,"name":"GMC","slug":"gmc-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/gmc_RM.png"}]},{"id":12166,"title":"Mercedes recalls vehicles with defective headlights","link":"https://www.motorsafety.org/mercedes-recalls-vehicles-defective-headlights/","status":"publish","slug":"mercedes-recalls-vehicles-defective-headlights","excerpt":"<p>Mercedes Benz USA has recalled a number of vehicles potentially equipped with defective headlights.</p>\n","description":"<p>&nbsp;</p>\n<p>Jacksonville, Fla. &#8211; Nov. 17, 2017 &#8211; Mercedes Benz USA has recalled a number of vehicles potentially equipped with <a href=\"https://static.nhtsa.gov/odi/rcl/2017/RCLRPT-17V653-7288.PDF\">defective headlights</a>, according to documentation submitted to the National Highway Transportation Safety Administration. The campaign affects 2018 Mercedes Benz GLA 250 4Matic sport utility vehicles produced between Dec. 12-16. The German automaker estimates just 1 percent of the vehicles referenced in the action contain the defective parts.</p>\n<h3>The Defect</h3>\n<p>Affected vehicles could come equipped with low-beam headlights that do not exhibit the tolerance range mandated in Federal Motor Vehicle Safety Standard 108, which specifies numerous details for <a href=\"https://www.ecfr.gov/cgi-bin/text-idx?node=se49.6.571_1108\">proper headlight installation</a>, according to the Government Publishing Office. The fixtures pose a serious safety hazard to occupants as head lamp range may be reduced, increasing the likelihood of an accident in low-lit conditions. However, Mercedes has yet to receive field reports linking the defective feature to accidents or injuries.</p>\n<h3>Timeline of Events</h3>\n<p>In December 2016, Daimler AG, the international automotive conglomerate that operates the Mercedes brand, launched an internal investigation after quality assurance tests revealed that some vehicles Mercedes produced&nbsp;may not conform with FMVSS 108. Engineers reviewed the existing production processes and discovered that headlights in multiple vehicles deviated from federal standards due to flawed setting practices during assembly.</p>\n<p>In March 2017, DAG&nbsp;personnel reviewed internal records to assess the extent of the issue. At the same time, engineers for the car manufacturer&nbsp;conducted tests to determine the material impact of the defective headlights. Engineering teams confirmed this data, as well as the instances of FMVSS noncompliance, in July 2017.</p>\n<p>In October 2017, DAG chose to conduct a voluntary safety recall.</p>\n<h3>The Solution</h3>\n<p>The automaker intends to direct dealers to inspect and, if necessary, <a href=\"https://static.nhtsa.gov/odi/rcl/2017/RCAK-17V653-3178.pdf\">replace the headlights in affected vehicles</a>, according to an NHTSA recall acknowledgment document. DAG will notify owners in December 2017, approximately one week after sending notifications to dealers. Owners in need of more immediate assistance can contact Mercedes customer service representatives at (877) 496-3691. They can also reach out to the NHTSA directly using its toll-free Vehicle Safety Hotline at (888) 327-4236.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.recallmasters.com/?p=12166","createdAt":"2017-11-17T06:08:27.000Z","date_gmt":"2017-11-17T19:53:27.000Z","updatedAt":"2020-10-04T00:11:54.000Z","modified_gmt":"2020-10-04T13:56:54.000Z","display_date":"November 17, 2017","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2017,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2017/11/Mercedes-Benz-GLA-250-768x528.jpg","alt_text":"","cld_public_id":"Mercedes-Benz-GLA-250","category":{"id":5,"name":"Mercedes-Benz","slug":"mercedes-benz-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mercedes_RM.png"},"tags":[],"categories":[{"id":5,"name":"Mercedes-Benz","slug":"mercedes-benz-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mercedes_RM.png"}]},{"id":12154,"title":"Mercedes recalls vehicles with defective rear axles","link":"https://www.motorsafety.org/mercedes-recalls-vehicles-defective-rear-axles/","status":"publish","slug":"mercedes-recalls-vehicles-defective-rear-axles","excerpt":"<p>Mercedes Benz USA has recalled more than 2,000 vehicles possibly equipped with defective rear axles.</p>\n","description":"<p>&nbsp;</p>\n<p>Jacksonville, Fla. &#8211; Nov. 15, 2017 &#8211; Mercedes Benz USA has recalled more than 2,000 vehicles possibly equipped with <a href=\"https://static.nhtsa.gov/odi/rcl/2017/RCLRPT-17V654-2398.PDF\">defective rear axles</a>, according to documentation submitted to the National Highway Transportation Safety Administration. The campaign affects multiple models, including:</p>\n<ul>\n<li>2015-2016 Mercedes Benz C63 AMG sedans produced between Nov. 7, 2014 and May 30, 2016.</li>\n<li>2015-2017&nbsp;Mercedes Benz C63S sedans produced between Nov. 4, 2014 and May 30, 2016.</li>\n<li>2017 Mercedes Benz C63S AMG coupes produced between Nov. 4, 2014 and May 30, 2016.</li>\n<li>2017 Mercedes Benz C63S AMG cabriolet convertibles produced between Nov. 4, 2014 and May 30, 2016.</li>\n</ul>\n<p>Mercedes estimates that all of the vehicles named in this recall contain the defective parts.</p>\n<h3>The Defect</h3>\n<p>The affected models are likely to contain rear-axle mounting flanges prone to fracture. Should this occur, the rear-axle differential may fall out of alignment, leading to driveshaft&nbsp;failure, loss of vehicle propulsion and, finally, stalling. Consequently, the defect poses a serious safety problem to occupants, as it increases the likelihood of an accident. Mounting-flange fracture is especially likely in extreme starting situations &#8211; race starts, for instance &#8211; that necessitate multiple, short wheel spins and involve relatively high torque peaks, for the feature comes under great stress during these maneuvers.</p>\n<p>Mercedes has yet to field reports connecting the defect to any accidents or injuries.</p>\n<h3>Timeline of Events</h3>\n<p>In February 2016, Daimler AG, the conglomerate the operates Mercedes and oversees the production of the vehicles under the brand, received a report detailing an instance in which a driver experienced driveshaft failure. Over the next four months, DAG became aware of more field reports outlining similar events. In May, the German automaker initiated an investigation and requested parts for internal analysis.</p>\n<p>Over the course of July, DAG engineers attempted to reproduce the problems mentioned in the field reports, testing vehicles equipped with returned parts on slick road surfaces while performing extreme driving maneuvers involving short wheel spins. The car manufacturers analyzed the results of these road tests in September and found that the parts installed on the test vehicles featured mounting-flange fractures. In October, DAG traced the fracturing back to the high torque peaks achieved during road testing and proposed reprogramming the on-board electronic stability control software in the affected vehicles to prevent such occurrences. The company finished the proposed software solution in April 2017 and began testing.</p>\n<p>While engineers worked on the updated ESC software, analysts reviewed production records and found that the problem could affect models produced until May 2016, when DAG introduced a new rear-axle assembly. During May and August 2017, engineers finished and validated the improved ESC program. In September, analysts finished compiling a complete list of affected vehicles.</p>\n<p>On Oct.&nbsp;16, DAG launched a voluntary safety recall to address the issue. Dealers were notified in early November.</p>\n<h3>The Solution</h3>\n<p>The car manufacturing company has directed dealers to <a href=\"https://static.nhtsa.gov/odi/rcl/2017/RCAK-17V654-9057.pdf\">install the new ESC software</a> in affected vehicles free of charge, according to a recall acknowledgement document from the NHTSA. Owners should expect to receive notification via first-class mail in December. Those in need of more immediate assistance can contact Mercedes customer service personnel at (817) 496-3691. Owners can also reach out to&nbsp;the NHTSA directly using its toll-free Vehicle Safety Hotline at (888) 327-4236.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.recallmasters.com/?p=12154","createdAt":"2017-11-15T11:43:44.000Z","date_gmt":"2017-11-16T01:28:44.000Z","updatedAt":"2020-10-04T00:13:23.000Z","modified_gmt":"2020-10-04T13:58:23.000Z","display_date":"November 15, 2017","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2017,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2017/11/Mercedes-benz-C-class-C63-AMG-W205-blue-c-768x512.jpg","alt_text":"","cld_public_id":"Mercedes-benz-C-class-C63-AMG-W205-blue-c","category":{"id":5,"name":"Mercedes-Benz","slug":"mercedes-benz-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mercedes_RM.png"},"tags":[],"categories":[{"id":5,"name":"Mercedes-Benz","slug":"mercedes-benz-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mercedes_RM.png"}]},{"id":12128,"title":"Mercedes recalls vehicles with defective windshield insulation","link":"https://www.motorsafety.org/mercedes-recalls-vehicles-defective-windshield-insulation/","status":"publish","slug":"mercedes-recalls-vehicles-defective-windshield-insulation","excerpt":"<p>Mercedes Benz USA has recalled more than 3,600 vehicles potentially containing defective windshield insulation.</p>\n","description":"<p>&nbsp;</p>\n<p>Jacksonville, Fla. &#8211; Nov. 14, 2017 &#8211; Mercedes Benz USA has recalled more than 3,600 vehicles potentially containing <a href=\"https://static.nhtsa.gov/odi/rcl/2017/RCLRPT-17V655-3224.PDF\">defective windshield insulation</a>, according to documentation submitted to the National Highway Transportation Safety Administration. The campaign affects multiple models, including:</p>\n<ul>\n<li>2016 Mercedes-Benz GLE 63 and 63S AMG sport utility vehicles.</li>\n<li>2016 Mercedes-Benz GLE 63 and 63S AMG coupe sport utility vehicles.</li>\n<li>2017 Mercedes-Benz GLE 63 AMG 4Matic sport utility vehicles.</li>\n<li>2016 Mercedes-Benz GLE&nbsp;300D 4Matic sport utility vehicles.</li>\n<li>2016 Mercedes-Benz GLE 350 4Matic sport utility vehicles.</li>\n<li>2016 Mercedes-Benz GLE 400 4Matic sport utility vehicles.</li>\n<li>2017&nbsp;Mercedes-Benz GLE 550 4Matic sport utility vehicles.</li>\n<li>2017 Mercedes-Benz GLS 450 4Matic sport utility vehicles.</li>\n</ul>\n<p>All of the vehicles referenced in this action were produced between May 4, 2016 and July 27, 2016. Mercedes engineers estimate approximately 1 percent of the recalled models come equipped with the defective features.</p>\n<h3>The Defect</h3>\n<p>The affected vehicles have excess bulkhead insulation beneath their windshields. This material negatively affects windshield bonding and may inhibit the functionality of the front-passenger air bag. This poses a serious safety hazard to occupants, as they may be left unprotected in the event of a collision. That said, Mercedes has yet to receive reports connecting the defect to any accidents or injuries.</p>\n<h3>Timeline of Events</h3>\n<p>In mid-2016, engineers from Daimler AG, the multinational conglomerate that oversees Mercedes and its production processes, noticed that bulkhead insulation in one vehicle covered the vehicle identification number located on its windshield. The company immediately launched an investigation into the matter and quickly determined that excess insulation was the root cause. Later in July of that year, DAG quality assurance personnel evaluated a number of recently assembled vehicles and found that many featured the same abnormality. These models were &#8220;reworked&#8221; prior to shipment.</p>\n<p>In October 2016, the parts supplier&nbsp;HP Pelzer GmbH based in Witten, Germany launched its own independent inquiry to better understand the anomaly. It soon determined that the defect&nbsp;stemmed from&nbsp;a production deviation and corrected its workflows to ensure that the problem did not appear in future vehicles. In December, DAG performed additional analysis to uncover the size of the excess insulation and better understand how it affected windshield bonding near VIN labels. The German automaker received the results in April 2017. The data showed that&nbsp;excess insulation may affect the windshield bonding adjacent to VIN labels.</p>\n<p>In June, DAG conducted further tests and learned that the failed windshield bonding could inhibit passenger-side air bag functionality, creating a serious safety risk for occupants. Three months later, the car manufacturer reviewed its production records to determine how many vehicles might contain the defective bulkhead insulation. HP Pelzer did the same, and later submitted its data to DAG.</p>\n<p>Finally, in early October, the car company initiated a voluntary safety recall.</p>\n<h3>The Solution</h3>\n<p>DAG plans to direct dealers to <a href=\"https://static.nhtsa.gov/odi/rcl/2017/RCAK-17V655-4737.pdf\">remove the excess bulkhead insulation</a> in affected models and rework the windshield bonding free of charge, according to a recall acknowledgement document from the NHTSA. The automaker intends to notify both dealers and owners in December. Individuals who possess vehicles involved in this safety campaign and are in need of more immediate assistance can contact Mercedes customer service representatives at (817) 496-3691. They can also reach out the NHTSA directly using its toll-free Vehicle Safety Hotline at (888) 327-4236.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.recallmasters.com/?p=12128","createdAt":"2017-11-14T07:22:51.000Z","date_gmt":"2017-11-14T21:07:51.000Z","updatedAt":"2020-10-04T00:14:11.000Z","modified_gmt":"2020-10-04T13:59:11.000Z","display_date":"November 14, 2017","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2017,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2017/11/Black-motor-car-Mercedes-Benz-C292-GLE63-AMG-768x512.jpg","alt_text":"","cld_public_id":"Black-motor-car-Mercedes-Benz-C292-GLE63-AMG","category":{"id":5,"name":"Mercedes-Benz","slug":"mercedes-benz-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mercedes_RM.png"},"tags":[],"categories":[{"id":5,"name":"Mercedes-Benz","slug":"mercedes-benz-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mercedes_RM.png"}]},{"id":12101,"title":"GM recalls vehicles with defective air bags","link":"https://www.motorsafety.org/gm-recalls-vehicles-defective-air-bags/","status":"publish","slug":"gm-recalls-vehicles-defective-air-bags","excerpt":"<p>General Motors has recalled more than one-dozen vehicles potentially equipped with defective air bag assemblies.</p>\n","description":"<p>Warren, Mich. &#8211; Nov. 9, 2017 &#8211; General Motors has recalled more than one-dozen vehicles potentially equipped with <a href=\"https://static.nhtsa.gov/odi/rcl/2017/RCLRPT-17V621-3739.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">defective air bag assemblies</a>, according to documentation filed with the National Highway Transportation Safety Administration. The campaign affects multiple models across two brands, including:</p>\n<ul>\n<li>2015-2016 Chevrolet Colorado pickup tucks produced between Oct. 10, 2014 and Feb. 6, 2016.</li>\n<li>2016 Chevrolet Volt electric sedans produced between Oct. 16 and Dec. 14, 2015.</li>\n<li>2015-2016 GMC Canyon pickup trucks produced between Oct. 13, 2014 and Aug. 2, 2015.</li>\n</ul>\n<p>GM suspects that all of the vehicles referenced in this recall contain the defect components.</p>\n<h2>The Defect</h2>\n<p>Affected vehicles include driver-side front air bag assemblies with second-stage inflators that may malfunction upon deployment, thus failing to completely fill the corresponding air bags or do so within the regulated time span. This poses a serious risk to drivers involved in collisions, as they are less protected and therefore more likely to sustain injuries upon impact. However, GM has yet to receive reports connecting the defective air bag assemblies to any injuries or accidents.</p>\n<h2>Timeline of Events</h2>\n<p>In March 2016, GM recalled more than 1,500 vehicles after its air bag supplier, Key Safety Systems, discovered that some of its shipped frontal air bag assemblies failed to meet <a href=\"https://static.nhtsa.gov/odi/rcl/2016/RCLRPT-16V125-9868.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">cold-weather fill-time requirements</a>, according to an NHTSA Safety Recall Report. Specifically, these fixtures came equipped with second-stage inflators without the chemical mixture required to effectively facilitate deployment and fill frontal air bags as much or as quickly as required by law.</p>\n<p>In the months following the March 2016 recall, KSS evaluated its inflators to determine whether mistakes were made during assembly or problems developed due to long-term vehicle use. During this analysis, the parts provider discovered another batch of defective filters that had been shipped to GM and installed in vehicles not referenced in the March 2016 action. KSS notified GM of the issue May 4, 2017. Approximately six days later, the automaker opened an internal investigation to better understand the problem.</p>\n<p>Over the next four months, GM and KSS worked together to analyze the filters received during the March 2016 recall. This data allowed KSS to improve the accuracy of its existing strategy for detecting incorrectly assembled inflators, which involved the evaluation of component weight. The parts provider used this methodology to find defective inflators installed in non-recalled GM vehicles.</p>\n<p>With this new information in hand, the GM Safety and Field Action Decision Authority elected to issue a voluntary safety recall Sept. 28. The car manufacturer notified dealers Oct. 5.</p>\n<h2>The Solution</h2>\n<p>GM has directed dealers to replace the <a href=\"https://static.nhtsa.gov/odi/rcl/2017/RCAK-17V621-9758.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">driver-side frontal air bag assemblies</a> in affected models free of charge, according to an NHTSA recall acknowledgment document. The automaker plans to notify owners via first-class mail Dec. 4. Those in need of more immediate assistance can contact Chevrolet customer service at (800) 222-1020 or GMC customer service at (800) 462-8782. Callers should use the internal GM recall identification number 17387. Owners can also reach out the NHTSA directly using its toll-free Vehicle Safety Hotline at (888) 327-4236.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=12101","createdAt":"2017-11-09T10:08:18.000Z","date_gmt":"2017-11-09T23:53:18.000Z","updatedAt":"2020-10-27T01:30:50.000Z","modified_gmt":"2020-10-27T15:15:50.000Z","display_date":"November 09, 2017","sticky":false,"recall":true,"authors":[{"id":24,"name":"Nate Gouldsbrough","slug":"ngoulds"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"17V621000","recall_date":"October 5, 2017"},"year":2017,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2017/11/Orange-2016-Chevrolet-Colorado-768x512.jpg","alt_text":"","cld_public_id":"Orange-2016-Chevrolet-Colorado","category":{"id":12,"name":"Chevrolet","slug":"chevrolet-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/chevy_ms.png"},"tags":[{"id":1727,"name":"2015-2016 Chevrolet Colorado recall","slug":"2015-2016-chevrolet-colorado-recall"},{"id":1729,"name":"2015-2016 GMC Canyon recall","slug":"2015-2016-gmc-canyon-recall"},{"id":1728,"name":"2016 Chevrolet Volt recall","slug":"2016-chevrolet-volt-recall"},{"id":1593,"name":"Chevrolet airbag","slug":"chevrolet-airbag"},{"id":1591,"name":"GM airbag issue","slug":"gm-airbag-issue"},{"id":1592,"name":"GMC airbag","slug":"gmc-airbag"}],"categories":[{"id":12,"name":"Chevrolet","slug":"chevrolet-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/chevy_ms.png"},{"id":72,"name":"GMC","slug":"gmc-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/gmc_RM.png"}]},{"id":12092,"title":"Volkswagen recalls vehicles with damaged speaker trim","link":"https://www.motorsafety.org/volkswagen-recalls-vehicles-damaged-speaker-trim/","status":"publish","slug":"volkswagen-recalls-vehicles-damaged-speaker-trim","excerpt":"<p>The Volkswagen Group of America has recalled more than 31,000 vehicles potentially equipped with defective speaker trim.</p>\n","description":"<p>&nbsp;</p>\n<p>Auburn Hills, Mich. &#8211; Nov. 8, 2017 &#8211; The Volkswagen Group of America has recalled more than 31,000 vehicles potentially equipped with <a href=\"https://static.nhtsa.gov/odi/rcl/2017/RCLRPT-17V675-9629.PDF\">defective speaker trim</a>, according to documentation submitted to the National Highway Transportation Safety Administration. The campaign affects multiple models, including:</p>\n<ul>\n<li>2017-2018 Audi A4 sedans produced between March 10, 2016 and June 22, 2017.</li>\n<li>2017-2018 Audi A4 Allroad station wagons produced between June 16, 2016 and June 19, 2017.</li>\n<li>2017-2018 Audi A5&nbsp;Sportback&nbsp;sedans produced between Feb. 7, 2017 and Sept. 28, 2017.</li>\n</ul>\n<p>Volkswagen estimates 100 percent of the vehicles referenced in the recall contain the defective features.</p>\n<h3>The Defect</h3>\n<p>The affected models are likely to come equipped with speaker assemblies featuring loose aluminum trim. As a result, these aesthetic components may give way as a result of ineffective adhesive, exposing sharp edges that could cut or puncture occupants and therefore pose a serious safety risk. However, Volkswagen has yet to receive reports connecting the defect to any accidents.</p>\n<h3>Timeline of Events</h3>\n<p>In August 2016, Audi received an injury claim related to loose lower trim door paneling. The automaker immediately launched in investigation into the report. At the same time, the company received a number of similar claims. Audi quality assurance personnel continued the investigation into the fall of 2016, reviewing production records and original vehicle design specifications. These staff members also evaluated the time it might take customers to notice the loose paneling before coming into contact with it and possibly sustaining injuries.</p>\n<p>Throughout February and March 2017, Audi continued to monitor the market, while also moving forward with the internal&nbsp;inquiry begun&nbsp;in August 2016. Over this time period, the engineering personnel involved in these programs updated the&nbsp;Audi Product Safety Committee regularly. On Oct. 18, 2017, this groups chose to conduct a voluntary safety recall.</p>\n<h3>The Solution</h3>\n<p>Volkswagen intends to direct dealers to replace the defective trim in the recalled vehicles with a newer alternative <a href=\"https://static.nhtsa.gov/odi/rcl/2017/RCAK-17V675-2893.pdf\">featuring improved adhesive</a>, according to a recall acknowledgment document from the NHTSA. The automaker plans to inform both dealers and owners of the voluntary safety action sometime this month. Individuals in possession of vehicles referenced in the recall who require more immediate assistance can contact Audi customer service representatives at (800) 253-2834. Callers should use the internal campaign reference code 70G6. Owners can also connect with the NHTSA directly via its toll-free Vehicle Safety Hotline at (888) 327-4236.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=12092","createdAt":"2017-11-08T10:07:55.000Z","date_gmt":"2017-11-08T23:52:55.000Z","updatedAt":"2020-10-04T00:16:55.000Z","modified_gmt":"2020-10-04T14:01:55.000Z","display_date":"November 08, 2017","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2017,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2017/11/Audi-A5-Sportback-quattro-TFSI-Red-768x512.jpg","alt_text":"","cld_public_id":"Audi-A5-Sportback-quattro-TFSI-Red","category":{"id":6,"name":"Volkswagen","slug":"volkswagen-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/volkswagen.png"},"tags":[],"categories":[{"id":6,"name":"Volkswagen","slug":"volkswagen-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/volkswagen.png"}]},{"id":12087,"title":"Toyota recalls hybrids with defective inverters","link":"https://www.motorsafety.org/toyota-recalls-hybrids-defective-inverters/","status":"publish","slug":"toyota-recalls-hybrids-defective-inverters","excerpt":"<p>Toyota Motor Engineering and Manufacturing has recalled a handful of hybrid vehicles with defective inverter assemblies.</p>\n","description":"<p>&nbsp;</p>\n<p>Torrance, Calif. &#8211; Nov. 7, 2017 &#8211; Toyota Motor Engineering and Manufacturing has recalled a handful of hybrid vehicles with defective inverter assemblies, according to documentation submitted to the National Highway Transportation Safety Administration. The campaign affects 2016 Toyota Prius hybrid sedans produced between Dec. 15, 2015 and June 8, 2016. Toyota is unsure how many of the recalled models contain defective parts.</p>\n<h3>The Defect</h3>\n<p>The vehicles referenced in the action come equipped with inverter assemblies whose capacitors may not be properly secured to the inverter housing. This assembly flaw leaves the capacitor terminal vulnerable to damaging vibration during vehicle operation, increasing the likelihood of a complete hybrid system shutdown. In the event that this occurs, the vehicle loses all motive&nbsp;power, creating a serious safety hazard for occupants. While capacitor terminal damage results in engine shutdown, the power steering and braking systems continue to function normally.</p>\n<p>Toyota has yet to receive field reports detailing any accidents or injuries.</p>\n<h3>Timeline of Events</h3>\n<p>In April 2017, the automaker received a report from a U.S. dealer detailing an instance in which a 2016 Prius failed to <a href=\"https://static.nhtsa.gov/odi/rcl/2017/RMISC-17V658-1219.pdf\">failed to start</a>, according to an internal document submitted to the NHTSA. Toyota engineers recovered and inspected the inverter assembly in the vehicle, and found that capacitor mounting bolts were missing. They also discovered that the capacitor itself had incurred terminal damage. The car company launched an investigation to determine how the capacitor bolts had gone missing, focusing on production data and records of the inverter installation process. Toyota found that the inverter assembly had been reworked during capacitor installation and that personnel had failed to re-install the bolts. Toyota soon amended its capacitor installation workflow to prevent similar scenarios from unfolding in the future.</p>\n<p>In July 2017, engineers at the vehicle manufacturing company initiated replication tests to better understand the capacitor terminal damage observed in the vehicle in the report. Staff simulated operational vehicle vibration and applied it to the inverter assembly with the unbolted capacitor. Toyota found that the capacitor was prone to damage in these conditions. It initiated bench testing in an attempt to replicate the engine failure mentioned in the report, but was unable to do so.</p>\n<p>One month later, Toyota received a report from the European market outlining events similar to those detailed in the April report from the U.S. market. Toyota recovered the inverter assembly from the vehicle referenced in the report and found that capacitor mounting bolts were missing. The capacitor terminal had sustained significant damage. Resin from another nearby part also melted within the inverter housing. Toyota installed the inverter assembly in a trial vehicle to see if the component, when stressed, led to complete engine shutdown. During the subsequent test, the trial vehicle lost all motive power, as the hybrid system ceased operation. The car company disassembled the inverter assembly used in the trial car and found that the capacitor terminal had sustained further damage.</p>\n<p>With these results in hand, Toyota officials concluded that vehicles with inverter assemblies that lack capacitor mounting bolts are vulnerable to complete engine shutdown. On Oct. 12, the car company chose to conduct a voluntary safety recall. As of that date, Toyota had received one warranty claim and zero technical field reports related to the defect from dealers in the U.S. market. Dealers received notification Oct. 18.</p>\n<h3>The Solution</h3>\n<p>Toyota has instructed dealers to <a href=\"https://static.nhtsa.gov/odi/rcl/2017/RCAK-17V658-2277.pdf\">replace the inverter assemblies</a> in affected vehicles free of charge, according to an NHTSA recall acknowledgment document. The organization plans to notify owners via telephone in December. Those in need of more immediate assistance can connect with Toyota customer service staff at (800) 331-4331. Callers should use the internal recall identification code H0U. Owners can also reach out the NHTSA directly using its toll-free Vehicle Safety Hotline at (888) 327-4236.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=12087","createdAt":"2017-11-07T10:07:30.000Z","date_gmt":"2017-11-07T23:52:30.000Z","updatedAt":"2020-10-04T05:18:34.000Z","modified_gmt":"2020-10-04T19:03:34.000Z","display_date":"November 07, 2017","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2017,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2017/11/2018-metallic-white-Toyota-Prius-768x512.jpg","alt_text":"","cld_public_id":"2018-metallic-white-Toyota-Prius","category":{"id":17,"name":"Toyota","slug":"toyota-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/toyota_ms.png"},"tags":[],"categories":[{"id":17,"name":"Toyota","slug":"toyota-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/toyota_ms.png"}]},{"id":12089,"title":"Nissan recalls vehicles with defective steering components","link":"https://www.motorsafety.org/nissan-recalls-vehicles-defective-steering-components/","status":"publish","slug":"nissan-recalls-vehicles-defective-steering-components","excerpt":"<p>Nissan North America has recalled more than 17,000 vehicles potentially equipped with defective steering components.</p>\n","description":"<p>&nbsp;</p>\n<p>Franklin, Tenn. &#8211; Nov. 7, 2017 &#8211; Nissan North America has recalled more than 17,000 vehicles potentially equipped with <a href=\"https://static.nhtsa.gov/odi/rcl/2017/RCLRPT-17V691-8456.PDF\">defective steering components</a>, according to documentation submitted to the National Highway Transportation Safety Administration. The campaign affects 2017-2018 Infiniti QX30&nbsp;hatchback sedans assembled between Aug. 10, 2015 and June 16, 2017. Nissan estimates 1 percent of the models referenced in the recall actually contain the defective parts.</p>\n<h3>The Defect</h3>\n<p>The vehicles named in this action could contain broken steering column module clock springs that are insufficiently grounded. These components may produce electromagnetic charges that&nbsp;ascend the steering column, enter air bag assemblies and prompt inadvertent air bag deployment. These fixtures pose a serious safety hazard to occupants &#8211; especially those traveling at high speeds, as the accidental activation of vehicle safety features could lead to a collision. However, Nissan has yet to receive reports connecting the defect to any accidents or injuries.</p>\n<h3>Timeline of Events</h3>\n<p>In October 2017, Mercedes-Benz USA recalled nearly 500,000 vehicles with <a href=\"https://static.nhtsa.gov/odi/rcl/2017/RCLRPT-17V627-3292.PDF\">defective steering columns</a> prone to discharging electromagnetic currents and activating air bags, according to the NHTSA. This action came as the result of a two-year investigation in which Mercedes engineers had discovered that the steering columns in more than three dozen models contained broken clock springs and suffered from electromagnetic incompatibility.</p>\n<p>One month before Mercedes publicized its recall,&nbsp;Daimler AG, the automotive conglomerate that controls Mercedes, contacted Nissan, with whom it shared suppliers, and made the Japanese company aware of the potential safety issue. Throughout October 2017, Nissan engineers met with DAG personnel to better understand the defect. Over this same span, Nissan confirmed that the defective steering column assemblies installed in the recalled Mercedes models had been used during the production of 2017-2018 Infiniti QX30 sedans. Following its meetings with DAG, Nissan chose to conduct its own voluntary safety recall Oct. 26. The car manufacturing company notified dealers Nov. 2.</p>\n<h3>The Solution</h3>\n<p>Nissan has asked dealers to <a href=\"https://static.nhtsa.gov/odi/rcl/2017/RCAK-17V691-5784.pdf\">reinforce the grounding</a> in the steering assemblies installed in the affected vehicles, according to a recall acknowledgment document from the NHTSA. This work, which involves the installation of a&nbsp;commutator ring designed to optimize grounding, will be performed free of charge. In the meantime, Nissan is developing a more effective long-term solution that will be released to dealers when ready. The automaker plans to notify owners Dec. 18. Those in need of more immediate assistance can contact Nissan customer service at (800) 622-6200. Callers should choose option seven when prompted. Owners can also reach out to the NHTSA directly using its toll-free Vehicle Safety Hotline at (888) 327-4236.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=12089","createdAt":"2017-11-07T10:07:01.000Z","date_gmt":"2017-11-07T23:52:01.000Z","updatedAt":"2020-10-04T00:18:13.000Z","modified_gmt":"2020-10-04T14:03:13.000Z","display_date":"November 07, 2017","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2017,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2017/11/Infiniti-q30-768x513.jpg","alt_text":"","cld_public_id":"Infiniti-q30","category":{"id":14,"name":"Nissan","slug":"nissan-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/nissan_RM.png"},"tags":[],"categories":[{"id":14,"name":"Nissan","slug":"nissan-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/nissan_RM.png"}]},{"id":12076,"title":"Toyota recalls minivans with defective shift lock solenoids [Video]","link":"https://www.motorsafety.org/toyota-recalls-minivans-defective-shift-lock-solenoids-video/","status":"publish","slug":"toyota-recalls-minivans-defective-shift-lock-solenoids-video","excerpt":"<p>Hello, and welcome to another vehicle recall update. Toyota Motor Corporation has recalled more than 310,000 vehicles possibly equipped with defective shift-lock solenoids. The campaign affects 2005-2007 and 2009-2010 Toyota Sienna minivans. The affected models likely contain defective shift-lock solenoids that may allow shift levers to move out of the &#8220;park&#8221; without drivers having pressed the brake pedal,</p>\n","description":"<p>Hello, and welcome to another vehicle recall update.</p>\n<p>Toyota Motor Corporation has recalled more than 310,000 vehicles possibly equipped with defective shift-lock solenoids. The campaign affects 2005-2007 and 2009-2010 Toyota Sienna minivans.</p>\n<p>The affected models likely contain defective shift-lock solenoids that may allow shift levers to move out of the &#8220;park&#8221; without drivers having pressed the brake pedal, a considerable potential hazard.</p>\n<p>Toyota intends to notify both dealers and owners December first, two-thousand and seventeen. The automaker will direct dealer service departments to replace the shift-lock solenoids in recalled vehicles, free of charge.</p>\n<p>Stay tuned for more vehicle recall breaking news.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=12076","createdAt":"2017-11-07T03:15:19.000Z","date_gmt":"2017-11-07T17:00:19.000Z","updatedAt":"2018-04-02T04:58:47.000Z","modified_gmt":"2018-04-02T18:43:47.000Z","display_date":"November 07, 2017","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":null,"nhtsa_campaign_number":null,"recall_date":null,"meta_title":null,"meta_description":null,"meta_keywords":null,"custom_schema":null},"year":2017,"month":11,"alt_text":"","cld_public_id":null,"category":{"id":17,"name":"Toyota","slug":"toyota-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/toyota_ms.png"},"tags":[],"categories":[{"id":17,"name":"Toyota","slug":"toyota-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/toyota_ms.png"}]},{"id":12068,"title":"BMW recalls vehicles with defective crankcases","link":"https://www.motorsafety.org/bmw-recalls-vehicles-defective-crankcases/","status":"publish","slug":"bmw-recalls-vehicles-defective-crankcases","excerpt":"<p>BMW of North America has recalled more than 740,000 vehicles potentially equipped with defective crankcases.</p>\n","description":"<p>&nbsp;</p>\n<p>Woodcliff Lake, N.J. &#8211; Nov. 6, 2017 &#8211; BMW of North America has recalled more than 740,000 vehicles potentially equipped with <a href=\"https://static.nhtsa.gov/odi/rcl/2017/RCAK-17V683-4246.pdf\">defective crankcases</a>, according to documentation submitted to the National Highway Transportation Safety Administration. The campaign affects numerous models, including:</p>\n<ul>\n<li>2008-2011 BMW 128I sedans.</li>\n<li>2007-2011 BMW&nbsp;328I sedans.</li>\n<li>2007-2011 BMW&nbsp;525I sedans.</li>\n<li>2007-2011 BMW&nbsp;528I sedans.</li>\n<li>2007-2011 BMW&nbsp;530I sedans.</li>\n<li>2007-2011 BMW&nbsp;X3 sport utility vehicles.</li>\n<li>2007-2011 BMW X5 sport utility vehicles.</li>\n<li>2007-2011 BMW Z3&nbsp;coupes.</li>\n</ul>\n<p>The German automaker has yet to indicate what percentage of the vehicles referenced in the recall contain the defective parts.</p>\n<h3>The Defect</h3>\n<p>The models included in this action could contain defective crankcases with&nbsp;positive crankcase ventilation valve heaters that are&nbsp;prone to short-circuiting. These features pose a serious threat to occupants, as they increase the risk of fire. This could occur during operation or when the vehicle is&nbsp;stationary and switched off.</p>\n<h3>Timeline of Events</h3>\n<p>In early 2009, BMW received a field incident report referencing a 2007 X5 SUV that had <a href=\"https://static.nhtsa.gov/odi/rcl/2017/RMISC-17V683-6725.pdf\">sustained heat damage</a>, according to an incident chronology document submitted to the NHTSA. The car company inspected the vehicle and reviewed the information in the report. These inquires failed to yield a root cause. As a result, BMW initiated a field monitoring program. In late 2009, the automaker received another incident report addressing a 2006 BMW 3 Series sedan with heat damage. BMW received additional reports in early 2010 and later determined that many vehicle owners dealing with heat damage had likely extinguished the resulting fires on their own. The organization launched a parts-return program to collect components from the damaged vehicles for testing.</p>\n<p>Between 2011 and 2012, the car company performed internal tests on the returned parts using microscopy, ultrasound and X-ray technology. These analyses revealed that the PCV valve heaters in the affected models were prone to degradation. Those that fully broke down were cited as the root cause of the heat damage. Since no injuries or accidents had been reported, BMW chose to hold off on issuing a recall and instead decided to reinitiate field monitoring.</p>\n<p>In 2016 and early 2017, BMW Canada revisited the PVC valve heater issue at the request of Transport Canada. Further analyses revealed that affected vehicles could &#8220;age&nbsp;out&#8221; of the condition. The testing also showed that the damage occurred between the second and eighth year of ownership. With this new information in hand, BMW met with the NHTSA in October 2017 and submitted a Part 579 report detailing ongoing field monitoring, as well as potential mitigation actions that may work in the U.S. market. The automaker then reviewed internal manufacturing and supplier records to determine the extent of the problem.</p>\n<p>BMW decided to conduct a voluntary safety recall Oct. 25.</p>\n<h3>The Solution</h3>\n<p>BMW intends to direct dealers to replace&nbsp;PCV valve heaters in affected vehicles free of charge. The company plans to notify both dealers and owners Dec. 18. However, owners in need of more immediate assistance can contact BMW customer service at (800) 525-7417. They can also reach out to the NHTSA directly through its Vehicle Safety Hotline at (888) 327-4236.</p>\n<p>&nbsp;<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=12068","createdAt":"2017-11-06T10:39:17.000Z","date_gmt":"2017-11-07T00:24:17.000Z","updatedAt":"2020-10-04T00:18:58.000Z","modified_gmt":"2020-10-04T14:03:58.000Z","display_date":"November 06, 2017","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2017,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2017/11/BMW-5-series-530-G30-768x512.jpg","alt_text":"","cld_public_id":"BMW-5-series-530-G30","category":{"id":15,"name":"BMW","slug":"bmw-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/bmw_RM.png"},"tags":[],"categories":[{"id":15,"name":"BMW","slug":"bmw-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/bmw_RM.png"}]},{"id":12066,"title":"Chrysler recalls vehicles with defective occupant restraint features","link":"https://www.motorsafety.org/chrysler-recalls-vehicles-defective-occupant-restraint-features/","status":"publish","slug":"chrysler-recalls-vehicles-defective-occupant-restraint-features","excerpt":"<p>Fiat Chrysler Automobiles has recalled more than 414,000 vehicles potentially equipped with defective occupant restraint controllers.</p>\n","description":"<p>&nbsp;</p>\n<p>Auburn Hills, Mich. &#8211; Nov. 3, 2017 &#8211; Fiat Chrysler Automobiles has recalled more than 414,000 vehicles potentially equipped with <a href=\"https://static.nhtsa.gov/odi/rcl/2017/RCLRPT-17V640-6406.PDF\">defective occupant restraint&nbsp;controllers</a>, according to documentation filed with the National Highway Transportation Safety Administration. The campaign affects models across multiple brands, including:</p>\n<ul>\n<li>2012 Jeep Liberty sport utility vehicles manufactured between June 17, 2011 and Aug. 16, 2012.</li>\n<li>2012-2013 Chrysler 200 midsize sedans produced between June 25, 2011 and Jan. 15, 2012.</li>\n<li>2012-2013 Dodge Avenger midsize sedans produced between June 25, 2011 and Jan. 15, 2012.</li>\n</ul>\n<p>FCA speculates that approximately 5 percent of the vehicles named in the recall contain defective parts.</p>\n<h3>The Defect</h3>\n<p>The models referenced in the action may come equipped with damaged ORC assemblies that are prone to&nbsp;jumper resistor failure, a condition that materializes following prolonged electrical overstress. ORC shutdown may cause the active headrests in affected vehicles to malfunction. This poses a serious risk to occupants involved in collisions, as the lack of AHR support may increase the likelihood of cranial concussion. That said, FCA has yet to receive field reports connecting the defective ORC assemblies to any accidents or injuries.</p>\n<p>The air&nbsp;bag warning light normally illuminates in vehicles with defective ORC assemblies.</p>\n<h3>Timeline of Events</h3>\n<p>On July 2, 2013, FCA <a href=\"https://static.nhtsa.gov/odi/rcl/2017/RMISC-17V640-5069.pdf\">launched a voluntary safety recall</a> for 2012 Jeep Liberties, 2012-2013 Chrysler 200s and 2012-2013 Dodge Avengers, after discovering that these vehicles contained integrated power modules that were causing ORC failure and inhibiting AHR operation, according to a chronology document. Dealers reprogrammed the TIPM units in these models to address both issues. Almost four years later on May 16, 2017, the NHTSA contacted FCA and notified the company of several driver complaints referencing the three models included in the 2013 recall. These reports described instances in which the air&nbsp;bag warning light&nbsp;turned on with no clear explanation, apparently indicating some safety feature malfunction. On May 19, the FCA&nbsp;Vehicle Safety and Regulatory Compliance group launched an investigation into the reports. One day later, the auto conglomerate ordered parts from the field for analysis. The NHTSA opened a concurrent inquiry June 1.</p>\n<p>Throughout June and August, FCA received 13 ORC assemblies from the vehicles mentioned in the initial NHTSA reports. In July, the car company determined that at least two parts showed signs of&nbsp;jumper resistor failure due to electrical overstress. On Aug. 11, FCA engineers pinpointed a third part that ceased working following overstress and on Oct. 2, they encountered a fourth problematic component. Two days later, the FCA&nbsp;Vehicle Regulations Committee determined that a voluntary safety recall was necessary.</p>\n<p>As of Sept. 29, FCA has received 122 vehicle owner questionnaires,&nbsp;367 customer assistance inquiry requests and 2,453 warranty claims related to defective ORC equipment.</p>\n<h3>The Solution</h3>\n<p>FCA intends to direct dealers to <a href=\"https://static.nhtsa.gov/odi/rcl/2017/RCAK-17V640-1615.pdf\">replace the ORC assemblies</a> in affected vehicles free of charge, according to a recall acknowledgment document submitted to the NHTSA. The vehicle manufacturer will notify both dealers and owners on or about Nov. 29. The latter should expect to receive word from FCA via first-class mail. Owners in need of more immediate assistance can contact FCA customer service at (800) 853-1403. Callers should use the internal recall identification code T56. Owners can also reach out the NHTSA directly using its vehicle safety hotline at (888) 327-4236.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=12066","createdAt":"2017-11-03T10:37:54.000Z","date_gmt":"2017-11-04T00:22:54.000Z","updatedAt":"2020-10-27T23:38:03.000Z","modified_gmt":"2020-10-28T13:23:03.000Z","display_date":"November 03, 2017","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2017,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2017/11/2010-Jeep-Liberty-768x363.jpg","alt_text":"","cld_public_id":"2010-Jeep-Liberty","category":{"id":20,"name":"Chrysler","slug":"chrysler-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/chrysler_RM.png"},"tags":[],"categories":[{"id":20,"name":"Chrysler","slug":"chrysler-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/chrysler_RM.png"},{"id":7,"name":"Dodge","slug":"dodge-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/dodge.png"},{"id":33,"name":"Jeep","slug":"jeep-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/jeep_ms.png"}]},{"id":3586,"title":"Subaru recalls performance cars with defective audio equipment","link":"https://www.motorsafety.org/subaru-recalls-performance-cars-defective-audio-equipment/","status":"publish","slug":"subaru-recalls-performance-cars-defective-audio-equipment","excerpt":"<p>Recall Masters&nbsp; &#8211; November 1, 2017 Subaru recalls performance cars with defective audio equipmentgain Subaru of America has recalled more than 9,100 vehicles possibly equipped with&nbsp;defective audio equipment, according to documentation filed with the National Highway Transportation Safety Administration. The campaign affects 2015 Subaru WRX performance sedans with production dates ranging from Jan. 17, 2014</p>\n","description":"<p style=\"text-align: left;\"><a href=\"http://www.recallmasters.com/subaru-recalls-performance-cars-defective-audio-equipment/\" target=\"_blank\" rel=\"noopener noreferrer\">Recall Masters&nbsp; &#8211; November 1, 2017</a></p>\n<p style=\"text-align: left;\"><a href=\"http://www.recallmasters.com/subaru-recalls-performance-cars-defective-audio-equipment/\" target=\"_blank\" rel=\"noopener noreferrer\"><img loading=\"lazy\" class=\"alignleft size-medium\" src=\"http://www.recallmasters.com/wp-content/uploads/2017/11/Subaru-of-America-has-recalled-more-than-9100-vehicles-possibly-equipped-with-defective-audio-equipment_16001385_40043879_0_14039887_500.jpg\" alt=\"\" width=\"500\" height=\"334\"></a></p>\n<h3 style=\"text-align: left;\">Subaru recalls performance cars with defective audio equipmentgain</h3>\n<p>Subaru of America has recalled more than 9,100 vehicles possibly equipped with&nbsp;defective audio equipment, according to documentation filed with the National Highway Transportation Safety Administration. The campaign affects 2015 Subaru WRX performance sedans with production dates ranging from Jan. 17, 2014 to April 9, 2015. Subaru suspects 100 percent of the vehicles referenced in the action contain the defective equipment.</p>\n<h3>The Defect</h3>\n<p>The affected sedans likely feature factory-installed subwoofers positioned so that they abut luggage stowed in the trunk. This contact can loosen the&nbsp;subwoofer’s wiring, causing complete disconnection. Should these charged fixtures meet the metal frame of the subwoofer, an intermittent short may occur and damage to integrated circuit components. In some cases, the broken IC parts can generate constant electrical current, leading the subwoofer to overheat and increasing the likelihood of a fire. This poses an obvious safety threat to occupants&#8230;</p>\n<p><a href=\"http://www.recallmasters.com/subaru-recalls-performance-cars-defective-audio-equipment/\" target=\"_blank\" rel=\"noopener noreferrer\">Read the entire article on the&nbsp;Recall Masters website</a><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"http://www.motorsafety.org/?p=3586","createdAt":"2017-11-01T17:03:20.000Z","date_gmt":"2017-11-01T22:48:20.000Z","updatedAt":"2020-10-04T00:20:51.000Z","modified_gmt":"2020-10-04T14:05:51.000Z","display_date":"November 01, 2017","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2017,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2017/11/Subaru-WRX-STI-2015-768x512.jpg","alt_text":"","cld_public_id":"Subaru-WRX-STI-2015","category":{"id":24,"name":"Subaru","slug":"subaru-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/subaru_ms.png"},"tags":[],"categories":[{"id":24,"name":"Subaru","slug":"subaru-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/subaru_ms.png"}]},{"id":12057,"title":"Subaru recalls performance cars with defective audio equipment","link":"https://www.motorsafety.org/subaru-recalls-performance-cars-defective-audio-equipment-2/","status":"publish","slug":"subaru-recalls-performance-cars-defective-audio-equipment-2","excerpt":"<p>Subaru of America has recalled more than 9,100 vehicles possibly equipped with defective audio equipment.</p>\n","description":"<p>&nbsp;</p>\n<p>Cherry Hill, N.J. &#8211; Nov. 1, 2017 &#8211; Subaru of America has recalled more than 9,100 vehicles possibly equipped with <a href=\"https://static.nhtsa.gov/odi/rcl/2017/RCLRPT-17V625-3956.PDF\">defective audio equipment</a>, according to documentation filed with the National Highway Transportation Safety Administration. The campaign affects 2015 Subaru WRX performance sedans with production dates ranging from Jan. 17, 2014 to April 9, 2015. Subaru suspects 100 percent of the vehicles referenced in the action contain the defective equipment.</p>\n<h3>The Defect</h3>\n<p>The affected sedans likely feature factory-installed subwoofers positioned so that they abut luggage stowed in the trunk. This contact can loosen the&nbsp;subwoofer&#8217;s wiring, causing complete disconnection. Should these charged fixtures meet the metal frame of the subwoofer, an intermittent short may occur and damage to integrated circuit components. In some cases, the broken IC parts can generate constant electrical current, leading the subwoofer to overheat and increasing the likelihood of a fire. This poses an obvious safety threat to occupants.</p>\n<p>Owners with vehicles containing the defective equipment have reported hearing crackling noises. Subaru suggested turning off the car audio system to silence these sounds.</p>\n<h3>Timeline of Events</h3>\n<p>In January 2017, Subaru received a field report detailing an instance of subwoofer overheating in a 2015 WRX performance sedan. Two months later, quality assurance personnel at the automaker took possession of the subwoofer and amplifier from the vehicle named in the report. In April, the Japanese automaker shipped the parts to the supplier,&nbsp;Harman International Industries, for analysis. On April 28, Harman submitted its findings. Engineers at the audio company had discovered that the IC features in the subwoofer sustained damage&nbsp;due to overstress. They also found that an electrical short had occurred when the subwoofer wire made contact with the metal support frame. However, Harman could not identify the root cause of the short. As a result, Subaru launched its own investigation to better understand the origin of this electrical disturbance.</p>\n<p>In May 2017, Subaru received another field report from a dealer in Australia. Again, the company requested and received the parts involved for evaluation. Four months passed before engineers at the company uncovered the root cause: contact between the subwoofer and luggage. On Sept. 29, Subaru decided to conduct a safety recall. The organization notified dealers Oct. 9.</p>\n<h3>The Solution</h3>\n<p>The automaker has directed dealers to <a href=\"https://static.nhtsa.gov/odi/rcl/2017/RCAK-17V625-2927.pdf\">inspect the subwoofer wires</a> and install wire retainer clips in affected vehicles free of charge, according to a recall acknowledgment document from the NHTSA. In some cases, dealers may replace the subwoofers altogether, a repair that Subaru has also pledged to subsidize. Owners should have received notification Oct. 31 via first-class mail. Those that did not can contact Subaru customer service personnel at (800) 782-2783. Callers should use the internal recall identification code WTQ-76. Owners in need of further assistance or information can also contact the NHTSA using its vehicle safety hotline at (888) 327-4236.</p>\n<p>&nbsp;<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=12057","createdAt":"2017-11-01T09:57:39.000Z","date_gmt":"2017-11-01T23:42:39.000Z","updatedAt":"2020-10-04T00:21:53.000Z","modified_gmt":"2020-10-04T14:06:53.000Z","display_date":"November 01, 2017","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2017,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2017/11/Subaru-WRX-STI-2015-768x512.jpg","alt_text":"","cld_public_id":"Subaru-WRX-STI-2015","category":{"id":24,"name":"Subaru","slug":"subaru-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/subaru_ms.png"},"tags":[],"categories":[{"id":24,"name":"Subaru","slug":"subaru-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/subaru_ms.png"}]},{"id":11972,"title":"Kia recalls vehicles with pinion gear plugs [Video]","link":"https://www.motorsafety.org/kia-recalls-vehicles-pinion-gear-plugs-video/","status":"publish","slug":"kia-recalls-vehicles-pinion-gear-plugs-video","excerpt":"<p>Hello, and welcome to another vehicle recall update. Kia Motors America has recalled more than three hundred and forty-two thousand vehicles possibly equipped with loose pinion plugs. The campaign affects 2014-2016 Kia Soul and Soul EV subcompact cars. The South Korean automaker estimates 1 percent of the vehicles referenced in the action contain the defective parts.</p>\n","description":"<p>Hello, and welcome to another vehicle recall update.</p>\n<p>Kia Motors America has recalled more than three hundred and forty-two thousand vehicles possibly equipped with loose pinion plugs. The campaign affects 2014-2016 Kia Soul and Soul EV subcompact cars. The South Korean automaker estimates 1 percent of the vehicles referenced in the action contain the defective parts.</p>\n<p>The affected models could contain loose pinion plugs that may force the pinion gear to separate from the steering gear assembly, resulting in dimensioned maneuverability and increasing the risk of an accident.</p>\n<p>Kia plans to direct dealers to re-bond the pinion plugs in affected vehicles with new and improved adhesive.  Owners should expect to receive notification via first-class mail sometime between November sixteenth and November twenty-fourth, two-thousand and seventeen.</p>\n<p>Stay tuned for more vehicle recall breaking news.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=11972","createdAt":"2017-11-01T08:48:40.000Z","date_gmt":"2017-11-01T22:33:40.000Z","updatedAt":"2018-04-02T03:41:30.000Z","modified_gmt":"2018-04-02T17:26:30.000Z","display_date":"November 01, 2017","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":null,"nhtsa_campaign_number":null,"recall_date":null,"meta_title":null,"meta_description":null,"meta_keywords":null,"custom_schema":null},"year":2017,"month":11,"alt_text":"","cld_public_id":null,"category":{"id":32,"name":"Kia","slug":"kia-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/kia_RM.png"},"tags":[],"categories":[{"id":32,"name":"Kia","slug":"kia-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/kia_RM.png"}]},{"id":11974,"title":"Mercedes recalls vehicles with defective steering columns [Video]","link":"https://www.motorsafety.org/mercedes-recalls-vehicles-defective-steering-columns-video/","status":"publish","slug":"mercedes-recalls-vehicles-defective-steering-columns-video","excerpt":"<p>Hello, and welcome to another vehicle recall update. Mercedes Benz U-S-A has recalled nearly five hundred thousand vehicles possibly equipped with defective steering columns. The campaign affects two dozen models. However, Mercedes speculates that a mere one percent of the vehicles named in the recall contain the defective parts. Affected models could contain steering columns</p>\n","description":"<p>Hello, and welcome to another vehicle recall update.</p>\n<p>Mercedes Benz U-S-A has recalled nearly five hundred thousand vehicles possibly equipped with defective steering columns. The campaign affects two dozen models. However, Mercedes speculates that a mere one percent of the vehicles named in the recall contain the defective parts.</p>\n<p>Affected models could contain steering columns with broken clock springs. These damaged fixtures inhibit steering column grounding, risking the sudden occurrence of electrostatic electricity strong enough to cause inadvertent air bag deployment. This poses a serious safety risk to occupants.</p>\n<p>Mercedes plans to direct dealers to add steering column grounding components to all vehicles, free of charge, as a precautionary measure. The car company will notify dealers this month and contact owners via first-class mail December twelfth, two-thousand and seventeen.</p>\n<p>Stay tuned for more vehicle recall breaking news.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://recallmasters.com/?p=11974","createdAt":"2017-11-01T08:47:40.000Z","date_gmt":"2017-11-01T22:32:40.000Z","updatedAt":"2018-04-02T04:04:42.000Z","modified_gmt":"2018-04-02T17:49:42.000Z","display_date":"November 01, 2017","sticky":false,"recall":true,"authors":[{"id":9,"name":"admin","slug":"rm_admin"}],"acf":{"recall_master_id":null,"nhtsa_campaign_number":null,"recall_date":null,"meta_title":null,"meta_description":null,"meta_keywords":null,"custom_schema":null},"year":2017,"month":11,"alt_text":"","cld_public_id":null,"category":{"id":5,"name":"Mercedes-Benz","slug":"mercedes-benz-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mercedes_RM.png"},"tags":[],"categories":[{"id":5,"name":"Mercedes-Benz","slug":"mercedes-benz-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mercedes_RM.png"}]}]