[{"id":16271,"title":"Suzuki Recalls Nearly 19,000 SX4 Vehicles for Power Steering Issues","link":"https://www.motorsafety.org/suzuki-recalls-nearly-19000-sx4-vehicles-for-power-steering-issues/","status":"publish","slug":"suzuki-recalls-nearly-19000-sx4-vehicles-for-power-steering-issues","excerpt":"<p>Suzuki Motor America, Inc. (Suzuki) is recalling certain 2012-2013 Suzuki SX4 vehicles due to potential seizing of the power steering pump.</p>\n","description":"<p>Laguna Hills, CA – November 30, 2018 – Suzuki Motor America, Inc. (Suzuki) is recalling certain 2012-2013 Suzuki SX4 vehicles due to potential seizing of the power steering pump. The potential number of units affected is 18,673.</p>\n<h3>The Defect</h3>\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V804-9474.PDF\">NHTSA Safety Recall Report</a>, under cold start conditions in cold weather conditions, the power steering pump internal pressure may rise, resulting in seizure of the pump. Seizure of the power steering pump can result in a sudden loss of steering assist, increasing the risk of a crash.</p>\n<h3>Timeline of Events</h3>\n<p>In April 2016, SMC received an initial Field Technical Information Report (&#8220;FTIR&#8221;) from its Canadian distributor that indicated that there is no power steering assist when turning the steering wheel at low speed. It was confirmed that the vehicle in question had a replacement power steering pump (PS pump) installed for the 15V-587 recall (Suzuki VS recall for PS pump failure), reported to NHTSA in September 2015. SMC collected the PS pump from the Canadian distributor and asked the supplier to investigate the failure.</p>\n<p>The following investigation results confirmed that there was seizure of the cartridge sliding surface inside the PS pump. It was identified that for the VS recall countermeasure PS pump, the lower limit of the spool clearance value was changed and 11.6mg of contamination was found inside of the PS pump, exceeding the supplier manufacturing process contamination control value of 5 mg or less. SMC could not identify the reason why the cartridge sliding surface seized.</p>\n<p>SMC subsequently received a second, third and fourth FTIRs from its Canadian distributor with more or less the same results and no ability to identify what cartridge sliding surfaces seized. From January to March 2018, SMC received 15 additional FTIRs from Canada and 9 FTIRs from the United States. SMC confirmed that all of the vehicles involved had the VS recall correction. From April to June 2018, SMC received 3 additional FTIRs from Canada and an additional 9 FTIRs from the United States, and from June to August 2018, SMC received 2 additional FTIRs from the United States. SMC had received a cumulative total of 42 FTIRs.</p>\n<p>SMC began to coordinate with a supplier of competing PS pumps to request an evaluation test of the VS recall countermeasure PS pump, but despite low temperature accelerated tests of the VS recall countermeasure PS pump the cause of the PS pump seizure could not be identified. In October 2018, SMC continued conducting the investigation and in November, 2018 SMC decided to report the existence of a safety-related defect. SMC is still working to identify the root cause of the PS pump failures, and to determine a recall countermeasure.</p>\n<h3>The Solution</h3>\n<p>The remedy for this recall is still under development. The manufacturer has not yet provided a notification schedule. Owners may contact Suzuki customer service at 1-800-934-0934. Owners may also call the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153). The NHTSA Campaign Number for this recall is 18V-804.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16271","createdAt":"2018-11-30T07:50:40.000Z","date_gmt":"2018-11-30T21:35:40.000Z","updatedAt":"2020-10-01T11:19:41.000Z","modified_gmt":"2020-10-02T01:04:41.000Z","display_date":"November 30, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2018,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/11/shutterstock_1523162204-768x513.jpg","alt_text":"","cld_public_id":"shutterstock_1523162204","category":{"id":28,"name":"Suzuki","slug":"suzuki-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/suzuki-logo.png"},"tags":[],"categories":[{"id":28,"name":"Suzuki","slug":"suzuki-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/suzuki-logo.png"}]},{"id":16273,"title":"Ford Recalls Nearly 35,000 Vehicles Due to Missing Seat Brackets","link":"https://www.motorsafety.org/ford-recalls-nearly-35000-vehicles-due-to-missing-seat-brackets/","status":"publish","slug":"ford-recalls-nearly-35000-vehicles-due-to-missing-seat-brackets","excerpt":"<p>Ford Motor Company (Ford) is recalling certain 2018 Lincoln Navigator, and Ford Expedition vehicles due to missing reinforcement brackets in the center row seating.</p>\n","description":"<p>Laguna Hills, CA – November 30, 2018 – Ford Motor Company (Ford) is recalling certain 2018 Lincoln Navigator, and Ford Expedition vehicles due to missing brackets in the center row seating. The potential number of units affected is 34,946.</p>\n<h2>The Defect</h2>\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V805-5341.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">NHTSA Recall Safety Report</a>, the second row center seat track assemblies may be missing one or both of the J-Channel reinforcement brackets, possibly allowing the seat to move in the event of a crash. In the event of a crash, a seat that moves may not properly restrain the seat occupant, increasing their risk of injury.</p>\n<p>This recall includes all vehicles produced with this seat configuration (second row bench [40/20/40]), which was a new design for the 2018 model year. The second row bench center (20%) seat is adjustable and can be positioned 70mm further forward than the outboard seats. The owner&#8217;s manual states the seat should be adjusted to its rearward position when it is occupied by older children or adults, including children in booster seats.</p>\n<h2>Timeline of Events</h2>\n<p>On August 30, 2018, Ford&#8217;s Critical Concerns Review Group (CCRG) reviewed a concern regarding missing J-channel reinforcement brackets on certain 2018 model year Expedition and Navigator second row bench center (20%) seats. This seat track assembly design, which was new for 2018 models, contains two J-channel reinforcement brackets, one left-hand and one right-hand. CCRG requested an assessment of center seat structural integrity with one or both J-channel bracket reinforcements missing.</p>\n<p>During September and October 2018, directional CAE analysis was conducted on a rigidified body sheet metal structure with the second row center seat in the full rear and full forward seating positions, and a more detailed analysis simulating actual body sheet metal structure was performed under crash conditions to determine if the missing brackets presented a risk.</p>\n<p>The in-depth CAE analysis, simulating the production vehicle design, indicated that the seat track missing one or both J-channel reinforcement brackets may peel or tear when the seat is adjusted in the fully forward or near fully forward position. This could lead to increased risk of injury during a crash, particularly for children seated in the middle row seating.</p>\n<p>CAE was able to confirm that a seat adjusted in the full rearward seating position did not present this concern. On November 5, 2018, Ford&#8217;s Field Review Committee reviewed the concern and approved a recall; at this time, Ford was not aware of any reports of accident or injury related to this issue.</p>\n<h2>The Solution</h2>\n<p>Owners will be notified by mail and instructed to take their vehicle to a Ford or Lincoln dealer to have the second row center (20%) seat inspected to determine if both J-channel brackets are installed. If one or both J-channel brackets are missing, dealers will replace the center seat frame assembly. There will be no charge for this service. Until the vehicle is serviced for this concern, customers are advised to adjust the center seat to its full rearward position. The recall is expected to begin December 17, 2018. Owners may contact Ford customer service at 1-866-436-7332. Ford&#8217;s number for this recall is 18S37. Owners may also call the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153). The NHTSA Campaign Number for this recall is 18V-805.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16273","createdAt":"2018-11-30T07:50:37.000Z","date_gmt":"2018-11-30T21:35:37.000Z","updatedAt":"2020-10-22T02:00:43.000Z","modified_gmt":"2020-10-22T15:45:43.000Z","display_date":"November 30, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"18V805000","recall_date":"November 14, 2018"},"year":2018,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/11/Blue-2018-Lincoln-Navigator-768x512.jpg","alt_text":"","cld_public_id":"Blue-2018-Lincoln-Navigator","category":{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"},"tags":[{"id":1602,"name":"2018 Ford Expedition recall","slug":"2018-ford-expedition-recall"},{"id":1603,"name":"2018 Lincoln Navigator recall","slug":"2018-lincoln-navigator-recall"},{"id":1605,"name":"Ford center row seating","slug":"ford-center-row-seating"},{"id":1604,"name":"Lincoln center row seating","slug":"lincoln-center-row-seating"}],"categories":[{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"},{"id":26,"name":"Lincoln","slug":"lincoln-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/lincoln_RM.png"}]},{"id":16275,"title":"Ford Recalls Nearly 300 Nautilus Vehicles Due to Air Bag Issue","link":"https://www.motorsafety.org/ford-recalls-nearly-300-nautilus-vehicles-due-to-air-bag-issue/","status":"publish","slug":"ford-recalls-nearly-300-nautilus-vehicles-due-to-air-bag-issue","excerpt":"<p>Ford Motor Company (Ford) is recalling certain 2019 Lincoln Nautilus vehicles that are not equipped due to a defect in an air bag cover.</p>\n","description":"<p>Laguna Hills, CA – November 29, 2018 – Ford Motor Company (Ford) is recalling certain 2019 Lincoln Nautilus vehicles that are not equipped with Adaptive Front Steering, due to a defect in an air bag cover. The potential number of units affected is 268.</p>\n<h2>The Defect</h2>\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V806-3961.PDF\">NHTSA Recall Safety Report,</a> the driver airbag modules installed in vehicles may contain a plastic cover that was improperly injection-molded at the sub-tier supplier. A driver airbag cover that has not been properly molded may detach during an airbag deployment. If the air bag cover separates during deployment, it can increase the risk of injury in the event of a crash.</p>\n<h2>Timeline of Events</h2>\n<p>On September 27, 2018, Autoliv, the non-AFS driver airbag module Tier 1 supplier, notified Ford of a test anomaly that had occurred during a lot acceptance test (LAT) at high temperature on that day. Autoliv subsequently contained all suspect parts from that lot, and began an investigation into the cause of the failure.</p>\n<p>In October 2018, Autoliv&#8217;s ongoing investigation discovered that the potential root cause could be attributed to the presence of knit lines in the area of the tear seam on the airbag cover substrate, and it was also revealed that the Tier 3 supplier (DEMO) made several adjustments to the cover injection-molding process without notifying the Tier 2 supplier (Eissmann) of the adjustments. These adjustments had resulted in the improper forming of the knit lines in the area of the cover tear seam.</p>\n<p>The investigation also revealed that the injection-molding process change had been used on covers that were built into airbag module assemblies which had previously passed LAT and were subsequently installed in vehicles; therefore, an analysis to identify the release status of these vehicles was initiated. On November 5, 2018, Ford&#8217;s Field Review Committee reviewed the concern and approved a recall.</p>\n<h2>The Solution</h2>\n<p>Owners will be notified by mail and instructed to take their vehicle to a Ford or Lincoln dealer to have the driver airbag module replaced. There will be no charge for this service. The recall is expected to begin in November 2018. Owners may contact Ford customer service at 1-866-436-7332. Ford&#8217;s number for this recall is 18S38. Owners may also call the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153). The NHTSA Campaign Number for this recall is 18V-806.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16275","createdAt":"2018-11-29T07:50:35.000Z","date_gmt":"2018-11-29T21:35:35.000Z","updatedAt":"2020-10-22T02:04:25.000Z","modified_gmt":"2020-10-22T15:49:25.000Z","display_date":"November 29, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"18V806000","recall_date":"November 14, 2018"},"year":2018,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/11/blue-ford-nautilus-1-768x512.jpg","alt_text":"","cld_public_id":"blue-ford-nautilus-1","category":{"id":26,"name":"Lincoln","slug":"lincoln-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/lincoln_RM.png"},"tags":[{"id":1229,"name":"2019 Lincoln Nautilus recall","slug":"2019-lincoln-nautilus-recall"},{"id":1606,"name":"Lincoln airbag cover","slug":"lincoln-airbag-cover"}],"categories":[{"id":26,"name":"Lincoln","slug":"lincoln-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/lincoln_RM.png"}]},{"id":16277,"title":"Ford Recalls 114 Explorers Over Potential Fuel Leak","link":"https://www.motorsafety.org/ford-recalls-114-explorers-over-potential-fuel-leak/","status":"publish","slug":"ford-recalls-114-explorers-over-potential-fuel-leak","excerpt":"<p>Ford Motor Company (Ford) is recalling certain 2018 Ford Explorer vehicles equipped with 2.3L or 3.5L GTDI engine for a potential fuel leak.</p>\n","description":"<p>Laguna Hills, CA – November 29, 2018 – Ford Motor Company (Ford) is recalling certain 2018 Ford Explorer vehicles equipped with 2.3L or 3.5L GTDI engine for a potential fuel leak. The potential number of units affected is 114.</p>\n<h3>The Defect</h3>\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V807-1500.PDF\">NHTSA Recall Safety Report</a>, some fuel pressure sensors were produced by a supplier with over-size male threads resulting in a gap between the fuel pressure sensor and the mating saddle port with the o-ring not fully seated. Potentially, some Explorer vehicles built within the suspect date range may have a fuel pressure sensor that was not properly assembled. An improperly assembled fuel pressure sensor can result in a fuel leak. Fuel leaks in the presence of an ignition source can increase the risk of a fire.</p>\n<h3>Timeline of Events</h3>\n<p>On July 30, 2018, Ford&#8217;s Chicago Assembly Plant (CAP) discovered an Explorer with a 2.3L engine in the yard with fuel underneath it on the ground. The fuel leak was determined to originate from the fuel pressure sensor joint in the fuel line assembly on the top of fuel tank. CAP issued a Stop Ship on August 1, 2018, to contain all vehicles at the plant and in transit for inspection.</p>\n<p>Ford&#8217;s Critical Concern Review Group (CCRG) subsequently reviewed this issue, beginning by inspecting held vehicles built during the month of July 2018, and initiated a Design of Experiments (DOE) to help determine the cause. The vehicle inspections identified no fuel leaks in the more than 9,000 vehicles being held; however, four sensors that were not properly assembled were identified. The four vehicles were built within a three day period between July 29, 2018, through July 31, 2018, and it was determined that the cause was over-size threads on the sensor.</p>\n<p>Using the supplier&#8217;s records, Ford&#8217;s investigation of vehicle production records determined that 144 vehicles built at CAP during a specified three day period when incorrect parts were available were delivered to dealerships before the inspection could be completed and may or may not actually contain incorrect parts. On November 5, 2018, Ford&#8217;s Field Review Committee reviewed the concern and approved a recall, being unaware of any reports of accident, injury or fire related to this condition.</p>\n<h3>The Solution</h3>\n<p>Owners will be notified by mail and instructed to take their vehicle to a Ford or Lincoln dealer to have the fuel line assembly replaced. There will be no charge for this service. The recall is expected to begin December 3, 2018. Owners may contact Ford customer service at 1-866-436-7332. Ford&#8217;s number for this recall is 18S35. Owners may also call the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153). The NHTSA Campaign Number for this recall is 18V-807.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16277","createdAt":"2018-11-29T07:50:32.000Z","date_gmt":"2018-11-29T21:35:32.000Z","updatedAt":"2020-10-01T12:01:41.000Z","modified_gmt":"2020-10-02T01:46:41.000Z","display_date":"November 29, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2018,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/11/2019-Ford-Explorer-768x576.jpg","alt_text":"","cld_public_id":"2019-Ford-Explorer","category":{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"},"tags":[],"categories":[{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"}]},{"id":16267,"title":"Honda Recalls Nearly 65,000 Acura MDX Vehicles for Brake Issues","link":"https://www.motorsafety.org/honda-recalls-nearly-65000-acura-mdx-vehicles-for-brake-issues/","status":"publish","slug":"honda-recalls-nearly-65000-acura-mdx-vehicles-for-brake-issues","excerpt":"<p>American Honda Motor Co. is recalling certain 2017-2019 Acura MDX, 2017-2018 Acura MDX Sport Hybrid, 2018-2019 Honda HR-V and Honda Odyssey, and 2016 Honda HR-V vehicles, in order to have the rear brakes bled due to gas pockets.</p>\n","description":"\n<p><em>Laguna Hills, CA – November 28, 2018</em> – Honda (American Honda Motor Co.) is recalling certain vehicles to have the rear brakes bled due to gas pockets. The potential number of units affected is 64,785, including: </p>\n\n\n\n<ul><li>2017-2019 Acura MDX</li><li>2017-2018 Acura MDX Sport Hybrid</li><li>2018-2019 Honda HR-V and Honda Odyssey</li><li>2016 Honda HR-V vehicles</li></ul>\n\n\n\n<h2>The defect</h2>\n\n\n\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V777-2781.PDF\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">NHTSA Recall Safety Report</a>, in affected vehicles the rear brake caliper pistons may have an insufficient coating, causing gas pockets to form, reducing brake performance. A reduction of braking performance increases the risk of a crash.</p>\n\n\n\n<h2>Timeline of events</h2>\n\n\n\n<p>In July 2018, the rear brake caliper supplier informed Honda of quality issues affecting some of its products. Honda subsequently launched an investigation.</p>\n\n\n\n<p>From August to October 2018 Honda learned that a sub-supplier&#8217;s manufacturing process improperly trapped high levels of hydrogen on the <a href=\"https://www.knowyourparts.com/technical-resources/brakes-and-brake-components/servicing-brake-calipers/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\" aria-label=\" (opens in a new tab)\">brake piston</a> during surface plating, and that the tempering process intended to remove excess hydrogen may not have been performed to specification.</p>\n\n\n\n<p>Honda investigated the potential for FMVSS noncompliance and the range of potentially affected vehicles, and on October 25, 2018, Honda completed the investigation. </p>\n\n\n\n<p>The final determination was that the potential for FMVSS noncompliance exists and Honda therefore decided to conduct a safety recall.</p>\n\n\n\n<p>As of October 25, 2018, Honda has received 170 warranty claims, 90 field reports, and no reports of crashes or injuries related to this issue. The problem does not recur after brakes are bled to remove initial gas pockets.</p>\n\n\n\n<h2>The solution</h2>\n\n\n\n<p>Owners will be notified, and Honda or Acura dealers will bleed the brakes, free of charge. </p>\n\n\n\n<p>MotorSafety.org can help you determine whether your vehicle is subject to a government-mandated recall or whether there is some factory notice that you should be informed of. </p>\n\n\n\n<p>Check your car’s recall status using MotorSafety’s <a href=\"https://www.motorsafety.org/\">free vehicle lookup tool</a></p>\n<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script>","source":"https://www.motorsafety.org/?p=16267","createdAt":"2018-11-28T07:50:29.000Z","date_gmt":"2018-11-28T21:35:29.000Z","updatedAt":"2020-11-05T23:59:35.000Z","modified_gmt":"2020-11-06T13:44:35.000Z","display_date":"November 28, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"18V777000","recall_date":"November 1, 2018"},"year":2018,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/11/vlack-2015-Acura-MDX-768x512.jpg","alt_text":"","cld_public_id":"vlack-2015-Acura-MDX","category":{"id":34,"name":"Acura","slug":"acura-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/acura.png"},"tags":[{"id":1607,"name":"2017-2018 Acura MDX recall","slug":"2017-2018-acura-mdx-recall"},{"id":1608,"name":"2017-2019 Honda HR-V recall","slug":"2017-2019-honda-hr-v-recall"},{"id":1610,"name":"Acura brakes issue","slug":"acura-brakes-issue"},{"id":1609,"name":"Honda brake issue","slug":"honda-brake-issue"}],"categories":[{"id":34,"name":"Acura","slug":"acura-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/acura.png"},{"id":4,"name":"Honda","slug":"honda-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/honda_ms.png"}]},{"id":16269,"title":"Lotus Recalls 40 Evora Vehicles for Steering Column Problem","link":"https://www.motorsafety.org/lotus-recalls-40-evora-vehicles-for-steering-column-problem/","status":"publish","slug":"lotus-recalls-40-evora-vehicles-for-steering-column-problem","excerpt":"<p>Lotus Cars Limited (Lotus) is recalling certain 2018 Lotus Evora vehicles due to a potential danger in case of a crash should the steering column not collapse correctly.</p>\n","description":"<p>Laguna Hills, CA – November 28, 2018 – Lotus Cars Limited (Lotus) is recalling certain 2018 Lotus Evora vehicles due to a potential danger in case of a crash should the steering column not collapse correctly. Vehicles affected are 2018 model year Lotus Evora (all variants). The potential number of units affected is 40.</p>\n<h3>The Defect</h3>\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V781-7368.PDF\">NHTSA Recall Safety Report</a>, during a vehicle crash event, the steering column is designed to partially collapse and help dissipate a portion of the crash energy. On some assemblies, the screw securing the steering column cartridge, which supports the column during the collapse process, has been found to be finger tight only.</p>\n<p>If the screw is loose but remains engaged in the thread, there is expected to be no adverse effect on vehicle crash performance. However, if the screw disengages from the thread, in the event of a frontal collision, the steering column may not properly collapse to absorb some of the impact energy. If the steering column does not collapse as intended in a crash, it can increase the risk of injury to the driver and possibly any passengers.</p>\n<h3>Timeline of Events</h3>\n<p>Lotus has been notified that a small number of Evora steering columns have been assembled incorrectly, which could compromise the performance of the part in a vehicle crash.</p>\n<p>A mis-build issue of the steering column assembly fitted to the Evora model range has been identified in a small number of vehicles manufactured between 17/04/2018 to 02/10/2018. As a result, the steering column cartridge screw may not have been tightened to its specified torque of 5 Nm</p>\n<p>The manufacturer of the steering column corrected the recall condition by re-setting the torque wrench used in the assembly process. Correctly assembled steering columns were introduced into vehicle production with effect from 10/10/2018.</p>\n<h3>The Solution</h3>\n<p>Lotus will notify owners, and dealers will correct the steering column assembly, free of charge. The manufacturer has not yet provided a notification schedule. Owners may contact Lotus customer service at 1-800-245-6887. Lotus&#8217; number for this recall is 2018/01R. Owners may also call the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153). The NHTSA Campaign Number for this recall is 18V-781.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16269","createdAt":"2018-11-28T07:50:27.000Z","date_gmt":"2018-11-28T21:35:27.000Z","updatedAt":"2020-10-01T12:03:14.000Z","modified_gmt":"2020-10-02T01:48:14.000Z","display_date":"November 28, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2018,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/11/black-Lotus-Evora-768x512.jpg","alt_text":"","cld_public_id":"black-Lotus-Evora","category":null,"tags":[],"categories":[]},{"id":16261,"title":"Toyota Recalls Nearly 17,000 Scion xA Vehicles Due to Air Bag Defect","link":"https://www.motorsafety.org/toyota-recalls-nearly-17000-scion-xa-vehicles-due-to-air-bag-defect/","status":"publish","slug":"toyota-recalls-nearly-17000-scion-xa-vehicles-due-to-air-bag-defect","excerpt":"<p>Toyota Motor Engineering &#038; Manufacturing (Toyota) is recalling certain 2004-2006 Toyota Scion xA vehicles for a potential internal short in the air bag module.</p>\n","description":"<p>Laguna Hills, CA – November 28, 2018 – Toyota Motor Engineering &amp; Manufacturing (Toyota) is recalling certain 2004-2006 Toyota Scion xA vehicles for a potential internal short in the air bag module. The potential number of units affected is 16,992.</p>\n<h3>The Defect</h3>\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V776-8447.PDF\">NHTSA Recall Safety Report,</a> the airbag control module for the supplemental restraint system (SRS ECU) in the subject vehicles may have been manufactured with application-specific integrated circuits (ASICs) which are susceptible to internal shorting when exposed to the naturally high inductive electrical noise from various vehicle electrical components close to the module. In some cases, the SRS warning light for the airbag(s) could illuminate, and the airbag(s) and/or seat belt pretensioner (s) could become deactivated. In other cases, these systems could inadvertently deploy in the absence of an impact. An airbag that is deactivated or is deployed inadvertently can increase the risk of injury or the possibility of a crash.</p>\n<h3>Timeline of Events</h3>\n<p>In 2013, Toyota recalled approximately 890,000 vehicles in the U.S. which were equipped with generation 5.0 TRW SRS ECUs. In these ECUs, damage due to electrical noise could result in an inadvertent deployment of the airbag(s) and/or seat belt pretensioners. At the time, generation 5.5 SRS ECUs (that are the subject of this recall) were not included.</p>\n<p>In June 2013, Toyota received a field report from the European market indicating the inadvertent activation of the driver, front passenger, and knee airbags while driving a CY 2006 Corolla Verso vehicle. Airbags were found to be activated as per the customer&#8217;s allegation, but there was no evidence of an impact. The SRS ECU was recovered and investigated, and damage appeared to be similar to damage from electrical noise that could have occurred on a generation 5.0 SRS ECU, recalled in 2013; however, it was judged to be an isolated case due to the differences between the 5.0 and 5.5 models.</p>\n<p>In July 2015, Toyota received information from a dealer in the Japan market indicating the inadvertent activation of the driver, front passenger, and knee airbags while driving a CY 2006 Avensis vehicle. Similar results were found. Toyota began replication testing and recovery of working SRS ECUs of this generation from in-use vehicles and found that the generation 5.5 SRS ECUs have higher insulation against electrical noise compared to the recalled generation 5.0 ECUs. However, Toyota continued to sporadically receive similar field reports from countries outside of North America, mainly from European countries and Japan, and continued its investigation.</p>\n<p>Toyota reviewed the difference between the Avensis and other models, and once again started the recovery of working SRS ECUs from a larger population of in-use Avensis vehicles. In August 2017, Toyota also received the first field report from the U.S. market, claiming inadvertent activation of the driver and front passenger airbags in a 2006 MY Toyota Scion xA vehicle with a generation 5.5 SRS ECU. Toyota investigated the SRS ECU and confirmed the damage of the ASIC for transmitting the signal to deploy the airbags was similar to other cases from the European and Japan markets. At that time, Toyota observed that the insulation against electrical noise found in the ASICs in the generation 5.5 SRS ECUs had an unexpectedly wide variation in effectiveness and Toyota subsequently chose to conduct a voluntary safety recall campaign.</p>\n<h3>The Solution</h3>\n<p>All known owners of the subject vehicles will be notified by first class mail to return their vehicles to a Toyota dealer. The dealers will replace the airbag control module with an updated one, free of charge. The owner letter will also instruct vehicle owners who have paid to have this condition remedied prior to this campaign to seek reimbursement under Toyota&#8217;s General Reimbursement Plan. The recall is expected to begin December 24, 2018. Owners may contact Toyota customer service at 1-888-270-9371. Toyota&#8217;s number for this recall is J0W. Owners may also call the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153). The NHTSA Campaign Number for this recall is 18V-776.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16261","createdAt":"2018-11-28T07:50:24.000Z","date_gmt":"2018-11-28T21:35:24.000Z","updatedAt":"2021-01-04T10:36:24.000Z","modified_gmt":"2021-01-05T00:21:24.000Z","display_date":"November 28, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":"","meta_title":"","meta_description":"","meta_keywords":"","custom_schema":""},"year":2018,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/11/black-toyota-scion-768x512.jpg","alt_text":"","cld_public_id":"black-toyota-scion","category":{"id":169,"name":"Scion","slug":"scion-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/scion_RM.png"},"tags":[],"categories":[{"id":169,"name":"Scion","slug":"scion-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/scion_RM.png"},{"id":17,"name":"Toyota","slug":"toyota-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/toyota_ms.png"}]},{"id":16263,"title":"GM Recalls Several Vehicles for Air Bag Deployment Issues","link":"https://www.motorsafety.org/gm-recalls-several-vehicles-for-air-bag-deployment-issues/","status":"publish","slug":"gm-recalls-several-vehicles-for-air-bag-deployment-issues","excerpt":"<p>General Motors LLC (GM) is recalling certain 2019 Buick Encore, Chevrolet Spark, Traverse, and Trax vehicles due to a potential airbag deployment issue.</p>\n","description":"\n<p><em>Laguna Hills, CA – November 27, 2018</em> – General Motors LLC (GM) is recalling certain 2019 Buick Encore, Chevrolet Spark, Traverse, and Trax vehicles due to a potential air bag deployment issue. The potential number of units affected is 12.</p>\n\n\n\n<h2>The defect</h2>\n\n\n\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V774-3545.PDF\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">NHTSA Recall Safety Report</a>, in a small number of the listed vehicles, the sensing diagnostic module (SDM) may have been left in &#8220;manufacturing mode&#8221; and not activated at the assembly plant prior to shipment. </p>\n\n\n\n<p>If the SDM is in manufacturing mode, the vehicle&#8217;s airbags will not deploy in a crash, increasing the risk of occupant injury. Most other functions controlled by the same module, such as seatbelt reminder, event data recording and post collision notification, will also be inactive. </p>\n\n\n\n<p>Drivers may receive advance notice of this issue via the airbag/supplemental inflatable restraint malfunction indicator lamp on the instrument panel, which will illuminate and remain illuminated (solid or flashing) after the vehicle is turned on.</p>\n\n\n\n<h2>Timeline of events</h2>\n\n\n\n<p>On October 3, 2018, a vehicle in GM&#8217;s Bupyeong, Korea plant was discovered to have a <a href=\"https://www.motorsafety.org/gm-recalls-several-vehicles-for-air-bag-deployment-issues/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">flashing airbag warning</a> light after passing validation testing. </p>\n\n\n\n<p>GM subsequently started an investigation into the issue, which determined that the vehicle&#8217;s sensing and diagnostic module (SDM) was set to &#8220;manufacturing mode;&#8221; when in this setting, the SDM is unarmed and the supplemental inflatable restraints are disabled.</p>\n\n\n\n<p>GM further determined that the condition&#8217;s root cause is an error in a software update to GM&#8217;s production process at certain plants. </p>\n\n\n\n<p>When the module is originally programmed during vehicle assembly, GM sets it to manufacturing mode, which is designed to prevent accidental restraint and air bag deployment when the vehicle is in the assembly facility. </p>\n\n\n\n<p>Once full assembly is complete, all GM vehicles are subjected to a series of quality tests called dynamic vehicle tests (DVT), and at the conclusion of this process, the vehicle&#8217;s sensing diagnostic module (SDMs) is activated, which arms the restraints.</p>\n\n\n\n<p>The error which was discovered in the software update can prevent the SDM from being activated in some vehicles at the conclusion of DVT. Due to this error, which only affected 12 vehicles, on October 25, 2018, GM&#8217;s Safety Field Action Decision Authority (SFADA) decided to conduct a safety recall.</p>\n\n\n\n<h2>The solution</h2>\n\n\n\n<p>GM will notify owners, and dealers will reprogram the SDM module to the correct mode, free of charge. The recall began November 6, 2018. </p>\n\n\n\n<p>Check your car’s recall status using MotorSafety’s <a href=\"https://www.motorsafety.org/\">free vehicle lookup tool</a>.</p>\n<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script>","source":"https://www.motorsafety.org/?p=16263","createdAt":"2018-11-27T07:45:59.000Z","date_gmt":"2018-11-27T21:30:59.000Z","updatedAt":"2020-11-06T01:49:04.000Z","modified_gmt":"2020-11-06T15:34:04.000Z","display_date":"November 27, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"18V774000","recall_date":"November 1, 2018"},"year":2018,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/11/Chevy-Spark-768x515.jpg","alt_text":"Lime Green 2013 Chevy Spark.","cld_public_id":"Chevy-Spark","category":{"id":27,"name":"Buick","slug":"buick-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2021/08/Buick-Logo.png"},"tags":[{"id":1611,"name":"2019 Buick Encore recall","slug":"2019-buick-encore-recall"},{"id":1612,"name":"2019 Chevrolet Spark recall","slug":"2019-chevrolet-spark-recall"},{"id":1613,"name":"2019 Chevrolet Traverse recall","slug":"2019-chevrolet-traverse-recall"},{"id":1614,"name":"2019 Chevrolet Trax recall","slug":"2019-chevrolet-trax-recall"},{"id":1615,"name":"Buick airbag","slug":"buick-airbag"},{"id":1593,"name":"Chevrolet airbag","slug":"chevrolet-airbag"}],"categories":[{"id":27,"name":"Buick","slug":"buick-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2021/08/Buick-Logo.png"},{"id":12,"name":"Chevrolet","slug":"chevrolet-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/chevy_ms.png"}]},{"id":16265,"title":"Ford Recalls 215 Previously Recalled Vehicles for Potential Air Bag Malfunction","link":"https://www.motorsafety.org/ford-recalls-215-previously-recalled-vehicles-for-potential-air-bag-malfunction/","status":"publish","slug":"ford-recalls-215-previously-recalled-vehicles-for-potential-air-bag-malfunction","excerpt":"<p>Ford Motor Company (Ford) is recalling certain 2010 Ford Fusion, Mercury Milan and 2010-2012 Lincoln MKZ vehicles that previously received a replacement passenger air bag under previous recalls.</p>\n","description":"<p>Laguna Hills, CA – November 27, 2018 – Ford Motor Company (Ford) is recalling certain 2010 Ford Fusion, Mercury Milan and 2010-2012 Lincoln MKZ vehicles that previously received a replacement passenger air bag under recalls 16V-384, 17V-024 or 18V-046. The potential number of units affected is 215.</p>\n<h3>The Defect</h3>\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V775-6317.pdf\">NHTSA Recall Safety Report,</a>&nbsp;in the event of a crash requiring deployment of the passenger air bag, the bracket that secures the air bag inflator to the module housing may deform, allowing the gas that inflates the air bag to leak out. If the air bag does not inflate properly, there is an increased risk of injury in the event of a crash. All affected vehicles were previously repaired under safety recalls using passenger airbag module service parts manufactured with stop brackets with an incorrect material thickness. Ford identified the affected vehicle population by monitoring warranty repairs using its warranty system to identify vehicles repaired with a specific part number that contained incorrect material thickness stop brackets, and issued the subsequent recall for those vehicles alone, as the issue had been fixed at manufacturing level for subsequent builds.</p>\n<h3>Timeline of Events</h3>\n<p>For production validation (PV) testing, the supplier used a stop plate component that did not follow the proper production part approval process (PPAP) and was thicker than the specified material thickness. This resulted in a &#8220;false positive&#8221; validation test. The specified material thickness utilized in production was inadequate to provide expected performance. On October 4, 2018, Joyson Safety Systems (JSS) reported a production validation test failure while validating parts on a new production line at their Monclova plant on an airbag module produced as a service part for the 2010 through 2012 model year Fusion/Milan/MKZ vehicles.</p>\n<p>On October 8, 2018, JSS observed a Lot Acceptance Test (LAT) failure on the same part produced at their Torreon plant. Parts used for LAT testing were&nbsp; also assembled using an incorrect gage thickness stop plate. JSS halted production of the affected airbag modules and quarantined stock in its control. Investigation of the test failures identified that a stop plate utilized in the module assembly provided insufficient support during airbag deployment. This defect was declared to be an issue, potentially resulting in inflation gas leakage and incomplete airbag cushion inflation in the event of a crash. The subsequent investigation of the PV and LAT test failures further identified that PV testing for the initial production line at the Torreon facility was performed using similar stop plates produced with an incorrect material thickness.</p>\n<p>On October 16, 2018, the PV and LAT test failures were brought into Ford&#8217;s Critical Concerns Review Group, and on October 25, 2018, Ford&#8217;s Field Review Committee reviewed the concern and approved a field action.</p>\n<h3>The Solution</h3>\n<p>Ford will notify owners, and dealers will replace the passenger air bag module, free of charge. The recall is expected to begin in late November 2018. Owners may contact Ford customer service at 1-866-436-7332. Ford&#8217;s number for this recall is 18S34. Owners will be notified by mail and instructed to take their vehicle to a Ford or Lincoln dealer to have the vehicle&#8217;s passenger airbag module replaced. There will be no charge for this service. Owners may also call the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153). The NHTSA Campaign Number for this recall is 18V-775.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16265","createdAt":"2018-11-27T07:45:55.000Z","date_gmt":"2018-11-27T21:30:55.000Z","updatedAt":"2021-01-04T10:41:13.000Z","modified_gmt":"2021-01-05T00:26:13.000Z","display_date":"November 27, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":"","meta_title":"","meta_description":"","meta_keywords":"","custom_schema":""},"year":2018,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/11/white-Ford-2019-Lincoln-768x432.jpg","alt_text":"","cld_public_id":"white-Ford-2019-Lincoln","category":{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"},"tags":[],"categories":[{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"},{"id":26,"name":"Lincoln","slug":"lincoln-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/lincoln_RM.png"},{"id":42,"name":"Mercury","slug":"mercury-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mercury.png"}]},{"id":16257,"title":"Kia Motors Recalls Nearly 2,000 Forte Vehicles Due to Incorrect Headlamp Aiming","link":"https://www.motorsafety.org/kia-motors-recalls-nearly-2000-forte-vehicles-due-to-incorrect-headlamp-aiming/","status":"publish","slug":"kia-motors-recalls-nearly-2000-forte-vehicles-due-to-incorrect-headlamp-aiming","excerpt":"<p>Kia Motors America (Kia) is recalling certain 2019 Kia Forte vehicles equipped with LED headlamps due to incorrect aiming of the headlamp beam.</p>\n","description":"<p>Laguna Hills, CA – November 27, 2018 – Kia Motors America (Kia) is recalling certain 2019 Kia Forte vehicles equipped with LED headlamps due to incorrect aiming of the headlamp beam. The potential number of units affected is 1,754.</p>\n<h2>The Defect</h2>\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V771-1196.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">NHTSA Recall Safety Report</a>, the headlamps on affected vehicles may not have been manufactured with the correct low beam aiming. The LED headlamps may not have been produced by the supplier with the proper low-beam lamp aiming, resulting in a potential leftward deviation in low-beam lamp aiming. Insufficient illumination of the roadway caused by improperly aimed headlamps may result in the driver having reduced visibility, which can increase the risk of a crash.</p>\n<h2>Timeline of Events</h2>\n<p>During normal quality check of production process on July 27, 2018,  Kia Motors Mexico (&#8220;KMM&#8221;) identified an LED headlamp with a leftward deviation in low-beam lamp aiming during production. KMM notified the supplier of the issue.</p>\n<p>Between July 28 – August 15, 2018, the supplier conducted an internal evaluation relating to improper low-beam lamp aiming with the LED headlamps, and identified the Master Headlamp used on the production line for headlamp aiming adjustment purposes as being not accurately adjusted. The supplier began use of a properly-adjusted Master Headlamp beginning on August 15, 2018.</p>\n<p>Between August 16 – September 10, 2018, KMM conducted field monitoring and found no customer complaints. Between September 11 – October 8, 2018, KMM requested Kia Motors America, Inc. (&#8220;KMA&#8221;) to inspect KMA&#8217;s port stock vehicles, and subsequently, the potential aiming issue was confirmed and KMA advised Kia Motors Corporation (&#8220;KMC&#8221;) of inspection results.</p>\n<p>Between October 9 – October 23, 2018, KMC and supplier conducted further review and confirmatory testing to determine the existence of potential non-compliance issue, and on October 24, 2018, KMC made the decision to conduct a non-compliance recall although no customer complaints have been registered and there have been no reported accidents or injuries.</p>\n<h2>The Solution</h2>\n<p>The recalled parts are the LED headlamps, Part Number 92101-M7200 and 92102-M7200. All owners of the subject vehicles will be notified by first class mail with instructions to bring their vehicles to a Kia dealer. Kia will instruct dealers to inspect the headlamps and, if headlamp aiming is out of spec, replace the headlamp(s), free of charge. Kia will reimburse owners for repair expenses already incurred if necessary. Owners may contact Kia customer service at 1-800-333-4542. Kia&#8217;s number for this recall is SC171. Owners may also call the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153). The NHTSA Campaign Number for this recall is 18V-771.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16257","createdAt":"2018-11-27T07:45:52.000Z","date_gmt":"2018-11-27T21:30:52.000Z","updatedAt":"2020-10-22T03:23:34.000Z","modified_gmt":"2020-10-22T17:08:34.000Z","display_date":"November 27, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"18V771000","recall_date":"October 31, 2018"},"year":2018,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/11/Red-2019-Kia-Forte-768x512.jpg","alt_text":"","cld_public_id":"Red-2019-Kia-Forte","category":{"id":32,"name":"Kia","slug":"kia-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/kia_RM.png"},"tags":[{"id":1616,"name":"2019 Kia Forte recall","slug":"2019-kia-forte-recall"},{"id":1617,"name":"Kia headlight recall","slug":"kia-headlight-recall"}],"categories":[{"id":32,"name":"Kia","slug":"kia-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/kia_RM.png"}]},{"id":16259,"title":"Suzuki Recalls More Than 20,000 Kizashi Vehicles for Potential Fuel Tank Cracking","link":"https://www.motorsafety.org/suzuki-recalls-more-than-20000-kizashi-vehicles-for-potential-fuel-tank-cracking/","status":"publish","slug":"suzuki-recalls-more-than-20000-kizashi-vehicles-for-potential-fuel-tank-cracking","excerpt":"<p>Suzuki Motor of America, Inc. (Suzuki) is recalling certain 2010-2013 Suzuki Kizashi vehicles, due to potential fuel tank cracking caused by fine sand accumulation when driving on rough roads.</p>\n","description":"<p>Laguna Hills, CA – November 24, 2018 – Suzuki Motor of America, Inc. (Suzuki) is recalling certain 2010-2013 Suzuki Kizashi vehicles, due to potential fuel tank cracking. The potential number of units affected is 21,052.</p>\n<h2>The Defect</h2>\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V769-5478.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">NHTSA Recall Safety Report</a>, when driving on very dusty roads, a large amount of dust can enter the vent line that provides fresh air to the carbon canister, causing a restriction in the vent line. If this occurs, air flow through the evaporative system may be impacted such that excessive negative pressure is created in the fuel tank. This can cause deformation of the fuel tank, which can lead to fuel tank cracks.  If the fuel tank becomes cracked, fuel leakage and venting of gasoline vapors can occur, increasing the risk of a fire. Drivers may have some warning a crack has occurred; when the fuel tank becomes cracked, a pressure sensor will detect fuel vapor leakage and will illuminate the Malfunction Indicator Lamp (MIL), alerting the driver to seek corrective action.</p>\n<h2>Timeline of Events</h2>\n<p>In February, 2016, SMC received one Field Technical Information Report (FTIR) from Suzuki Motor of America, Inc. (SMAI) concerning fuel odor from a Suzuki Kizashi vehicle due to a fuel tank crack. A second FTIR was received from SMAI concerning Malfunction Indicator Lamp (MIL) illumination in a Suzuki Kizashi vehicle. Both incidents occurred in Wichita, Kansas. SMC&#8217;s investigation revealed that sand had accumulated in the carbon canister filter and carbon canister. SMC was unable to find the route of sand entry or the root cause of the problem.</p>\n<p>From March to June, 2016 SMC installed collected parts on a test vehicle and measured internal fuel tank pressure changes using simulated driving modes, and conducted a fuel tank durability test to determine that the fuel tank crack occurred at about 34,000 miles, but also showed that 125,000 miles of driving was needed to replicate the sand accumulation seen in the incident vehicles.</p>\n<p>Subsequent reports, most from Wichita, led SMC to determine that an investigation at a test site in Wichita was necessary, because the sand accumulation in SMC&#8217;s &#8220;Dust Road Test&#8221; did not correspond with the sand accumulation in incident vehicles. In April, 2018 SMC operated test vehicles in Wichita to evaluate the sand accumulation volume in the canister filter and checked customer vehicles selected at random and judged that the problem of filter clogging was due to driving on rough roads with fine dust like sand.</p>\n<p>From June to July, 2018, SMC studied computer simulations to find the route of sand entry and noticed that the volume of sand entering this area could be reduced by plugging space between the rear fender lining and the wheel housing. SMC decided to make trial parts to cover this space and to conduct further testing in the U.S. which subsequently found that the very fine sand could pass through the rear fender lining made of non-woven fabric. On October 25, 2018 SMC reported the identified problem as a safety-related defect, even though the reported incidents were clustered around discrete geographical areas and there remain no clear indications of the root cause or an appropriate remedy.</p>\n<h2>The Solution</h2>\n<p>The remedy for this recall is still under development. The manufacturer has not yet provided a notification schedule. Owners may contact Suzuki customer service at 1-800-934-0934. Owners may also call the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153). The NHTSA Campaign Number for this recall is 18V-769.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16259","createdAt":"2018-11-24T07:40:30.000Z","date_gmt":"2018-11-24T21:25:30.000Z","updatedAt":"2020-10-28T03:12:43.000Z","modified_gmt":"2020-10-28T16:57:43.000Z","display_date":"November 24, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"18V769000","recall_date":"October 31, 2018"},"year":2018,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/11/2016-grey-Suzuki-Ciaz-768x508.jpg","alt_text":"","cld_public_id":"2016-grey-Suzuki-Ciaz","category":{"id":28,"name":"Suzuki","slug":"suzuki-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/suzuki-logo.png"},"tags":[{"id":1800,"name":"2010-2013 Suzuki Kizashi recall","slug":"2010-2013-suzuki-kizashi-recall"},{"id":1801,"name":"Suzuki fuel tank crack","slug":"suzuki-fuel-tank-crack"}],"categories":[{"id":28,"name":"Suzuki","slug":"suzuki-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/suzuki-logo.png"}]},{"id":16245,"title":"Subaru Recalls More Than 160,000 Vehicles for Weak Engine Valve Springs","link":"https://www.motorsafety.org/subaru-recalls-more-than-160000-vehicles-for-weak-engine-valve-springs/","status":"publish","slug":"subaru-recalls-more-than-160000-vehicles-for-weak-engine-valve-springs","excerpt":"<p>Subaru of America, Inc. (Subaru) is recalling certain 2012-2014 Subaru Impreza, 2012-2013 Impreza Stationwagon, 2013 Subaru BRZ, XV Crosstrek and Toyota Scion FR-S vehicles for a valve spring issue that could cause engine stall.</p>\n","description":"<p>Laguna Hills, CA – November 13, 2018 – Subaru of America, Inc. (Subaru) is recalling certain 2012-2014 Subaru Impreza, 2012-2013 Impreza Stationwagon, 2013 Subaru BRZ, XV Crosstrek and Toyota Scion FR-S vehicles for a valve spring issue that could cause engine stall. This recall is expected to affect 165,534 Subaru vehicles in North America.</p>\n<p><strong>The Defect</strong></p>\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V772-5413.pdf\">NHTSA Recall Safety Report</a>, due to an improper design of the valve train within the engine, an excessive stress is generated on the valve spring compared to the design condition. In addition, a very small amount of the impurity within the composition of the spring material is not avoidable in the manufacturing process. The combination of excessive stress and the dispersion of the impurity in the valve material during manufacturing may cause the valve springs located inside the engine of the affected vehicles may fracture, which may cause engine malfunction. In the worst case, the engine may stall during driving, and restarting will not be possible, increasing the risk of a crash.&nbsp; Drivers may have a short window of advance warning as abnormal noise or vibration may occur prior to the engine stalling.</p>\n<p><strong>Timeline of Events</strong></p>\n<p>In April of 2012, SUBARU CORPORATION (Subaru) received a technical report from the Japan market which described an abnormal noise and rough idling. The collected engine was examined, and it was surmised that the valve spring broke and fell off, making contact with the piston and causing a rough idling and an abnormal noise. While a component analysis was conducted, no spring material flaw was identified and the cause of the fracture was unknown. In May 2013, the lower limit of the tolerance of the spring wire diameter was raised as a precaution and in response to eleven technical reports related to stalling reported from the U.S. In August 2016, based on additional examinations of engines collected from the field, it was determined that a ndactor not avoidable in the manufacturing process, namely very small amount of impurity within the composition of the spring material, could affect spring fracture.</p>\n<p>Three additional technical reports related to stalling were issued from the U.S. during this time frame, but by September 2018 it was determined that a higher occurrence rate than estimated with general manufacturing dispersion from the vehicle manufactured with lower spring tolerance. Further investigation led to the revelation due to the improper design of the valve train, stress generated exceeded the design condition, and, when combined with the dispersion of impurity within the composition of the spring material, could cause spring fracture due to fatigue. On Oct 25, 2018, Subaru issued a safety recall for vehicles equipped with a similar valve train design manufactured prior to the tolerance adjustments made in May 2013.</p>\n<p><strong>The Solution</strong></p>\n<p>Subaru will notify owners, and all valve springs will be replaced with new ones free of charge. Owner notification will occur within 60 days of Dealer notification, which began on November 1. If parts are not available by that time, owners will be notified that parts are not available yet and they will be re-notified once parts are available. Owners may also call the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153). The NHTSA Campaign Number for this recall is 18V-772.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16245","createdAt":"2018-11-13T07:40:27.000Z","date_gmt":"2018-11-13T21:25:27.000Z","updatedAt":"2021-01-04T10:37:30.000Z","modified_gmt":"2021-01-05T00:22:30.000Z","display_date":"November 13, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":"","meta_title":"","meta_description":"","meta_keywords":"","custom_schema":""},"year":2018,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/11/blue-Subaru-STI-2003-768x512.jpg","alt_text":"","cld_public_id":"blue-Subaru-STI-2003","category":{"id":169,"name":"Scion","slug":"scion-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/scion_RM.png"},"tags":[],"categories":[{"id":169,"name":"Scion","slug":"scion-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/scion_RM.png"},{"id":24,"name":"Subaru","slug":"subaru-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/subaru_ms.png"},{"id":17,"name":"Toyota","slug":"toyota-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/toyota_ms.png"}]},{"id":16239,"title":"Subaru Recalls More Than 200,000 Vehicles for Faulty Fuel Indicator","link":"https://www.motorsafety.org/subaru-recalls-more-than-200000-vehicles-for-faulty-fuel-indicator/","status":"publish","slug":"subaru-recalls-more-than-200000-vehicles-for-faulty-fuel-indicator","excerpt":"<p>Subaru of America, Inc. (Subaru) is recalling certain 2018 Subaru Legacy and Outback vehicles due to a software issues that affects the vehicle’s fuel display.</p>\n","description":"<p>Laguna Hills, CA – November 12, 2018 – Subaru of America, Inc. (Subaru) is recalling certain 2018 Subaru Legacy and Outback vehicles due to a software issues that affects the vehicle&#8217;s fuel display. This recall is expected to affect 228,648 Subaru vehicles in North America.</p>\n<h3>The Defect</h3>\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V773-5451.PDF\">NHTSA Recall Safety Report</a>, due to a software error, the low fuel warning light may not light up to indicate the intended remaining fuel level and the distance-to-empty (DTE) display may incorrectly indicate a positive number even if the fuel tank is empty. This inaccuracy in the fuel display may cause a driver to unexpectedly run out of fuel and the vehicle to stall, increasing the risk of a crash.</p>\n<h3>Timeline of Events</h3>\n<p>In December of 2017, SUBARU CORPORATION (Subaru) received a technical report regarding the driving range indicator (DTE) in the multi-information display. The report indicated a positive distance-to-empty (DTE) when no usable fuel was remaining. A field part collection was requested, and between December 2017 and March 2018 p arts were collected from the field and sent to the supplier for an investigation which subsequently took place during April and June of 2018. In July 2018, the supplier submitted the investigation report to Subaru, whereupon, from August to October 2018, Subaru assessed their field data and the supplier&#8217;s investigation report to assess risk. On October 25, 2018, Subaru completed the investigation and determined that a voluntary safety recall should be ordered.</p>\n<h3>The Solution</h3>\n<p>Subaru will notify owners, and dealers will reprogram the combination meter software, free of charge. The manufacturer has not yet provided a notification schedule. Owners may contact Subaru customer service at 1-844-373-6614. Subaru&#8217;s number for this recall is WTW-82. Owners may also call the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153). The NHTSA Campaign Number for this recall is 18V-773.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16239","createdAt":"2018-11-12T07:40:23.000Z","date_gmt":"2018-11-12T21:25:23.000Z","updatedAt":"2020-10-01T12:16:52.000Z","modified_gmt":"2020-10-02T02:01:52.000Z","display_date":"November 12, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2018,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/11/White-2014-Car-Subaru-Legacy-768x512.jpg","alt_text":"","cld_public_id":"White-2014-Car-Subaru-Legacy","category":{"id":24,"name":"Subaru","slug":"subaru-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/subaru_ms.png"},"tags":[],"categories":[{"id":24,"name":"Subaru","slug":"subaru-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/subaru_ms.png"}]},{"id":16236,"title":"Big Ford Recall – What to do if your Engine Stalls","link":"https://www.motorsafety.org/big-ford-recall-what-to-do-if-your-engine-stalls/","status":"publish","slug":"big-ford-recall-what-to-do-if-your-engine-stalls","excerpt":"<p>Risk: Sudden engine stalling, unexpectedly running out of gas Ford recalled 1.3 million Ford Focus cars because fuel system valves can get stuck open, causing cars to suddenly stall, fail to re-start and/or unexpectedly run out of gas increasing the risk of crashing. You may see warning lights. CAR STALLING OR ACTING LIKE IT MIGHT?</p>\n","description":"<h2><span style=\"color: #808080;\"><em>Risk: Sudden engine stalling, unexpectedly running out of gas</em></span></h2>\n<p>Ford recalled 1.3 million Ford Focus cars because fuel system valves can get stuck open, causing cars to suddenly stall, fail to re-start and/or unexpectedly run out of gas increasing the risk of crashing. You may see warning lights.</p>\n<p><span style=\"color: #28a5de;\"><strong>CAR STALLING OR ACTING LIKE IT MIGHT? DO THIS:</strong></span></p>\n<ul>\n<li>First clue? As soon as you sense trouble, hit your turn signal and make your way to the shoulder. Don’t wait for a complete stall out.</li>\n<li>No power? Turn on your flashers and call 911. Don’t try to drift to the side of the road unless you have enough momentum and clear lanes to get there. You don’t want to block two lanes!</li>\n<li>Panic? Yep, people do. But you are going to think straight: check for oncoming traffic, use your turn signal and get over</li>\n<li>Safe Side? Right side is best! But if you are stalling and in the left lane, exit left</li>\n<li>Sit Tight? YES. Stay IN the car, ensure your seatbelt is on. Lookie Loo’s often drift in the direction they’re looking.</li>\n<li>Roadside Rear-ender? Happens all the time. If you can, place your car in neutral to reduce impact energy if someone smashes into you</li>\n<li>Can you get it Fixed Free? Yes, if it’s under recall you can! Find out by checking <a href=\"https://www.motorsafety.org/\" target=\"_blank\" rel=\"noopener noreferrer\">Motorsafety.org</a>. And guys? If your car is under recall, for Pete’s sake — get it fixed! Industry: <a href=\"https://www.recallmasters.com/\" target=\"_blank\" rel=\"noopener noreferrer\">RecallMasters.com</a> Consumers: <a href=\"https://www.motorsafety.org/\" target=\"_blank\" rel=\"noopener noreferrer\">MotorSafety.org</a></li>\n</ul>\n<p><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16236","createdAt":"2018-11-09T07:29:24.000Z","date_gmt":"2018-11-09T21:14:24.000Z","updatedAt":"2020-10-01T12:18:39.000Z","modified_gmt":"2020-10-02T02:03:39.000Z","display_date":"November 09, 2018","sticky":false,"recall":true,"authors":[{"id":18,"name":"Sandra Thomas","slug":"sthomas"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2018,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/11/Blue-ford-Focus-RS-model-768x512.jpg","alt_text":"","cld_public_id":"Blue-ford-Focus-RS-model","category":null,"tags":[],"categories":[]},{"id":16210,"title":"BMW Recalls nearly 45,000 Vehicles Due to a Potential Coolant Leak","link":"https://www.motorsafety.org/bmw-recalls-nearly-45000-vehicles-due-to-a-potential-coolant-leak/","status":"publish","slug":"bmw-recalls-nearly-45000-vehicles-due-to-a-potential-coolant-leak","excerpt":"<p>BMW of North America, LLC (BMW) is recalling certain 2013-2018 BMW vehicles equipped with an Exhaust Gas Recirculation (EGR) module with an integrated cooler, due to a potential leak.</p>\n","description":"<p><i><span style=\"font-weight: 400;\">Laguna Hills, CA – November 7, 2018</span></i><span style=\"font-weight: 400;\"> – BMW of North America, LLC </span><a href=\"https://www.motorsafety.org/bmw-recalls-vehicles-for-second-time-over-fire-risk/\"><span style=\"font-weight: 400;\">(BMW) is recalling certain models over fire risk</span></a><span style=\"font-weight: 400;\">. These vehicles are equipped with an Exhaust Gas Recirculation (EGR) module with an integrated cooler. If the EGR cooler leaks internally, the coolant can mix with diesel engine soot. The high EGR temperatures may result in these particles possibly smoldering and melting the intake manifold, which can increase the risk of a fire.</span></p>\n<p><span style=\"font-weight: 400;\">Included in this recall are: </span><b></b></p>\n<ul>\n<li aria-level=\"1\"><b>2013-2018 BMW 328d and 328d xDrive </b></li>\n</ul>\n<ul>\n<li aria-level=\"1\"><b>2014-2018 BMW 328d Sports Wagon and 328d xDrive Sports Wagon</b></li>\n</ul>\n<ul>\n<li aria-level=\"1\"><b>2014-2016 BMW 535d and 535d xDrive</b></li>\n</ul>\n<ul>\n<li aria-level=\"1\"><b>2015 BMW 740Ld xDrive</b></li>\n</ul>\n<ul>\n<li aria-level=\"1\"><b>2015-2017 BMW  X3 xDrive28d SAV </b></li>\n</ul>\n<ul>\n<li aria-level=\"1\"><b>2014-2017 BMW X5 xDrive35d SAV </b></li>\n</ul>\n<h3><b>The Defect</b></h3>\n<p><span style=\"font-weight: 400;\">According to the NHTSA Recall Safety Report, approximately </span><a href=\"https://www.consumerreports.org/car-recalls-defects/bmw-recalls-cars-and-suvs-due-to-fire-risk-a7622678572/\"><span style=\"font-weight: 400;\">12,781 Model Year 2013-2018 BMW 328d and 328d xDrive Diesel engine vehicles were equipped with an Exhaust Gas Recirculation (EGR) module</span></a><span style=\"font-weight: 400;\"> that featured an integrated cooling component (&#8220;cooler&#8221;). Over time, this component could start to internally leak glycol coolant, because the recall component was not produced with sufficient long-term durability characteristics. During vehicle operation, if an internal coolant leak began inside the EGR cooler, the fluid could mix with normal diesel engine soot/sediment. This combination in the engine environment with high temperatures normally present might result in smoldering particles, which in very rare cases could lead to the melting of the intake manifold. In extreme cases, this could result in a possible fire. During vehicle operation, the driver may be alerted to this condition by one or more of the following: A warning symbol in the instrument cluster displaying a loss of engine coolant, a reduction in engine power, an unpleasant odor (exhaust gas), an unusual noise from the engine compartment, and/or smoke from the engine compartment.</span></p>\n<h3><b>Timeline of Events</b></h3>\n<p><span style=\"font-weight: 400;\">On July 26, 2018, BMW submitted the required Part 579 report, to which NHTSA assigned &#8220;18F-137&#8221; as the Foreign Recall ID after BMW became aware of an issue in the Korean market. On September 5, 2018, BMW met with NHTSA to explain EGR system differences between vehicles in the U.S. market and vehicles in other markets. BMW provided a summary of U.S. field data including warranty claims, consumer complaints, and field reports which indicated coolant leak warnings, drivability concerns, or damage to the intake manifold. BMW also stated that it would continue to closely monitor the field. In October 2018, further in-depth analyses indicated that it was possible that one incident could be attributed to this issue. BMW decided to conduct a voluntary safety recall although at the time of the report, BMW was unaware of any accidents or injuries related to this issue.</span></p>\n<h3><b>The Solution</b></h3>\n<p><span style=\"font-weight: 400;\">Owners will be notified by First Class mail and instructed to take their vehicle to an authorized BMW center to have the remedy performed at no cost. The EGR cooler will be inspected and, if necessary, replaced free of charge. If it is determined that the EGR cooler has internally leaked, the engine intake manifold will also be replaced. The EGR pipe connecting the cooler to the manifold will be cleaned. Owners who have replaced the EGR cooler at their own expense prior to the recall notification may be eligible for reimbursement according to BMW Group&#8217;s reimbursement plan. Notification to owners is planned to begin and end on December 17, 2018. Owners may also call the </span><a href=\"https://one.nhtsa.gov/About-NHTSA/NHTSA-Contact-Information\"><span style=\"font-weight: 400;\">National Highway Traffic Safety Administration Vehicle Safety Hotline </span></a><span style=\"font-weight: 400;\">at 1-888-327-4236 (TTY 1-800-424-9153). The NHTSA Campaign Number for this recall is 18V-755.</span></p>\n<h3><b>Other BMW Recalls </b></h3>\n<p><span style=\"font-weight: 400;\">Some of these vehicles may have been a part of a recall in August of 2021, when</span><a href=\"https://www.motorsafety.org/bmw-recalls-vehicles-over-a-risk-of-engine-stalling/\"><span style=\"font-weight: 400;\"> BMW recalled vehicles over a risk of engine stalling</span><span style=\"font-weight: 400;\"> caused by a high-pressure fuel pump that suffers from excessive wear</span></a><span style=\"font-weight: 400;\">. In addition, even vehicles with gasoline engines, such as the 328i station wagon, had problems with their fuel pumps in the past.  </span></p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>2014 – 2018 BMW 328D</b></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>2015 – 2017 BMW X3</b></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>2014 – 2016 BMW 535D</b></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>2014 – 2018 BMW X5 </b></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>2015 BMW 740LD</b></li>\n</ul>\n<p><span style=\"font-weight: 400;\">The affected component in this recall is the BMW high-pressure fuel pump with part number 7810696 and 7283473</span></p>\n<h3><b>Is your vehicle a part of this recall?</b></h3>\n<p><span style=\"font-weight: 400;\">This BMW recall includes more than 11,000 vehicles. To check for this and other BMW recalls, use </span><a href=\"https://www.motorsafety.org/\"><span style=\"font-weight: 400;\">MotorSafety’s free vehicle lookup tool</span></a><span style=\"font-weight: 400;\">.</span></p>\n","source":"https://www.motorsafety.org/?p=16210","createdAt":"2018-11-07T09:58:42.000Z","date_gmt":"2018-11-07T23:43:42.000Z","updatedAt":"2022-03-03T09:37:06.000Z","modified_gmt":"2022-03-03T23:22:06.000Z","display_date":"November 07, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":"","meta_title":"BMW Recalls - 2014 BMW 328d Recalls - EGR Cooler Leaks","meta_description":"BMW Recalls several vehicles including the 2013-2018 BMW 328d and 328d xDrive due to an internal EGR cooler leak that could increase the risk of a fire.","meta_keywords":"BMW Recalls, 2014 BMW 328d Recalls, 2013 BMW 328d xDrive, egr cooler leak bmw, 2014 bmw 328d problems, bmw 328d egr recall.","custom_schema":""},"year":2018,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/11/Blue-2019-BMW-X5-768x512.jpg","alt_text":"","cld_public_id":"Blue-2019-BMW-X5","category":{"id":15,"name":"BMW","slug":"bmw-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/bmw_RM.png"},"tags":[],"categories":[{"id":15,"name":"BMW","slug":"bmw-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/bmw_RM.png"}]},{"id":16328,"title":"Porsche Cayenne Recall Issued Over Seat Belt Buckles","link":"https://www.motorsafety.org/porsche-cayenne-recall-issued-over-seat-belt-buckles/","status":"publish","slug":"porsche-cayenne-recall-issued-over-seat-belt-buckles","excerpt":"","description":"<div class=\"video-wrapper feature-video\"><iframe src=\"https://player.vimeo.com/video/307152596?app_id=122963\" width=\"1170\" height=\"658\" frameborder=\"0\" title=\"Porsche Cayenne Recall Issued Over Seat Belt Buckles\" allow=\"autoplay; fullscreen\" allowfullscreen></iframe></div>\n<p><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16328","createdAt":"2018-11-07T08:40:36.000Z","date_gmt":"2018-11-07T22:25:36.000Z","updatedAt":"2020-10-22T03:26:23.000Z","modified_gmt":"2020-10-22T17:11:23.000Z","display_date":"November 07, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2018,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/11/black-2020-Porsche-Cayenne-768x512.jpg","alt_text":"","cld_public_id":"black-2020-Porsche-Cayenne","category":null,"tags":[],"categories":[]},{"id":16435,"title":"2017-2019 Toyota 4Runner: Recall Alert","link":"https://www.motorsafety.org/2017-2019-toyota-4runner-recall-alert/","status":"publish","slug":"2017-2019-toyota-4runner-recall-alert","excerpt":"<p>2017-2019 Toyota 4Runner: Recall Alert Vehicles Affected:&nbsp;Approximately 1,300 model-year 2017-19 Toyota 4Runner SUVs that Southeast Toyota Distributors equipped with a TRD wheel package The Problem:&nbsp;The gross vehicle weight rating on the certification label may be incorrect, possibly resulting in the vehicle being overloaded and increasing the risk of a crash. The Fix:&nbsp;SET will notify owners</p>\n","description":"<p class=\"article-title\"><a href=\"https://www.cars.com/articles/2017-2019-toyota-4runner-recall-alert-1420703444908/\" target=\"_blank\" rel=\"noopener noreferrer\">2017-2019 Toyota 4Runner: Recall Alert</a></p>\n<div class=\"article-byline\">\n<p><strong><a href=\"https://www.cars.com/articles/2017-2019-toyota-4runner-recall-alert-1420703444908/\" target=\"_blank\" rel=\"noopener noreferrer\"><img loading=\"lazy\" class=\"alignleft\" src=\"https://www.cstatic-images.com/stock/1170x1170/45/img895624678-1541520558945.jpg\" alt=\"\" width=\"294\" height=\"196\"></a>Vehicles Affected:</strong>&nbsp;Approximately 1,300 model-year 2017-19 Toyota 4Runner SUVs that Southeast Toyota Distributors equipped with a TRD wheel package</p>\n<p><strong>The Problem:</strong>&nbsp;The gross vehicle weight rating on the certification label may be incorrect, possibly resulting in the vehicle being overloaded and increasing the risk of a crash.</p>\n<p><strong>The Fix:</strong>&nbsp;SET will notify owners and mail them corrected certification labels for free&#8230;<a href=\"https://www.cars.com/articles/2017-2019-toyota-4runner-recall-alert-1420703444908/\" target=\"_blank\" rel=\"noopener noreferrer\">Read more on Cars.com</a></p>\n</div>\n<p><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16435","createdAt":"2018-11-06T08:51:51.000Z","date_gmt":"2018-11-06T22:36:51.000Z","updatedAt":"2020-10-01T12:25:11.000Z","modified_gmt":"2020-10-02T02:10:11.000Z","display_date":"November 06, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2018,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/11/Grey-2017-A-Toyota-4Runner-768x512.jpg","alt_text":"","cld_public_id":"Grey-2017-A-Toyota-4Runner","category":{"id":17,"name":"Toyota","slug":"toyota-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/toyota_ms.png"},"tags":[],"categories":[{"id":17,"name":"Toyota","slug":"toyota-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/toyota_ms.png"}]},{"id":16433,"title":"2019 Porsche Cayenne: Recall Alert","link":"https://www.motorsafety.org/2019-porsche-cayenne-recall-alert/","status":"publish","slug":"2019-porsche-cayenne-recall-alert","excerpt":"<p>2019 Porsche Cayenne: Recall Alert Vehicles Affected:&nbsp;Approximately 400 model-year 2019 Porsche Cayenne SUVs The Problem:&nbsp;The passenger-side rear seat belt buckle may break under load, such as in the event of a crash, increasing the risk of injury. The Fix:&nbsp;Dealers will replace the passenger-side rear seat belt buckle for free&#8230;Read more on Cars.com</p>\n","description":"<p class=\"article-title\"><a href=\"https://www.cars.com/articles/2019-porsche-cayenne-recall-alert-1420703445485/\" target=\"_blank\" rel=\"noopener noreferrer\">2019 Porsche Cayenne: Recall Alert</a></p>\n<div class=\"article-byline\">\n<p><a href=\"https://www.cars.com/articles/2019-porsche-cayenne-recall-alert-1420703445485/\"><img loading=\"lazy\" class=\"alignleft\" src=\"https://www.cstatic-images.com/stock/1170x1170/71/img277069168-1541520828471.jpg\" width=\"286\" height=\"190\"></a></p>\n<p><strong>Vehicles Affected:</strong>&nbsp;Approximately 400 model-year 2019 Porsche Cayenne SUVs</p>\n<p><strong>The Problem:</strong>&nbsp;The passenger-side rear seat belt buckle may break under load, such as in the event of a crash, increasing the risk of injury.</p>\n<p><strong>The Fix:</strong>&nbsp;Dealers will replace the passenger-side rear seat belt buckle for free&#8230;<a href=\"https://www.cars.com/articles/2019-porsche-cayenne-recall-alert-1420703445485/\" target=\"_blank\" rel=\"noopener noreferrer\">Read more on Cars.com</a></p>\n</div>\n<p><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16433","createdAt":"2018-11-06T08:48:16.000Z","date_gmt":"2018-11-06T22:33:16.000Z","updatedAt":"2020-10-01T12:25:49.000Z","modified_gmt":"2020-10-02T02:10:49.000Z","display_date":"November 06, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2018,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/11/black-2020-Porsche-Cayenne-768x512.jpg","alt_text":"","cld_public_id":"black-2020-Porsche-Cayenne","category":{"id":25,"name":"Porsche","slug":"porsche-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/porsche.jpg"},"tags":[],"categories":[{"id":25,"name":"Porsche","slug":"porsche-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/porsche.jpg"}]},{"id":16336,"title":"Kia Recalls Vehicles with Defective Wiring Harnesses","link":"https://www.motorsafety.org/kia-recalls-vehicles-with-defective-wiring-harnesses/","status":"publish","slug":"kia-recalls-vehicles-with-defective-wiring-harnesses","excerpt":"","description":"<div class=\"video-wrapper feature-video\"><iframe src=\"https://player.vimeo.com/video/307360720?app_id=122963\" width=\"1170\" height=\"658\" frameborder=\"0\" title=\"Kia Recalls Vehicles with Defective Wiring Harnesses\" allow=\"autoplay; fullscreen\" allowfullscreen></iframe></div>\n<p><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16336","createdAt":"2018-11-06T08:44:03.000Z","date_gmt":"2018-11-06T22:29:03.000Z","updatedAt":"2020-10-22T03:36:44.000Z","modified_gmt":"2020-10-22T17:21:44.000Z","display_date":"November 06, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2018,"month":11,"featured_image":null,"alt_text":"","cld_public_id":null,"category":null,"tags":[],"categories":[]},{"id":16334,"title":"BMW Recalls Vehicles with Defective Exhaust Components","link":"https://www.motorsafety.org/bmw-recalls-vehicles-with-defective-exhaust-components/","status":"publish","slug":"bmw-recalls-vehicles-with-defective-exhaust-components","excerpt":"","description":"<div class=\"video-wrapper feature-video\"><iframe src=\"https://player.vimeo.com/video/307154643?app_id=122963\" width=\"1170\" height=\"658\" frameborder=\"0\" title=\"BMW Recalls Vehicles with Defective Exhaust Components\" allow=\"autoplay; fullscreen\" allowfullscreen></iframe></div>\n<p><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16334","createdAt":"2018-11-06T08:43:06.000Z","date_gmt":"2018-11-06T22:28:06.000Z","updatedAt":"2018-12-19T08:54:24.000Z","modified_gmt":"2018-12-19T22:39:24.000Z","display_date":"November 06, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":null,"nhtsa_campaign_number":null,"recall_date":null,"meta_title":null,"meta_description":null,"meta_keywords":null,"custom_schema":null},"year":2018,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/04/motorsafetylogo_small.png","alt_text":"","cld_public_id":"motorsafetylogo_small","category":{"id":15,"name":"BMW","slug":"bmw-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/bmw_RM.png"},"tags":[],"categories":[{"id":15,"name":"BMW","slug":"bmw-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/bmw_RM.png"}]},{"id":16332,"title":"Toyota Recalls Vehicles with Defective Carrying Capacity Labels","link":"https://www.motorsafety.org/toyota-recalls-vehicles-with-defective-carrying-capacity-labels/","status":"publish","slug":"toyota-recalls-vehicles-with-defective-carrying-capacity-labels","excerpt":"","description":"<div class=\"video-wrapper feature-video\"><iframe src=\"https://player.vimeo.com/video/307154030?app_id=122963\" width=\"1170\" height=\"658\" frameborder=\"0\" title=\"Toyota Recalls Vehicles with Defective Carrying Capacity Labels\" allow=\"autoplay; fullscreen\" allowfullscreen></iframe></div>\n<p><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16332","createdAt":"2018-11-06T08:42:22.000Z","date_gmt":"2018-11-06T22:27:22.000Z","updatedAt":"2018-12-19T08:54:13.000Z","modified_gmt":"2018-12-19T22:39:13.000Z","display_date":"November 06, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":null,"nhtsa_campaign_number":null,"recall_date":null,"meta_title":null,"meta_description":null,"meta_keywords":null,"custom_schema":null},"year":2018,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/04/motorsafetylogo_small.png","alt_text":"","cld_public_id":"motorsafetylogo_small","category":{"id":17,"name":"Toyota","slug":"toyota-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/toyota_ms.png"},"tags":[],"categories":[{"id":17,"name":"Toyota","slug":"toyota-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/toyota_ms.png"}]},{"id":16330,"title":"Kia Stinger Recalled Over Fire Risk","link":"https://www.motorsafety.org/kia-stinger-recalled-over-fire-risk/","status":"publish","slug":"kia-stinger-recalled-over-fire-risk","excerpt":"","description":"<div class=\"video-wrapper feature-video\"><iframe src=\"https://player.vimeo.com/video/307153273?app_id=122963\" width=\"1170\" height=\"658\" frameborder=\"0\" title=\"Kia Stinger Recalled Over Fire Risk\" allow=\"autoplay; fullscreen\" allowfullscreen></iframe></div>\n<p><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16330","createdAt":"2018-11-06T08:41:31.000Z","date_gmt":"2018-11-06T22:26:31.000Z","updatedAt":"2020-10-22T03:37:10.000Z","modified_gmt":"2020-10-22T17:22:10.000Z","display_date":"November 06, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2018,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/04/motorsafetylogo_small.png","alt_text":"","cld_public_id":"motorsafetylogo_small","category":null,"tags":[],"categories":[]},{"id":16212,"title":"Kia Recalls More Than 16,000 Stinger Vehicles for Wiring Harness Issue","link":"https://www.motorsafety.org/kia-recalls-more-than-16000-stinger-vehicles-for-wiring-harness-issue/","status":"publish","slug":"kia-recalls-more-than-16000-stinger-vehicles-for-wiring-harness-issue","excerpt":"<p>Kia Motors America (Kia) is recalling certain 2018 Kia Stinger vehicles for electrical problems relating to a wiring harness. This recall is expected to affect 16011 vehicles in North America.</p>\n","description":"<p>Laguna Hills, CA – November 5, 2018 – Kia Motors America (Kia) is recalling certain 2018 Kia Stinger vehicles for electrical problems relating to a wiring harness. This recall is expected to affect 16011 vehicles in North America.</p>\n<h2>The Defect</h2>\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V754-6966.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">NHTSA Recall Safety Report</a>, the front wiring harness located in the engine and passenger compartment of affected Stinger vehicles may get damaged from contacting a burr on a sheet metal hole on the left fender apron body panel. Such contact can damage the insulation on one or more wires and cause increased electrical short, thereby generating heat. Once sufficient heat is generated, thermal damage may occur to surrounding materials. The damaged wiring harness may then short circuit, increasing the risk of a fire. Owners may or may not be alerted to an issue by illumination of the Malfunction Indicator Light (&#8220;MIL&#8221;) or activation of limp home mode.</p>\n<h2>Timeline of Events</h2>\n<p>On May 3, 2018, Kia Motors America, Inc.&#8217;s (KMA) Consumer Affairs Department was notified by dealer of a fire involving a 2018MY Kia Stinger, which affected other vehicles and a structure. On September 6, 2018, KMA inspected the subject Stinger vehicle and identified the origin of fire to likely have occurred in left rear of engine compartment behind left strut tower and under the left hood hinge support. The potential cause of fire was identified as damage to wiring harness insulation resulting in electrical arcing and/or resistance heating.</p>\n<p>KMA subsequently conducted inspection of Stinger vehicles at the port for any potential front wiring harness damage and found none. KMA was able to identify that stamping direction of the left fender apron body panel was changed on April 5, 2018, and although testing was conducted to evaluate any potential relationship between front wiring harness damage and fire, the incident could not be replicated during testing. A potential for thermal damage was confirmed due to an electrical short caused by damaged wires, however, and in late October, KMC made the decision to conduct a safety recall due to the single fire incident. No injuries were reported.</p>\n<h2>The Solution</h2>\n<p>Kia will notify owners, and dealers will inspect the wiring harness for damage. If no damage is found, a cover will be installed free of charge. If damage is found, the wiring harness will be repaired, and a cover will be installed, free of charge. The recall is expected to begin December 20, 2018. Owners may contact Kia customer service at 1-800-333-4542. Kia&#8217;s number for this recall SC170. Owners may also call the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153). The NHTSA Campaign Number for this recall is 18V-754.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16212","createdAt":"2018-11-05T09:58:39.000Z","date_gmt":"2018-11-05T23:43:39.000Z","updatedAt":"2020-10-22T03:40:16.000Z","modified_gmt":"2020-10-22T17:25:16.000Z","display_date":"November 05, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"18V754000","recall_date":"October 25, 2018"},"year":2018,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/11/2009-KIA-Stinger-GT-3.3-768x513.jpg","alt_text":"","cld_public_id":"2009-KIA-Stinger-GT-3","category":{"id":32,"name":"Kia","slug":"kia-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/kia_RM.png"},"tags":[{"id":1619,"name":"2018 Kia Stinger recall","slug":"2018-kia-stinger-recall"},{"id":1620,"name":"Kia wiring harness issue","slug":"kia-wiring-harness-issue"}],"categories":[{"id":32,"name":"Kia","slug":"kia-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/kia_RM.png"}]},{"id":16196,"title":"Toyota Recalls Nearly 1300 4Runners for Insufficient Cargo Load Capacity","link":"https://www.motorsafety.org/toyota-recalls-nearly-1300-4runners-for-insufficient-cargo-load-capacity/","status":"publish","slug":"toyota-recalls-nearly-1300-4runners-for-insufficient-cargo-load-capacity","excerpt":"<p>Southeast Toyota Distributors, LLC (SET) is recalling certain 2017-2019 Toyota 4Runner vehicles that SET modified to be equipped with a TRD wheel package on which a certification label was incorrect.</p>\n","description":"<p>Laguna Hills, CA – November 2, 2018 – Southeast Toyota Distributors, LLC (SET) is recalling certain 2017-2019 Toyota 4Runner vehicles that SET modified to be equipped with a TRD wheel package on which a certification label was incorrect. This recall is expected to affect 1295 vehicles in North America.</p>\n<h3>The Defect</h3>\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V753-1837.pdf\">NHTSA</a> Recall Safety Report, the Gross Vehicle Weight Rating (GVWR) on the certification label may be incorrect, possibly resulting in the vehicle being overloaded. An overloaded vehicle can increase the risk of a crash.</p>\n<h3>Timeline of Events</h3>\n<p>During a routine data validation audit on in late September 2018, it was discovered that the accessory weight for the TRD Wheel Package was not accurately relayed to the software used to calculate the load carrying capacity modification labels. The TRD Wheel Package is installed by SET at the request of Toyota and is considered standard equipment on the special edition TRD 4Runner from Toyota. However, the TRD Wheel package weight was not included in the final vehicle certification, and should have been included in the load carrying capacity modification label calculation. This led to affected vehicles having the incorrect cargo weight capacity listed and some having a negative cargo carrying capacity.</p>\n<h3>The Solution</h3>\n<p>SET will notify the customers by mail of the noncompliance. An accurate label will be provided to apply over the inaccurate label at no charge. Each label will be customized for the corresponding customer&#8217;s vehicle based on the net weight of the accessories installed. Fifteen (15) vehicles have been identified which cannot be remedied solely with a revised label. They may require an alternate remedy to remain in line with net weight restrictions and allow cargo carrying capacity to shift out of negative. These customers will be contacted separately, and options provided, one of which may be the&nbsp; exchange or upgrade of accessories at no charge to reduce the overall weight and increase cargo carrying load capacity.</p>\n<p>Customers will be notified and arrangements made to provide a suitable remedy. SET expects the mailing of customer notification letters to begin on or about December 24, 2018. Owners may contact SET customer service at 1-866-405-4226. SET&#8217;s number for this recall is SET18A. Owners may also call the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153). The NHTSA Campaign Number for this recall is 18V-753.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16196","createdAt":"2018-11-02T09:10:55.000Z","date_gmt":"2018-11-02T22:55:55.000Z","updatedAt":"2020-10-01T13:12:07.000Z","modified_gmt":"2020-10-02T02:57:07.000Z","display_date":"November 02, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2018,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/11/White-2016-Toyota-4Runner-SUV-768x512.jpg","alt_text":"","cld_public_id":"White-2016-Toyota-4Runner-SUV","category":{"id":17,"name":"Toyota","slug":"toyota-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/toyota_ms.png"},"tags":[],"categories":[{"id":17,"name":"Toyota","slug":"toyota-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/toyota_ms.png"}]},{"id":16198,"title":"Porsche Recalls More Than 400 Cayenne Vehicles for Seat Belt Buckle Fault","link":"https://www.motorsafety.org/porsche-recalls-more-than-400-cayenne-vehicles-for-seat-belt-buckle-fault/","status":"publish","slug":"porsche-recalls-more-than-400-cayenne-vehicles-for-seat-belt-buckle-fault","excerpt":"<p>Porsche Cars North America, Inc. (Porsche) is recalling certain 2019 Porsche Cayenne vehicles for seat belt buckle weaknesses.</p>\n","description":"<p>Laguna Hills, CA – November 1, 2018 – Porsche Cars North America, Inc. (Porsche) is recalling certain 2019 Porsche Cayenne vehicles for seat belt buckle weaknesses. The recall is expected to affect 415 units, which were determined based on information received from the supplier and Porsche AG&#8217;s related production records.</p>\n<h2>The Defect</h2>\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V751-6692.pdf\">NHTSA Recall Safety Report</a>, the rear right seat belt buckle in these vehicles was subject to a manufacturing error and a faulty material batch at the supplier. The buckle is weak and failed to withstand the required breaking load in the tensile test of the belt. The function of the rear right seat belt buckle might fail during a vehicle crash, leading to serious injury or death.</p>\n<h2>Timeline of Events</h2>\n<p>On September 28, 2018 Porsche was informed by the supplier about inadequate test results during the tensile belt test. Immediate analysis revealed a manufacturing error which, when combined with a change of the raw material used at the supplier, caused a significant weakness in the right rear seat belt buckles with the part number 9Y0.857.754. On October 17, 2018, the Porsche AG product safety committee determined that a safety defect existed, and the voluntary safety recall was issued. The original defect was corrected in the production line as of October 1, 2018.</p>\n<h2>The Solution</h2>\n<p>Porsche plans to begin notifying owners and dealers on December 23, 2018. The vehicles will be recalled to the workshop or dealership and an improved rear right seat belt buckle will be installed free of charge, with the component created from use of an optimized manufacturing process and the correct raw material. Owners may contact Porsche customer service at 1-800-767-7243. Porsche&#8217;s number for this recall is AJ09. Owners may also call the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153). The NHTSA Campaign Number for this recall is 18V-751.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16198","createdAt":"2018-11-01T09:09:54.000Z","date_gmt":"2018-11-01T22:54:54.000Z","updatedAt":"2020-10-22T03:33:48.000Z","modified_gmt":"2020-10-22T17:18:48.000Z","display_date":"November 01, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"18V751000","recall_date":"October 24, 2018"},"year":2018,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/11/Black-2019-Porsche-Cayenne-768x512.jpg","alt_text":"","cld_public_id":"Black-2019-Porsche-Cayenne","category":{"id":25,"name":"Porsche","slug":"porsche-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/porsche.jpg"},"tags":[{"id":1478,"name":"2019 Porsche Cayenne recall","slug":"2019-porsche-cayenne-recall"},{"id":1618,"name":"Porsche seatbelt issue","slug":"porsche-seatbelt-issue"}],"categories":[{"id":25,"name":"Porsche","slug":"porsche-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/porsche.jpg"}]}]