[{"id":16047,"title":"Honda Recalls Nearly 1000 Vehicles for Fuel Leak and Fire Risks","link":"https://www.motorsafety.org/honda-recalls-nearly-1000-vehicles-for-fuel-leak-and-fire-risks/","status":"publish","slug":"honda-recalls-nearly-1000-vehicles-for-fuel-leak-and-fire-risks","excerpt":"<p>Honda (American Honda Motor Co.) is recalling certain 2017-2018 Acura NSX vehicles due to a faulty coupler that increases the chance of fuel leaks and engine fire.</p>\n","description":"\n<p><em>Laguna Hills, CA – September 28, 2018</em> – Honda (American Honda Motor Co.) is recalling certain 2017-2018 Acura NSX vehicles due to a faulty coupler that increases the chance of fuel leaks and engine fire.</p>\n\n\n\n<p>The recall population was determined based on manufacturing records. A total 949 units are potentially affected, within a sequential VIN range of 19UNC1B00HY000000 to 19UNC1B00HY000952. The VIN range reflects all possible vehicles that could potentially experience the problem.</p>\n\n\n\n<p>All vehicles built from the start-up of production through March 5, 2018 are affected. Vehicles built after March 5, 2018 are equipped with fuel tanks produced by the supplier after the supplier adjusted its manufacturing process to improve production quality.</p>\n\n\n\n<h2>The defect</h2>\n\n\n\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V600-5832.pdf\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">NHTSA Safety Recall Report,</a> due to an improper manufacturing process, the couplers for the crossover inlet pipe that connects the left and right fuel tanks were insufficiently welded. </p>\n\n\n\n<p>Over time, vibration and heat cycling can cause the couplers to separate from the fuel tank, resulting in fuel leakage. A fuel leak in the presence of an ignition source can increase the risk of a fire.</p>\n\n\n\n<p>According to an <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCRIT-18V600-0013.pdf\">Acura Service Bulletin</a>, drivers or passengers may notice a strong fuel smell if a leak occurs. If this happens, drivers are urged to stop driving their vehicle immediately and contact their nearest Acura dealer for roadside assistance.</p>\n\n\n\n<h2>Timeline of events</h2>\n\n\n\n<p>In December 2017 Honda received a claim of a fuel leak. The failed fuel tank was returned to the supplier. An investigation was launched to determine the root cause of the failure. </p>\n\n\n\n<p>Over the months of February and March 2018, Honda received three additional claims of a fuel leak, and in April 2018 the fuel tank supplier informed Honda that the weld specifications for melt depth and pressed-in amount could not be appropriately controlled and could be the source of the issue.</p>\n\n\n\n<p>Further investigation was conducted to determine what was causing the variation in weld specification and how it was affecting the fuel tanks. </p>\n\n\n\n<p>In May 2018, the investigation confirmed that the heater which was being used to weld the coupler was set at a slight angle. This resulted in insufficient welding and thin welds to certain sections of the fuel tank.</p>\n\n\n\n<p>In August 2018, the fuel tank supplier further informed Honda that the jigs used during fuel tank welding were found to be incapable of properly securing the fuel tanks during the welding process, adding more inconsistency and instability to the welds and resulting in additional welding variations. </p>\n\n\n\n<p>Honda continued their own investigation of the potential consequences of inappropriately welded fuel tanks and sought to determine the precise range of potentially affected vehicles.</p>\n\n\n\n<p>In late August 2018, Honda officially determined that a defect related to motor vehicle safety exists and decided to conduct a safety recall. Honda notified NHTSA of this decision and supplied the information needed. </p>\n\n\n\n<p>As of late August 2018, Honda has only received three warranty claims. There have been no field reports or reports of fires or injuries related to this issue.</p>\n\n\n\n<h2>The solution</h2>\n\n\n\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RMISC-18V600-6203.pdf\">manufacturers statement</a>, Acura is announcing these recalls to encourage owners of affected vehicles to take them to an authorized dealer for repair as soon as they receive notification from Acura. </p>\n\n\n\n<p>Due to the relatively small number of affected vehicles, where possible, Acura will attempt to contact owners by phone to schedule repairs. </p>\n\n\n\n<p>Honda will notify dealers, and dealers will replace the left and right fuel tanks, free of charge. The recall is expected to begin November 6, 2018. </p>\n\n\n\n<p>MotorSafety.org can help you determine whether your vehicle is subject to a government-mandated recall or whether there is some factory notice that you should be informed of. Check your car’s recall status using MotorSafety’s <a href=\"https://www.motorsafety.org/\">free vehicle lookup tool.</a></p>\n\n\n\n<p></p>\n<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script>","source":"https://www.motorsafety.org/?p=16047","createdAt":"2018-09-28T07:57:45.000Z","date_gmt":"2018-09-28T21:42:45.000Z","updatedAt":"2020-10-22T04:10:48.000Z","modified_gmt":"2020-10-22T17:55:48.000Z","display_date":"September 28, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"18V-600","recall_date":"September 7, 2018"},"year":2018,"month":9,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/09/Fire-Risk-Article-2-768x513.jpg","alt_text":"white with black trim 2017-2018 Acura NSX.","cld_public_id":"Fire-Risk-Article-2","category":{"id":34,"name":"Acura","slug":"acura-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/acura.png"},"tags":[{"id":1631,"name":"2017-2018 Acura NSX recall","slug":"2017-2018-acura-nsx-recall"},{"id":1632,"name":"Acura engine fire risk","slug":"acura-engine-fire-risk"},{"id":1633,"name":"NSX engine fire","slug":"nsx-engine-fire"},{"id":1634,"name":"NSX fuel leak","slug":"nsx-fuel-leak"}],"categories":[{"id":34,"name":"Acura","slug":"acura-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/acura.png"}]},{"id":16036,"title":"Ford Recalls Over 50,000 Electric and Hybrid Models Due to Faulty Charging Cords","link":"https://www.motorsafety.org/ford-recalls-over-50000-electric-and-hybrid-models-due-to-faulty-charging-cords/","status":"publish","slug":"ford-recalls-over-50000-electric-and-hybrid-models-due-to-faulty-charging-cords","excerpt":"<p>Ford is issuing a recall for approximately 50,000 120-volt convenience charge cords originally provided with select 2012-15 Ford Focus Electric, 2013-15 Ford Fusion Energi and 2013-15 Ford CMAX Energi vehicles.</p>\n","description":"<p>&nbsp;</p>\n<p>Ford is issuing a recall for approximately 50,000 120-volt convenience charge cords originally provided with select 2012-15 Ford Focus Electric, 2013-15 Ford Fusion Energi and 2013-15 Ford CMAX Energi vehicles.</p>\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RMISC-18V592-5994.pdf\">FORD Media Center</a>, affected vehicles include: 2012-15 Ford Focus Electric vehicles built at Michigan Assembly Plant, Sept. 15, 2011 through March 14, 2015 2013-15 Ford Fusion Energi vehicles built at Hermosillo Assembly Plant, Sept. 4, 2012 through March 5, 2015 2013-15 Ford C-MAX Energi vehicles built at Michigan Assembly Plant, April 13, 2012 through March 14, 2015.<br />\nThere are approximately 50,524 vehicles in North America with accompanying charge cords relating to this concern, with 49,197 vehicles in the United States and its federalized territories and 1,327 in Canada.</p>\n<h3>The Defect</h3>\n<p>The 120V convenience charge cord originally provided with the affected vehicles, when used in combination with a home AC outlet that is not on a dedicated circuit or is damaged, worn or corroded, could become susceptible to increased contact resistance at the convenience charge cord plug and home AC outlet interface.</p>\n<h3>Timeline of Events</h3>\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V592-6340.PDF\">NHTSA Safety Recall Report</a>, in December 2013 and May 2017, Ford&#8217;s Critical Concern Review Group (CCRG) opened investigations on 120V convenience charge cord allegations of heat damage. However,m neither investigation was able to identify a manufacturing or quality defect. Subsequent to the CCRG investigation Ford inspected four fires alleged to involve C-Max vehicles, and although the exact cause of the fires was not determined, it was noted that in three of the four fires, extension cords between the wall outlet and convenience charge cords were identified.</p>\n<p>In June 2018, in response to an NHTSA request,&nbsp; Ford reviewed additional information and subsequently completed an additional comprehensive data review and analysis of vehicles that use the same or similar 120V Convenience charge cords.&nbsp; An elevated rate of melting/ fire reports on 120V Convenience charge cords designed without a thermistor led to an equipment recall, which was upgraded to a vehicle recall in September 2018.</p>\n<p>Ford is aware of some fire reports, and has identified an elevated rate of allegations of melting and fire involving the 120V convenience charge cord that did not include a thermistor. Ford&#8217;s investigation revealed that an increased resistance at the plug/outlet interface was resulting in some cases in increased temperature and could potentially lead to a fire. Incomplete or slow charge cycles, or inability to charge have been identified as early indicators, as well as visible melting damage of the area surrounding the charge cord plug and/or odor.</p>\n<h3>The Solution</h3>\n<p>Owners will be notified by mail and reminded of the requirements for adequate wall outlets, and that extension cords should not be used under any circumstance to charge their vehicles. They will be instructed to take their vehicle to a Ford dealer to have the factory-equipped 120-volt convenience charge cord replaced with the latest version of the 120-volt convenience cord that includes a thermistor, free of charge. The thermistor can identify over-temperature conditions at the plug/outlet interface and will discontinue charging until the temperature decreases to an appropriate level.</p>\n<p>The Ford reference number for this recall is 18S24. Notification to dealers occurred in August 2018. Mailing of owner notification letters occurred in September 2018. Owners may contact Ford customer service at 1-866-436-7332. Owners may also contact the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153).<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16036","createdAt":"2018-09-28T05:42:34.000Z","date_gmt":"2018-09-28T19:27:34.000Z","updatedAt":"2020-10-02T21:51:37.000Z","modified_gmt":"2020-10-03T11:36:37.000Z","display_date":"September 28, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2018,"month":9,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/09/2016-FORD-FUSION-HYBRID-TITANIUM-768x512.jpg","alt_text":"","cld_public_id":"2016-FORD-FUSION-HYBRID-TITANIUM","category":{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"},"tags":[],"categories":[{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"}]},{"id":16049,"title":"Bentley Recalls Small Batch of Mulsanne Vehicles for Backover Prevention Software Issue","link":"https://www.motorsafety.org/bentley-recalls-small-batch-of-mulsanne-vehicles-for-backover-prevention-software-issue/","status":"publish","slug":"bentley-recalls-small-batch-of-mulsanne-vehicles-for-backover-prevention-software-issue","excerpt":"<p>Bentley Motors, Inc. (Bentley) is recalling certain 2018 Bentley Mulsanne vehicles for issues with rearview camera software, affecting backover prevention.</p>\n","description":"\n<p><em>Lilburn, Georgia – September 26, 2018</em> – Bentley Motors, Inc. (Bentley) is recalling certain 2018 Bentley Mulsanne vehicles for issues with rear-view camera software, affecting backover prevention. The recall is expected to only include 10 units of the luxury sedan.&nbsp; </p>\n\n\n\n<p>The recall population was determined based upon system records confirming which vehicles received incorrect system software during vehicle production, and any vehicles not included in this recall were produced with correct system software.</p>\n\n\n\n<h2><strong>The defect</strong></h2>\n\n\n\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V632-8240.PDF\">NHTSA Safety Recall Report</a>, when reverse gear is selected by the driver, the rear camera view may be obstructed on the screen with other icons or may not be fully visible within 2 seconds. </p>\n\n\n\n<p>If the full camera view is delayed or obstructed and the driver does not check their surroundings before reversing, there may be an increased risk of a crash or a backover incident.</p>\n\n\n\n<p>The factory production control system responsible for checking the actual software version in a vehicle versus a target software version was incorrectly updated. </p>\n\n\n\n<p>This allowed a previous software version to be checked as ok condition. The issue has been addressed on the production line, and the correct system software flashed to new vehicles as well as unsold / undelivered stock.</p>\n\n\n\n<h2><strong>Timeline of events</strong></h2>\n\n\n\n<p>In late August 2018, Bentley&#8217;s Product Safety department was informed, by engineering, of an older level of software being flashed on the production line for the rear view camera. </p>\n\n\n\n<p>By early September 2018 a subsequent investigation found a number of vehicles, including ones already sold and delivered to customers, had been built with an older level of software, which did not fully comply with FMVSS 111 requirements.</p>\n\n\n\n<p>Delivery of affected vehicles to customers was stopped and arrangements made for the latest level of software to be flashed onto all other units. The Product Safety Committee informed NHTSA of non-compliance, and the decision to launch a voluntary recall was made.</p>\n\n\n\n<h2><strong>The solution</strong></h2>\n\n\n\n<p>All affected vehicles (believed to be only 10 units) will have a software re-flash to the latest software level, via an SD card. Bentley will notify all owners of affected vehicles to instruct them to request an appointment with an authorized Bentley dealer. </p>\n\n\n\n<p>Dealers will complete the re-flash on affected vehicles free of charge. Bentley is not offering a reimbursement program under this recall.</p>\n\n\n\n<p>The NHTSA Campaign Number for this recall is 18V-632. <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCAK-18V632-8285.pdf\">The Bentley Motors recall number is RE 18/11.</a> The recall is expected to commence in early October. </p>\n\n\n\n<p>Check your car’s recall status using MotorSafety’s <a href=\"https://www.motorsafety.org/\">free vehicle lookup tool</a>.</p>\n<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script>","source":"https://www.motorsafety.org/?p=16049","createdAt":"2018-09-26T08:07:11.000Z","date_gmt":"2018-09-26T21:52:11.000Z","updatedAt":"2020-10-02T21:53:09.000Z","modified_gmt":"2020-10-03T11:38:09.000Z","display_date":"September 26, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"18V-632","recall_date":"September 26, 2018"},"year":2018,"month":9,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/09/2014-Bentley-Mulsanne-768x528.jpg","alt_text":"","cld_public_id":"2014-Bentley-Mulsanne","category":{"id":154,"name":"Bentley","slug":"bentley-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/06/bentley.png"},"tags":[{"id":664,"name":"2018 Bentley Mulsanne","slug":"2018-bentley-mulsanne"},{"id":663,"name":"Bentley Recall","slug":"bentley-recall"},{"id":408,"name":"Crash Risk","slug":"crash-risk"},{"id":665,"name":"rear-view camera software","slug":"rear-view-camera-software"}],"categories":[{"id":154,"name":"Bentley","slug":"bentley-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/06/bentley.png"}]},{"id":16051,"title":"Honda Recalls Over 1,350,000 Vehicles Due to Air Bag Defect","link":"https://www.motorsafety.org/honda-recalls-over-1350000-vehicles-due-to-air-bag-defect/","status":"publish","slug":"honda-recalls-over-1350000-vehicles-due-to-air-bag-defect","excerpt":"<p>Honda (American Honda Motor Co.) is recalling over 1,350,000 vehicles due to the passenger frontal airbag inflator being at risk for exploding. The massive recall is part of a previously planned phased recall.</p>\n","description":"\n<p><em>Lilburn, Georgia – September 26, 2018</em> – Honda (NYSE:HMC) is recalling over 1,350,000 vehicles due to the passenger frontal air bag inflator being at risk of exploding. The recall includes:</p>\n\n\n\n<ul><li><strong>2011- 2014 Honda Insight </strong></li><li><strong>2010-2014 Acura TSX </strong></li><li><strong>2011-2014 Acura TSX Wagon</strong></li><li><strong>2010-2011 Acura ZDX</strong></li><li><strong>2010-2015 Honda Crosstour </strong></li><li><strong>2011-2015 Honda Pilot</strong></li><li><strong>2014 Honda FCX Clarity </strong></li><li><strong>2010-2013 Honda Fit EV</strong></li><li><strong>2011-2014 Honda Fit EV</strong></li><li><strong>2010-2012 Honda Accord</strong></li><li><strong>2010-2011 Honda Civic NGV</strong></li><li><strong>2010-2011 Honda Civic</strong></li><li><strong>2010-2011 Honda Civic Hybrid </strong></li><li><strong>2010-2011 Honda CR-V</strong></li></ul>\n\n\n\n<h2>Recall summary</h2>\n\n\n\n<p>The massive recall is part of a previous recall, but the schedule is being accelerated because the risk was determined to be more severe than previously thought. There are also enough replacement airbags to finish the whole recall ahead of schedule.</p>\n\n\n\n<p>According to the <a rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V661-8752.PDF\" target=\"_blank\">NHTSA Safety Recall Report,</a> all these vehicles are equipped with certain air bag air bag inflators assembled as part of the frontal air bag modules. </p>\n\n\n\n<p>The specific defective modules may explode due to propellant degradation, which can occur after long-term exposure to higher absolute humidity, temperature, and temperature cycling. </p>\n\n\n\n<p>In the case of an inflator rupture, the force of inflation may cause metal fragments to pass through the air bag and into the vehicle interior at high speed.</p>\n\n\n\n<p>Contact with such high speed, flying pieces of metal, should the inflation occur and metal pieces be fragmented, may result in serious injury or death to vehicle driver and/or occupants.</p>\n\n\n\n<h2>The repair</h2>\n\n\n\n<p>The registered owners of all affected vehicles will be contacted by mail by Honda. Honda will request all owners asked to take their vehicles to a Honda or Acura automobile dealer. </p>\n\n\n\n<p>The dealer will replace the passenger frontal airbag inflator with a new inflator, at no cost to the vehicle owner. The recall is expected to begin November 13, 2018.</p>\n\n\n\n<h2><strong>Is your vehicle part of the recall?</strong></h2>\n\n\n\n<p>Over 1.34 million vehicles were originally part of this recall. As of April 9, 2021, – the last date for which information was available – 1,104,463 airbags had been replaced. To see if your car still needs to be repaired, use MotorSafety’s<a href=\"https://www.motorsafety.org/\"> free lookup tool</a>.</p>\n","source":"https://www.motorsafety.org/?p=16051","createdAt":"2018-09-26T08:07:05.000Z","date_gmt":"2018-09-26T21:52:05.000Z","updatedAt":"2021-06-18T11:38:23.000Z","modified_gmt":"2021-06-19T01:23:23.000Z","display_date":"September 26, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"18V-661","recall_date":"September 27, 2018","meta_title":"","meta_description":"","meta_keywords":"","custom_schema":""},"year":2018,"month":9,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/09/2019-Honda-concept-car-768x512.jpg","alt_text":"","cld_public_id":"2019-Honda-concept-car","category":{"id":34,"name":"Acura","slug":"acura-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/acura.png"},"tags":[{"id":558,"name":"2010-2012 Honda Accord","slug":"2010-2012-honda-accord"},{"id":554,"name":"2011 Honda Civic","slug":"2011-honda-civic"},{"id":555,"name":"2011 Honda Civic Hybrid","slug":"2011-honda-civic-hybrid"},{"id":553,"name":"2011 Honda Civic NGV","slug":"2011-honda-civic-ngv"},{"id":556,"name":"2011 Honda CRV","slug":"2011-honda-crv"},{"id":552,"name":"2011-2012 Honda Accord","slug":"2011-2012-honda-accord"},{"id":545,"name":"2011-2013 Acura TSX","slug":"2011-2013-acura-tsx"},{"id":557,"name":"2011-2013 TSX Wagon","slug":"2011-2013-tsx-wagon"},{"id":543,"name":"2014 Honda FCX Clarity","slug":"2014-honda-fcx-clarity"},{"id":539,"name":"2014 Honda Insight","slug":"2014-honda-insight"}],"categories":[{"id":34,"name":"Acura","slug":"acura-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/acura.png"},{"id":4,"name":"Honda","slug":"honda-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/honda_ms.png"}]},{"id":16045,"title":"Mitsubishi Recalls Nearly 60,000 Vehicles For Faulty Safety System Software","link":"https://www.motorsafety.org/mitsubishi-recalls-nearly-60000-vehicles-for-faulty-safety-system-software/","status":"publish","slug":"mitsubishi-recalls-nearly-60000-vehicles-for-faulty-safety-system-software","excerpt":"<p>Mitsubishi Motors North America, Inc. (MMNA) is recalling certain 2018 Mitsubishi Outlander Sport vehicles equipped with a Forward Collision Mitigation (FCM) system, as well as 2018 Mitsubishi Outlander PHEV and Eclipse Cross vehicles and 2017-2018 Outlander vehicles.</p>\n","description":"<p>Lilburn, Georgia – September 26, 2018 – Mitsubishi Motors North America, Inc. (MMNA) is recalling certain 2018 Mitsubishi Outlander Sport vehicles equipped with a Forward Collision Mitigation (FCM) system, as well as 2018 Mitsubishi Outlander PHEV and Eclipse Cross vehicles and 2017-2018 Outlander vehicles equipped with an Adaptive Cruise Control (ACC) system and/or an Electric Parking Brake (EPB) system.</p>\n<h2>The Defect</h2>\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V621-7405.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">NHTSA Safety Recall Report</a>, the software for the Hydraulic Unit&#8217;s Electronic Control Unit (HU-ECU) may be incorrect. Due to this inappropriate software in HU-ECU electrical noise is generated when the pump motor of the H/U operates, which may cause the H/U-ECU to reset.</p>\n<p>This defect could prevent the intervention of safety systems when in use, including automatic emergency braking, Anti-lock Braking (ABS), Electronic Stability Control (ESC), or the Brake Auto Hold (BAH) function. If the safety systems do not function as intended, it can increase the risk of a crash. There have been no reported injuries or accidents due to this condition.</p>\n<h2>Timeline of Events</h2>\n<p>In March 2017, a field report from Japan was received by MMC. The report stated that the &#8220;ACC CHECK&#8221; warning appeared in the multi-information display of combination meter while driving. From April 2017 to August 2017, MMC received two additional field reports. In the first case, MMC conducted a bench test with the returned part, but was unable to reproduce the problem. After the second field report, MMC conducted the vehicle test with the additional two returned parts and was able to reproduce the problem with one of the returned parts.</p>\n<p>MMC subsequently conducted the bench test again using the driving data of the vehicle test which had formerly successfully reproduced the problem, but was not able to reproduce the problem again, so MMC and the supplier continued to conduct tests from December 2017 to April 2018</p>\n<p>Upon conclusion of the company&#8217;s investigation, MMC determined that inappropriate software in the H/U-ECU could generate electrical noise when the pump motor operates, causing the H/U-ECU to reset. The flaw in the software was corrected in production, and MMC continued investigating with the purpose of analyzing the variations and estimating future occurrences.</p>\n<p>MMC concluded that the failure would occur continuously in the future, and in September 2018 the manufacturer chose to initiate a field action in the US to address the condition and advised Mitsubishi Motors North America, Inc. to conduct a safety recall.</p>\n<h2>The Solution</h2>\n<p>Owners of all affected vehicles will be notified and asked to bring their vehicles in to reprogram the H/U-ECU software with countermeasure software. The repair will be performed with no cost to vehicle owners. The new software does not generate the electrical noise which may reset the H/UECU, eliminating the issue. New software for the H/U-ECU was used in production starting with vehicles built in and after April 2018. The <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCAK-18V621-8709.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">NHTSA Campaign Number </a>for this recall is 18V-621</p>\n<p>Owners seeking reimbursement for any expenses associated with this recall will be directed in the notification letter to contact the Mitsubishi Customer Relations Department for reimbursement consideration. MMNA will notify owners, and dealers will update the Hydraulic Unit-ECU software, free of charge. The recall is expected to begin October 16, 2018. Owners may contact MMNA customer service at 1-888-648-7820. MMNA&#8217;s number for this recall is SR-18-008. Owners may also contact the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153).<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16045","createdAt":"2018-09-26T07:57:52.000Z","date_gmt":"2018-09-26T21:42:52.000Z","updatedAt":"2020-10-22T04:17:36.000Z","modified_gmt":"2020-10-22T18:02:36.000Z","display_date":"September 26, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"18V621000","recall_date":"September 14, 2018"},"year":2018,"month":9,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/09/2020-white-Mitsubishi-Eclipse-Cross-768x512.jpg","alt_text":"","cld_public_id":"2020-white-Mitsubishi-Eclipse-Cross","category":{"id":30,"name":"Mitsubishi","slug":"mitsubishi-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mitsubishi.png"},"tags":[{"id":1637,"name":"2017-2018 Mitsubishi Eclipse Cross recall","slug":"2017-2018-mitsubishi-eclipse-cross-recall"},{"id":1636,"name":"2018 Mitsubishi Outlander recall","slug":"2018-mitsubishi-outlander-recall"},{"id":1635,"name":"2018 Mitsubishi Outlander Sport recall","slug":"2018-mitsubishi-outlander-sport-recall"},{"id":1638,"name":"Mitsubishi adaptive cruise control (ACC)","slug":"mitsubishi-adaptive-cruise-control-acc"}],"categories":[{"id":30,"name":"Mitsubishi","slug":"mitsubishi-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mitsubishi.png"}]},{"id":16083,"title":"Mercedes Benz Recalls More Than 4,700 Vehicles for Incorrect Turn Signal Light Color","link":"https://www.motorsafety.org/mercedes-benz-recalls-more-than-4700-vehicles-for-incorrect-turn-signal-light-color/","status":"publish","slug":"mercedes-benz-recalls-more-than-4700-vehicles-for-incorrect-turn-signal-light-color","excerpt":"<p>Daimler AG (“DAG”), the manufacturer of Mercedes-Benz vehicles, has determined that on certain Model Year (“MY”) 2018 GLC-Class (253 platform) vehicles, equipped with LED headlamps, the front turn signal lights may be pink/violet in color.</p>\n","description":"<p>&nbsp;</p>\n<p>Lilburn, Georgia – September 26, 2018 – Mercedes-Benz USA, LLC (MBUSA) is recalling certain 2018 GLC300 4MATIC Coupe, GLC300, GLC300 4MATIC, GLC350e 4MATIC, GLC43 AMG 4MATIC Coupe, and GLC43 AMG 4MATIC vehicles equipped with LED headlights.</p>\n<p>Daimler AG (&#8220;DAG&#8221;), the manufacturer of Mercedes-Benz vehicles, has determined that on certain Model Year (&#8220;MY&#8221;) 2018 GLC-Class (253 platform) vehicles, equipped with LED headlamps, the front turn signal lights may be pink/violet in color.</p>\n<p>The recall covers over 4,700 vehicles, with an estimated 10% being subject to the defect. The front turn signals may have an incorrect color of pink or violet, thus failing to comply with the requirements of Federal Motor Vehicle Safety Standard.</p>\n<h3>The Defect</h3>\n<p>According to the NHTSA Safety Recall Report, although the function of the turn indicators is not affected, legal requirements may not be met. Turn signals that are the wrong color may not be as easily recognized by other drivers, increasing the risk of a crash. Owners may notice the unusual color when unlocking or locking their vehicle doors, which can cause the lights to flash.</p>\n<h3>Timeline of Events</h3>\n<p>In March 2018 DAG initiated initial investigations based on a single vehicle detected in the production plant, and subsequently, in April 2018, DAG and the headlamp supplier analyzed the exemplar headlamp.</p>\n<p>In May 2018 it was determined that a production deviation at the supplier resulted in damaged LED phosphor layers and by June 2018 the supplier had determined the potentially affected batches of headlamps</p>\n<p>In July and August 2018 DAG determined the potentially affected vehicles equipped with the suspect headlamps, and in early September 2018 DAG determined that a potential non-compliance of subject vehicles with legal light colors could not be excluded. The recall is voluntary, and the issue was corrected on the manufacturing line for all vehicles produced after the defect was discovered.</p>\n<h3>The Solution</h3>\n<p>As a precautionary measure, an authorized Mercedes-Benz dealer will check the color of the turn signal on the affected LED headlamps, and replace the LED module, if necessary.<br />\nMBUSA will not provide notice about pre-notice reimbursement to owners since all involved vehicles remain covered under the new vehicle warranty, and the replacement will be done free of charge.</p>\n<p>The recall is expected to begin November 9, 2018. Owners may contact MBUSA customer service at 1-800-367-6372. Owners may also contact the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153). The NHTSA Number for this recall is 18V-610.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16083","createdAt":"2018-09-26T06:36:49.000Z","date_gmt":"2018-09-26T20:21:49.000Z","updatedAt":"2020-10-04T05:32:24.000Z","modified_gmt":"2020-10-04T19:17:24.000Z","display_date":"September 26, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2018,"month":9,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/09/Black-2018-Mercedes-Benz-GLC-300-768x545.jpg","alt_text":"","cld_public_id":"Black-2018-Mercedes-Benz-GLC-300","category":{"id":5,"name":"Mercedes-Benz","slug":"mercedes-benz-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mercedes_RM.png"},"tags":[],"categories":[{"id":5,"name":"Mercedes-Benz","slug":"mercedes-benz-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mercedes_RM.png"}]},{"id":16034,"title":"Mitsubishi Recalls More Than 9,000 Vehicles Over Faulty FCM Software","link":"https://www.motorsafety.org/mitsubishi-recalls-more-than-9000-vehicles-over-faulty-fcm-software/","status":"publish","slug":"mitsubishi-recalls-more-than-9000-vehicles-over-faulty-fcm-software","excerpt":"<p>Mitsubishi Motors North America  is recalling certain 2018 Mitsubishi Outlander PHEV, Outlander Sport, 2018-2019 Eclipse Cross, and 2017-2018 Outlander vehicles equipped with a Forward Collision Mitigation (FCM) system that detects pedestrians.</p>\n","description":"<p>Lilburn, Georgia – September 26, 2018 – Mitsubishi Motors North America (MMNA) is recalling certain 2018 Mitsubishi Outlander PHEV, Outlander Sport, 2018-2019 Eclipse Cross, and 2017-2018 Outlander vehicles equipped with a Forward Collision Mitigation (FCM) system that detects pedestrians. Only vehicles that were equipped with Forward Collision Mitigation (FCM) system are affected, with the total number of vehicles being recalled totaling 9,166.</p>\n<h2>The Defect</h2>\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V620-5550.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">NHTSA Safety Recall Report,</a> due to incorrect software, the FCM-ECU (Electronic Control Unit) may apply braking for longer than needed. The error may occur when a pedestrian was registered as being in front of the vehicle, even after a pedestrian is no longer detected. If the FCM-ECU software activates the brake for longer than necessary, the driver may react by applying additional braking. The resulting rapid deceleration of the vehicle has been suspected to increase the risk of a rear-end collision or cause the driver to lose control of the vehicle.</p>\n<h2>Timeline of Events</h2>\n<p>During March through May 2017, MMC received three field reports from the Czech Republic and Japan indicating that the vehicle brake was activated by FCM system. The reports stating the brake activation occurred when there were no pedestrians or other vehicles in front of the vehicle. MMC began an investigation. Between May and October 2017, as a result of the investigation, it was concluded that the FCM system operated properly. However, in February 2018, MMC received an accident report from Australia which stated that rear-end collision had occurred due to the vehicle brake being activated by the FCM system. Again, MMC concluded the FCM system operated properly.</p>\n<p>In May 2018, two additional accident reports from Singapore and Japan were received, and it was confirmed that the driver of each vehicle had depressed the brake pedal strongly when the brake was activated by the FCM system. This caused the vehicles to be decelerated rapidly. In June 2018, MMC completely reprogrammed the software of the FCM-ECU in production, in order to specifically shorten the operation time of the brake by the FCM system. This safeguard is designed to help prevent the driver from choosing to apply a stronger brake when the danger is already past or when not necessary.</p>\n<p>MMC subsequently continued its investigation to assess the safety risk of affected vehicles, and in September 2018, MMC determined that a field action was necessary in the US to address the potential risk, although there had been no adverse reports from the US. MMC advised Mitsubishi Motors North America, Inc. to conduct a safety recall.</p>\n<h2>The Solution</h2>\n<p>Owners of all affected vehicles will be notified and encouraged to bring their vehicles in to reprogram the FCM-ECU software with countermeasure software. The repair will be performed at no charge to vehicle owners. The recall is expected to begin October 16, 2018.</p>\n<p>Any owners seeking reimbursement for any expenses associated with this recall will be directed in the notification letter to contact the Mitsubishi Customer Relations Department for reimbursement consideration.</p>\n<p>Owners may contact MMNA customer service at 1-888-648-7820. MMNA&#8217;s number for this recall is SR-18-007. Owners may also contact the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153).<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16034","createdAt":"2018-09-26T05:42:46.000Z","date_gmt":"2018-09-26T19:27:46.000Z","updatedAt":"2020-10-22T04:20:52.000Z","modified_gmt":"2020-10-22T18:05:52.000Z","display_date":"September 26, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"18V620000","recall_date":"September 14, 2018"},"year":2018,"month":9,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/09/2018-red-Mitsubishi-Eclipse-Cross-768x512.jpg","alt_text":"","cld_public_id":"2018-red-Mitsubishi-Eclipse-Cross","category":{"id":30,"name":"Mitsubishi","slug":"mitsubishi-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mitsubishi.png"},"tags":[{"id":1640,"name":"2017-2018 Mitsubishi Outlander recall","slug":"2017-2018-mitsubishi-outlander-recall"},{"id":1635,"name":"2018 Mitsubishi Outlander Sport recall","slug":"2018-mitsubishi-outlander-sport-recall"},{"id":1639,"name":"2018-2019 Mitsubishi Eclipse Cross recall","slug":"2018-2019-mitsubishi-eclipse-cross-recall"}],"categories":[{"id":30,"name":"Mitsubishi","slug":"mitsubishi-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mitsubishi.png"}]},{"id":16032,"title":"Ford Recalls Around 555 Ford Edge and Lincoln MKX Vehicles for Incorrect Door Striker Bolt","link":"https://www.motorsafety.org/ford-recalls-around-555-ford-edge-and-lincoln-mkx-vehicles-for-incorrect-door-striker-bolt/","status":"publish","slug":"ford-recalls-around-555-ford-edge-and-lincoln-mkx-vehicles-for-incorrect-door-striker-bolt","excerpt":"<p>Ford Motor Company (Ford) is recalling certain 2018 Ford Edge and Lincoln MKX vehicles in North America to replace door striker bolts in all four doors.</p>\n","description":"<p>&nbsp;</p>\n<p>Lilburn, Georgia – September 25, 2018: Ford Motor Company (Ford) is recalling certain 2018 Ford Edge and Lincoln MKX vehicles in North America to replace door striker bolts in all four doors.<br />\nThese vehicles may have door striker bolts that are shorter than intended. Vehicles with shorter door striker bolts fail to comply with the requirements of Federal Motor Vehicle Safety Standards for Door Locks and Door Retention Components.In the event of a crash, a shorter bolt may allow the door to open, increasing the risk of injury.</p>\n<p>According to a release from the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RMISC-18V612-2451.pdf\">Ford Media Center</a>, affected vehicles include 2018 Ford Edge and 2018 Lincoln MKX vehicles built at Oakville Assembly Plant, July 27-31, 2018. There are approximately 555 vehicles in North America relating to this concern, with 503 vehicles in the United States and its federalized territories, 51 in Canada and one in Mexico. Vehicles assembled before July 27, 2018 and after July 31, 2018 were assembled using the correct length door striker bolts and are not affected by this concern.</p>\n<h3>The Defect</h3>\n<p>The affected vehicles may have a door striker assembled to the vehicle body with one or both striker bolts that may be 5mm shorter than design intent length. In the event of a vehicle crash, a door striker with a shorter bolt may not withstand the minimum ultimate loads required. This may allow the door to open in a crash, increasing the risk of injury.</p>\n<p>The supplier mislabeled and delivered striker bolts 5mm shorter than the design intent bolts. Because of the mislabeling, the shorter bolts became mixed with the design intent bolts at the assembly line.</p>\n<h3>Timeline of Events</h3>\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V612-3181.PDF\">NHTSA Safety Recall Report</a>, in August 2018, Oakville Assembly Complex (OAC) brought into Ford&#8217;s Critical Concerns Review Group (CCRG) an issue concerning Edge and MKX vehicles that may have been built with the incorrect length fastener used to attach the door striker to the vehicle body.</p>\n<p>After a line operator observed that the fastener was not the correct length, a stop-ship was initiated, and the supplier was notified. Further investigation identified that the supplier had mistakenly shipped boxes labeled with the correct part number, but which actually contained fasteners that were 5mm shorter than design intent.</p>\n<p>The error was limited to a single batch of mis-labeled door striker bolts. The supplier took corrective action and preventative action at their facility and resumed delivery to OAC on July 30, 2018.</p>\n<p>Engineering was asked to study the effect of a 5 mm shorter length bolt on the strength of the door striker. In September 2018, Ford&#8217;s Field Review Committee reviewed the concern and approved a field action to recall vehicles with the incorrect part, as it was determined that the shorter bolt could cause a hazard in case of a crash by failing to properly secure the door.</p>\n<p>Ford is not aware of any reports of accident or injury related to this condition.</p>\n<h3>The Solution</h3>\n<p>Ford will notify owners, and dealers will replace the door striker bolts, free of charge. The recall is expected to begin October 15, 2018. Owners may contact Ford customer service at 1-866-436-7332. Owners may also contact the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153). The Ford reference number for this recall is 18C06.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16032","createdAt":"2018-09-25T05:43:49.000Z","date_gmt":"2018-09-25T19:28:49.000Z","updatedAt":"2020-10-02T22:00:14.000Z","modified_gmt":"2020-10-03T11:45:14.000Z","display_date":"September 25, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2018,"month":9,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/09/2018-Grey-Motor-car-Lincoln-768x512.jpg","alt_text":"","cld_public_id":"2018-Grey-Motor-car-Lincoln","category":{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"},"tags":[],"categories":[{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"},{"id":26,"name":"Lincoln","slug":"lincoln-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/lincoln_RM.png"}]},{"id":16022,"title":"GM Recalls Over One Million 2015 Vehicles Due to Faulty Steering Assist","link":"https://www.motorsafety.org/gm-recalls-over-one-million-2015-vehicles-due-to-faulty-steering-assist/","status":"publish","slug":"gm-recalls-over-one-million-2015-vehicles-due-to-faulty-steering-assist","excerpt":"<p>General Motors has discovered a defect in certain 2015 model year Chevrolet Silverado, Suburban, and Tahoe vehicles; along with GMC Sierra Yukon and Cadillac Escalades affecting the EPS.</p>\n","description":"\n<p><em>Lilburn, Georgia – September 22, 2018</em> &#8211; General Motors has discovered a defect which relates to motor vehicle safety in the following vehicles:</p>\n\n\n\n<ul><li>2015 Chevrolet Silverado LD</li><li>2015 Suburban and Tahoe vehicles</li><li>2015 GMC Sierra LD and Yukon vehicles </li><li>2015 Cadillac Escalade</li></ul>\n\n\n\n<p>GM has issued a recall for over one million vehicles.</p>\n\n\n\n<h2>The defect</h2>\n\n\n\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V586-7680.PDF\">NHTSA Safety Recall Report</a>, the affected vehicles may experience a temporary loss of EPS assist, followed by a sudden return of EPS assist. </p>\n\n\n\n<p>This is most likely to happen during low-speed turning maneuvers. The loss and sudden return of EPS assist typically occurs within a 1 second period. The steering malfunction is caused by an electrical/software issue.</p>\n\n\n\n<p>The danger lies in the fact that if EPS assist is lost and suddenly returned, the driver could have difficulty steering the vehicle. The likelihood of a crash is increased, especially at low speeds. </p>\n\n\n\n<p>Low speed turns can cause temporary low voltage conditions, and if system voltage drops below 8.8 volts for more than 1 second, EPS assist is disabled. When voltage returns to 9 volts for a minimum of 40 milliseconds, EPS assist returns.</p>\n\n\n\n<p>If power steering assist is lost a driver information center message may alert the driver to an EPS problem, and other electrical sub-systems may shut down just prior to or at the same time as the EPS event.</p>\n\n\n\n<p>This can cause disruption to operation of the radio, stabilitrack, the DIC, chimes, door-lock cycling, air conditioning, or cruise control.</p>\n\n\n\n<h2>Timeline of events</h2>\n\n\n\n<p>In late June 2018, an increase in field reports and customer complaints about EPS issues led GM to open a safety investigation into loss of EPS in the subject vehicles.&nbsp; </p>\n\n\n\n<p>GM&#8217;s safety investigator and engineering-analysis experts determined the loss-of-EPS issues was caused by the same electrical issue discovered in trucks that GM recalled in 2017. GM&#8217;s Safety Field Action Decision Authority subsequently chose to conduct a safety recall.</p>\n\n\n\n<h2>The solution</h2>\n\n\n\n<p>According to an <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCMN-18V586-6582.pdf\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">NHTSA FAQ</a> published for the recall, customers who own a vehicle involved in the field action will be notified by mail by General Motors, but the exact date the recall will begin is not yet set and the manufacture has not published a notification schedule.</p>\n\n\n\n<p>Dealers will perform a reflash of the EPS module software. The inspection/repair will be done at no cost to the customer, and is available at Cadillac, Chevrolet and GMC dealers. Customers are strongly urged to repair their vehicle as soon as possible.</p>\n\n\n\n<p>Courtesy transportation is available for customers whose vehicles are involved in the recall, and whose vehicles are still within the warranty coverage period for the warranty which is associated with the recall.</p>\n\n\n\n<p>Check your car’s recall status using MotorSafety’s <a href=\"https://www.motorsafety.org/\">free vehicle lookup tool</a>.</p>\n<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script>","source":"https://www.motorsafety.org/?p=16022","createdAt":"2018-09-22T06:34:27.000Z","date_gmt":"2018-09-22T20:19:27.000Z","updatedAt":"2020-10-26T00:05:12.000Z","modified_gmt":"2020-10-26T13:50:12.000Z","display_date":"September 22, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"18V-586","recall_date":"September 7, 2018"},"year":2018,"month":9,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/09/2019-GMC-Yukon-768x512.jpg","alt_text":"Black 2019 GMC Yukon XL.","cld_public_id":"2019-GMC-Yukon","category":{"id":36,"name":"Cadillac","slug":"cadillac-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/cadillac.png"},"tags":[{"id":1650,"name":"2015 Cadillac Escalade recall","slug":"2015-cadillac-escalade-recall"},{"id":1646,"name":"2015 Chevrolet Silverado recall","slug":"2015-chevrolet-silverado-recall"},{"id":1647,"name":"2015 Chevrolet Suburban recall","slug":"2015-chevrolet-suburban-recall"},{"id":1648,"name":"2015 GMC Sierra recall","slug":"2015-gmc-sierra-recall"},{"id":1649,"name":"2015 GMC Yukon recall","slug":"2015-gmc-yukon-recall"},{"id":1652,"name":"GM EPS","slug":"gm-eps"},{"id":1651,"name":"GM power steering issues","slug":"gm-power-steering-issues"}],"categories":[{"id":36,"name":"Cadillac","slug":"cadillac-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/cadillac.png"},{"id":12,"name":"Chevrolet","slug":"chevrolet-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/chevy_ms.png"},{"id":72,"name":"GMC","slug":"gmc-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/gmc_RM.png"}]},{"id":16030,"title":"Honda Recalls 793 Acura NSX Vehicles for Brake Light Malfunction","link":"https://www.motorsafety.org/honda-recalls-793-acura-nsx-vehicles-for-brake-light-malfunction/","status":"publish","slug":"honda-recalls-793-acura-nsx-vehicles-for-brake-light-malfunction","excerpt":"<p>Honda (American Honda Motor Co.) is recalling certain 2017 Acura NSX vehicles due to faulty mounting of the circuit board for the high mounted center brake light (HMSL).</p>\n","description":"\n<p><em>Lilburn, Georgia – September 22, 2018</em>: Honda (American Honda Motor Co.) is recalling certain 2017 Acura NSX vehicles due to a faulty mounting of the circuit board for the high mounted center brake light. </p>\n\n\n\n<p>The recall population was determined based on manufacturing records, and only 793 vehicles are potentially affected. All vehicles built from the start-up of production through July 31, 2017 are affected. </p>\n\n\n\n<p>The supplier provided updated HMSLs for vehicles built after July 31, 2017 to improve production quality, so no vehicles built after that date were affected.</p>\n\n\n\n<h2>The defect</h2>\n\n\n\n<p>According to an <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCRIT-18V599-6932.pdf\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">Acura service bulletin</a>, there is an internal issue with the circuit board in the high mount brake light (also referred to as the center high mount brake light). </p>\n\n\n\n<p>Normal road vibrations can cause the metal screws securing the printed circuit board for the high mounted center brake light to loosen and contact the circuitry. </p>\n\n\n\n<p>If this happens during illumination (when the brake pedal is depressed), the circuit board may short, causing the corresponding fuse to blow.</p>\n\n\n\n<p>In such a situation, all the brake lights will stop working, which increases the risk of a collision. In the dash, several malfunction indicator lamps will turn on to indicate the brake light failure. </p>\n\n\n\n<p>Once the fuse is blown, the vehicle will be prevented from being restarted once it has been turned off. The 793 vehicles affected by this recall fail to comply with the requirements of Federal Motor Vehicle Safety Standard regarding Lamps, Reflective Devices, and Associated Equipment.</p>\n\n\n\n<h2>Timeline of events</h2>\n\n\n\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V599-2601.PDF\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">NHTSA Safety Recall Notice</a> in June 2017, Honda received the first claim of a no-start condition, and subsequently began an investigation with the HMSL&#8217;s supplier to determine the root cause. </p>\n\n\n\n<p>The supplier&#8217;s initial analysis suspected the failure to be short circuit related and identified a potential issue with contact between the metal screw and the PCB circuitry. They supplied an updated part for future builds.</p>\n\n\n\n<p>In January 2018, Bully tests were performed on the PCB to determine the extent of coating wear from the metal screws. By September 2018 Honda completed the investigation. </p>\n\n\n\n<p>It was determined that FMVSS non-compliance existed, and Honda chose to conduct a safety recall. As of September 4, 2018 Honda has received only 19 warranty claims. There have been no field reports or reports of injuries related to this issue.</p>\n\n\n\n<h2>The solution</h2>\n\n\n\n<p>According to a <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RMISC-18V599-4150.pdf\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">public statement from Acura</a>, due to the relatively small number of affected vehicles, where possible, Acura will attempt to directly contact registered owners of affected vehicles by phone to schedule repairs, and in November any unreached registered owners of affected vehicles will be contacted by mail and asked to take their vehicle to an NSX Authorized Acura dealer. </p>\n\n\n\n<p>The dealer will replace the center high mount brake light at no charge to owners.</p>\n\n\n\n<p>The recall is expected to begin November 6, 2018. Owners of 2017 NSX vehicles can determine if their vehicles require repair by using MotorSafety&#8217;s<strong> </strong><a href=\"https://www.motorsafety.org/\">free vehicle lookup tool.</a></p>\n\n\n\n<p></p>\n<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script>","source":"https://www.motorsafety.org/?p=16030","createdAt":"2018-09-22T05:40:13.000Z","date_gmt":"2018-09-22T19:25:13.000Z","updatedAt":"2020-11-06T00:02:23.000Z","modified_gmt":"2020-11-06T13:47:23.000Z","display_date":"September 22, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"18V-599","recall_date":"September 7, 2018"},"year":2018,"month":9,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/09/Yellow-2017-Acura-NSX-768x512.jpg","alt_text":"","cld_public_id":"Yellow-2017-Acura-NSX","category":{"id":34,"name":"Acura","slug":"acura-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/acura.png"},"tags":[{"id":1653,"name":"2017 Acura NSX recall","slug":"2017-acura-nsx-recall"},{"id":1654,"name":"Acura brake light","slug":"acura-brake-light"}],"categories":[{"id":34,"name":"Acura","slug":"acura-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/acura.png"}]},{"id":16020,"title":"Over 1,600 2019 Infiniti vehicles recalled by Nissan for faulty air bag modules","link":"https://www.motorsafety.org/over-1600-2019-infiniti-vehicles-recalled-by-nissan-for-faulty-air-bag-modules/","status":"publish","slug":"over-1600-2019-infiniti-vehicles-recalled-by-nissan-for-faulty-air-bag-modules","excerpt":"<p>Nissan North America, Inc. (Nissan) is recalling certain 2019 INFINITI QX50 vehicles due to an air bag module defect that increases risk of injury for passenger seat drivers in the event of a crash.</p>\n","description":"<p>Lilburn, Georgia – Sept. 21, 2018: Nissan North America, Inc. is recalling certain 2019 INFINITI QX50 vehicles due to an air bag module defect that increases risk of injury for passenger seat drivers in the event of a crash.</p>\n<p>The recall includes just over 1,600 vehicles manufactured between July 4, 2018, and August 24, 2018, with the chances of any specific vehicle suffering a defect being 1 percent, according to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V593-7245.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">NHTSA safety recall report</a>. No other INFINITI (or Nissan) vehicles are affected by this issue because the affected passenger-side knee air bag module is unique to this model and those dates of manufacture.</p>\n<h2>The Defect</h2>\n<p>In the event of a crash in very cold temperatures, the trim cover may separate unexpectedly from the passenger-side knee air bag module instead of splitting at the trim cover tear seam as designed. If the passenger-side knee air bag cover detaches during deployment, it can increase the risk of injury.</p>\n<p>According to an <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCMN-18V593-9154.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">INFINITI campaign bulletin</a>, the manufacturer strongly recommends that if a vehicle is confirmed to be affected, this safety recall repair performed as soon as possible. Owners are urged to contact their retailer as soon as possible to schedule an appointment, and in the meantime to not allow passengers to ride in the front passenger seat.</p>\n<h2>Timeline of Events</h2>\n<p>In August 2018, while a supplier was conducting a low temperature lot acceptance test, the passenger-side knee air bag cover detached from the air bag module during deployment. The <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V593-7245.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">supplier launched an investigation</a>, and two weeks later the plant and supplier quarantined all passenger-side knee air bag modules.</p>\n<p>The investigation found that certain passenger-side knee air bag modules had been manufactured with an out-of-specification tear seam thickness, and the knee air bag cushion was incorrectly folded. Nissan identified the affected vehicles and chose to conduct a voluntary recall campaign to replace the passenger-side knee air bag module.</p>\n<h2>The Solution</h2>\n<p>The dealer will replace the passenger-side knee air bag module, including the module trim cover, with a new one. INFINITI will notify owners, and retailers will complete the replacement free of charge. Rental car coverage will be available up to a max of $180. The recall is expected to begin October 22, 2018, and the Campaign ID is PC644.</p>\n<p>Owners may contact INFINITI customer service at 1-800-662-6200, or contact the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153). Owners may also use the INFINITI recall tool to enter their VIN and find out if their vehicle is affected by the recall.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16020","createdAt":"2018-09-21T05:45:24.000Z","date_gmt":"2018-09-21T19:30:24.000Z","updatedAt":"2020-10-26T00:19:08.000Z","modified_gmt":"2020-10-26T14:04:08.000Z","display_date":"September 21, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"18V593000","recall_date":"September 6, 2018"},"year":2018,"month":9,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/09/2018-Motor-car-Infiniti-QX60-768x512.jpg","alt_text":"","cld_public_id":"2018-Motor-car-Infiniti-QX60","category":{"id":40,"name":"Infiniti","slug":"infiniti","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/infiniti_RM.png"},"tags":[{"id":1655,"name":"2019 Infiniti QX50 recall","slug":"2019-infiniti-qx50-recall"},{"id":1122,"name":"Infiniti airbag recall","slug":"infiniti-airbag-recall"},{"id":1123,"name":"Nissan airbag recall","slug":"nissan-airbag-recall"}],"categories":[{"id":40,"name":"Infiniti","slug":"infiniti","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/infiniti_RM.png"}]},{"id":16004,"title":"Nissan and INFINITI Recall More Than 200,000 Sedans and SUVs Over Fire Hazard Concerns","link":"https://www.motorsafety.org/nissan-and-infiniti-recall-more-than-200000-sedans-and-suvs-over-fire-hazard-concerns/","status":"publish","slug":"nissan-and-infiniti-recall-more-than-200000-sedans-and-suvs-over-fire-hazard-concerns","excerpt":"<p>Nissan and Infiniti recalls more than 200,000 sedans and SUVs. The recall is designed to allow the replacement of a faulty brake component that could cause a fire if brake fluid were to leak out onto a circuit board.</p>\n","description":"<p>Lilburn, Georgia – Sept. 20, 2018 – Nissan North America, Inc. (Nissan) and the company&#8217;s luxury brand, INFINITI, are recalling more than 200,000 sedans and SUVs. The recall is designed to allow the replacement of a faulty brake component that could cause a fire if brake fluid were to leak out onto a circuit board, according to <a href=\"https://www.consumerreports.org/car-recalls-defects/nissan-recalls-sedan-suvs-for-brake-related-fire-risk/\" target=\"_blank\" rel=\"noopener, nofollow noopener noreferrer\">Consumer Reports</a>.</p>\n<p>Affected vehicles include certain 2015-2017 Nissan Murano, 2016-2017 Nissan Maxima, 2017-2018 Nissan Pathfinder, and 2017 Infiniti QX60 vehicles, according to documentation provided by Nissan to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCAK-18V601-4638.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">National Highway Traffic Safety Administration</a> (NHTSA)</p>\n<h2>The Defect</h2>\n<p>According to safety recall campaign bulletins from <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCMN-18V601-7985.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">Nissan</a> and <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCMN-18V601-4592.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">INFINITI</a>, the Antilock Braking System (ABS) actuator pump seal may leak brake fluid onto the control electronic circuit board, which can cause an electrical short and potentially start a fire.</p>\n<p>If a leak occurs, the ABS warning lamp will illuminate to warn the driver. If the vehicle continues to be operated with the ongoing leak, the brake fluid may seep down onto the actuator circuit, creating an electrical short which could lead to a fire breaking out.</p>\n<p>This is not the first issue with Nissan and/or INFINITI sedans and/or SUVs. In 2016, an <a href=\"https://www.reuters.com/article/us-tesla-model-3/tesla-model-3-gets-5-star-rating-from-u-s-safety-agency-idUSKCN1M0224\" target=\"_blank\" rel=\"noopener, nofollow noopener noreferrer\">almost identical issue</a> with a faulty brake fluid seal allowing brake fluid to drip onto the ABS circuit board caused Nissan to recall 134,000 2016-2017 Maxima sedans, 2015-2017 Murano SUVs, and 2015-2016 Murano Hybrid SUVs across the U.S. and Canada.</p>\n<p>Additionally, in 2017&nbsp;nearly 57,000 Murano crossovers from the 2013 and 2014 model years were <a href=\"https://www.thecarconnection.com/news/1109573_2013-2014-nissan-murano-recalled-over-fire-hazard-57000-vehicles-affected\" target=\"_blank\" rel=\"noopener, nofollow noopener noreferrer\">recalled by Nissan</a> for faulty power steering fluid hose clamps, which allowed the lines to separate, causing difficulty in steering. The leaked fluid also posed a fire hazard, as if it leaked onto hot surfaces it could start a vehicle fire.</p>\n<h2>Timeline of Events</h2>\n<p>The report about this recall was officially issued on September 7, 2018.</p>\n<p>When brake fluid has leaked onto the circuit board, the ABS warning lamp will remain illuminated for more than 10 seconds after engine start up. If this occurs, owners are advised to park the vehicle outdoors away from other vehicles or structures and to not drive the vehicle.</p>\n<p>The manufacturer recommends parking the vehicle outside and contacting INFINITI or Nissan Roadside Assistance to have the vehicle towed to an authorized INFINITI or Nissan service department as soon as possible.</p>\n<h2>The Solution</h2>\n<p>Owners of potentially affected vehicles will be notified beginning in October 2018 and asked to bring their vehicle to an authorized INFINITI or Nissan retailer to have their ABS actuator checked and the remedial work completed if required (incurring no cost for the vehicle owner for either parts or labor.)</p>\n<p>Nissan will notify owners, and dealers will inspect the serial number on the ABS actuator, replacing it as necessary, free of charge. Vehicles identified under the previous recall in 2016 are still covered under this recall as well. The recall is expected to begin October 15, 2018.</p>\n<p>Owners may contact Nissan customer service at 1-800-867-7669, or the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236. The NHTSA Campaign Number is 18V601000. Vehicle owners can also enter their VIN at <a href=\"https://www.nhtsa.gov/recalls\" target=\"_blank\" rel=\"noopener noreferrer\">nhtsa.gov/recalls</a>.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16004","createdAt":"2018-09-20T06:37:36.000Z","date_gmt":"2018-09-20T20:22:36.000Z","updatedAt":"2020-10-26T01:52:27.000Z","modified_gmt":"2020-10-26T15:37:27.000Z","display_date":"September 20, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2018,"month":9,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/09/2017-New-Nissan-Pathfinder-768x512.jpg","alt_text":"","cld_public_id":"2017-New-Nissan-Pathfinder","category":{"id":40,"name":"Infiniti","slug":"infiniti","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/infiniti_RM.png"},"tags":[{"id":1656,"name":"2015-2017 Nissan Murano recall","slug":"2015-2017-nissan-murano-recall"},{"id":1657,"name":"2016-2017 Nissan Maxima recall","slug":"2016-2017-nissan-maxima-recall"},{"id":1659,"name":"2017 Infiniti QX60 recall","slug":"2017-infiniti-qx60-recall"},{"id":1658,"name":"2017-2018 Nissan Pathfinder recall","slug":"2017-2018-nissan-pathfinder-recall"},{"id":1660,"name":"Nissan brake fluid leak","slug":"nissan-brake-fluid-leak"}],"categories":[{"id":40,"name":"Infiniti","slug":"infiniti","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/infiniti_RM.png"},{"id":14,"name":"Nissan","slug":"nissan-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/nissan_RM.png"}]},{"id":16002,"title":"Toyota Recalls 1 Million Toyota Prius Models Due to Fire Risk","link":"https://www.motorsafety.org/toyota-recalls-1-million-toyota-prius-models-due-to-fire-risk/","status":"publish","slug":"toyota-recalls-1-million-toyota-prius-models-due-to-fire-risk","excerpt":"<p>Toyota is recalling 192,000 of its 2016 to 2018 Prius hybrids that were sold in the U.S. due to a fire risk.</p>\n","description":"<p>&nbsp;</p>\n<p>Lilburn, Georgia – Sept. 15, 2018 – Toyota is recalling 192,000 of its 2016 to 2018 Prius hybrids that were sold in the U.S. due to a fire risk. According to a <a href=\"https://pressroom.toyota.com/releases/toyota+conducting+safety+recall+involving+certain+prius+vehicles.htm\">company press release</a>, wiring in the front of the vehicle may wear over time, potentially resulting in a short circuit, which could cause a fire.</p>\n<p>Affected vehicles include certain 2016 to 2018 Toyota Prius cars manufactured between June 2015 and May 2018. These vehicles are part of a larger 1 million vehicle worldwide recall, with the majority of the remaining vehicles sold in Japan, as well as some located in Canada, the U.K., Europe and Australia.</p>\n<h3>The Defect</h3>\n<p>These vehicles have an engine wire harness consisting of a bundle of wires wrapped in a protective sleeve. The wire harness is connected to the hybrid vehicle Power Control Unit, which controls electricity within the hybrid drivetrain. A portion of the wire harness can potentially contact the cover at this connection and wear over time. The resulting friction can cause an electrical short circuit, which can generate heat, leading to a vehicle fire.</p>\n<h3>Timeline of Events</h3>\n<p>As noted by <a href=\"https://www.consumerreports.org/car-recalls-defects/toyota-prius-recall-for-fire-risk/\">Consumer Reports</a> in early September, the National Highway Traffic Safety Administration (NHTSA) has stated that Toyota discovered the defect after a dealer in Japan reported &#8220;abnormal odor, smoke, and flames&#8221; from a customer&#8217;s vehicle. To date, Toyota says that a single warranty claim in the U.S. may be related to the issue, but this has not been confirmed.</p>\n<p>The recall covers all Toyota Prius and Prius Plug-in models built between June 2015 and May 2018, and also affects Toyota C-HR plug-in hybrid models sold in Europe, Japan, and Australia, but not in the U.S. Former Toyota recalls for Prius models over the past few years have included brake issues and software failures.</p>\n<h3>The Solution</h3>\n<p>According to Toyota, all repairs will be provided at no cost to customers. All known owners will receive a notification by first class mail starting in late October.</p>\n<p>For all involved vehicles, Toyota dealers have been instructed to check the engine wire harness assembly to see if a wire core is exposed. If there is visible exposure, the engine wire harness assembly will be replaced with a new one that includes a stronger protective sleeve. If a wire core is not currently exposed, specialized protective tape will be installed on the engine wire harness assembly to prevent wear at the point of contact.</p>\n<p>Owners may contact Toyota customer service at 1-800-331-4331. Customers can also access current information on open safety recalls by Toyota by entering their Vehicle Identification Number (VIN) at: <a href=\"http://www.toyota.com/recall\" target=\"_blank\" rel=\"noopener noreferrer\">www.toyota.com/recall</a>. or <a href=\"http://nhtsa.gov/recalls\" target=\"_blank\" rel=\"noopener noreferrer\">nhtsa.gov/recalls</a>.</p>\n<p>Owners may also connect with the National Highway Transportation Safety Administration through the agency&#8217;s toll-free Vehicle Safety Hotline at (888) 327-4236. The NHTSA campaign number for this recall is 18V579, or get more current information on current or potential recalls by entering their Vehicle Identification Number (VIN) at <a href=\"http://nhtsa.gov/recalls\" target=\"_blank\" rel=\"noopener noreferrer\">nhtsa.gov/recalls</a>.</p>\n<p>The recall is expected to begin in early October 2018. Toyota had no additional comment beyond their press release.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16002","createdAt":"2018-09-15T06:36:24.000Z","date_gmt":"2018-09-15T20:21:24.000Z","updatedAt":"2020-10-02T22:03:12.000Z","modified_gmt":"2020-10-03T11:48:12.000Z","display_date":"September 15, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2018,"month":9,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/09/2015-Toyota-Prius-768x512.jpg","alt_text":"","cld_public_id":"2015-Toyota-Prius","category":{"id":17,"name":"Toyota","slug":"toyota-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/toyota_ms.png"},"tags":[],"categories":[{"id":17,"name":"Toyota","slug":"toyota-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/toyota_ms.png"}]},{"id":15983,"title":"Ford Recalls Nearly 2 Million 2015-2018 Year F150 Pickup Trucks for Fire Risk","link":"https://www.motorsafety.org/ford-recalls-nearly-2-million-2015-2018-year-f150-pickup-trucks-for-fire-risk/","status":"publish","slug":"ford-recalls-nearly-2-million-2015-2018-year-f150-pickup-trucks-for-fire-risk","excerpt":"<p>Ford Motor Company is recalling almost 2 million F150 Regular Cab and SuperCrew Cab vehicles equipped with driver and front passenger seat belt pretensioners capable of creating “excessive” sparks, which could lead to a fire.</p>\n","description":"<p>&nbsp;</p>\n<p>Lilburn, Georgia – Sept. 10, 2018 – Ford Motor Company is recalling almost 2 million F150 Regular Cab and SuperCrew Cab vehicles equipped with driver and front passenger seat belt pretensioners capable of creating &#8220;excessive&#8221; sparks, which could lead to a fire, according to a <a href=\"https://media.ford.com/content/fordmedia/fna/us/en/news/2018/09/06/ford-issues-safety-recall-in-north-america-for-select-2015-18-fo.html\" target=\"_blank\" rel=\"noopener noreferrer\">Ford company press release</a>.</p>\n<p>Affected vehicles include:</p>\n<ul>\n<li>2015-18 Ford F-150 vehicles built at Dearborn Assembly Plant, March 12, 2014 through Aug. 23, 2018</li>\n<li>2015-18 Ford F-150 vehicles built at Kansas City Assembly Plant, Aug. 20, 2014 through Aug. 23, 2018</li>\n</ul>\n<p>Of the nearly 2 million affected vehicles, over 1.6 million are located in the U.S., with the rest registered across Canada and Mexico.</p>\n<h3>The Defect</h3>\n<p>Seat belt pretensioners, like many other vehicle safety devices (such as airbags), are triggered by a tiny explosive that allow only a split second to elapse between a collision and deployment of the safety feature. The explosive itself is set off by a crash, and in the case of seat belt pretensioners, the feature design allows the seat belt to instantly tighten to provide more protection for the seat occupant. The seat belts work in tandem with the airbags to reduce the likelihood of injury, securing the driver and passenger in position and limiting excessive movement.</p>\n<p>However, Ford&#8217;s investigation found that some front seat belt pretensioners in specific F150 Regular Cab and SuperCrew Cab vehicles can generate excessive sparks when they deploy. If sufficient sparks are present, it is possible for gases exhausted inside the lower portion of the B-pillar by the pretensioners to ignite. Once the gas ignites, components behind the B-pillar (including insulation and carpet) can subsequently catch fire and may lead to the&nbsp;destruction of the entire vehicle.</p>\n<h3>Timeline of Events</h3>\n<p>As <a href=\"https://www.consumerreports.org/car-safety/ford-f-150-seat-belt-fires-spur-nhtsa-investigation/\" target=\"_blank\" rel=\"noopener noreferrer\">Consumer Reports noted in early August</a>, the NHTSA opened an investigation into the F150 after five consumer complaints about fires were filed with the agency. It was reported that the fires began inside the pillar housing the seat belt mechanism. All five vehicles had been involved in a crash immediately preceding the start of the fires. Four incidents included airbag deployment, and three of the trucks were a total loss.</p>\n<p>Ford claims there have been 17 reports of smoke or fire in the U.S. and six in Canada, although the manufacturer says they are not aware of any injuries or additional accidents associated with the defect. It is unusual for a recall to be issued after so few reports, but the ramifications of each incident are significant enough to trigger a recall.</p>\n<h3>The Solution</h3>\n<p>According to Ford, all repairs will be provided at no cost to customers. Dealers have been instructed to remove insulation material from the B-pillar trim, remove remnants of wiring harness tape in the B-pillar area, and apply heat-resistant tape to the carpet and its insulation. Dealers have also been instructed to modify the back interior panels of Regular Cab vehicles.</p>\n<p>F-150 owners should not stop using their seat belts, according to the automotive safety engineer at Consumer Reports, as all major incidents have occurred only after a crash, and most after a crash severe enough to deploy the airbag in the vehicle. The risk of injury from not wearing a seat belt is deemed much higher than that of a potential fire following a severe crash.</p>\n<p>There are approximately 1,995,776 vehicles in North America affected by this recall. Of these, 1,619,112 vehicles have been identified as being registered in the U.S. and its federalized territories. An additional 339,884 are currently in Canada and 36,780 in Mexico.</p>\n<p>Owners may contact Ford customer service at 1-866-436-7332. The Ford reference number for this recall is 18S27. Owners may also connect with the National Highway Transportation Safety Administration through the agency&#8217;s toll-free Vehicle Safety Hotline at (888) 327-4236 The NHTSA campaign number for this recall is 18V568000. The recall is expected to begin Sept. 24, 2018. Ford had no additional comment beyond their press release.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=15983","createdAt":"2018-09-10T00:49:49.000Z","date_gmt":"2018-09-10T14:34:49.000Z","updatedAt":"2020-10-02T22:04:06.000Z","modified_gmt":"2020-10-03T11:49:06.000Z","display_date":"September 10, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2018,"month":9,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/09/2011-ford-f-150-768x434.jpg","alt_text":"","cld_public_id":"2011-ford-f-150","category":{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"},"tags":[],"categories":[{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"}]}]