[{"id":16192,"title":"Mercedes Benz Recalls More Than Four Thousand Vehicles for Incorrect Battery Covers","link":"https://www.motorsafety.org/mercedes-benz-recalls-more-than-four-thousand-vehicles-for-incorrect-battery-covers/","status":"publish","slug":"mercedes-benz-recalls-more-than-four-thousand-vehicles-for-incorrect-battery-covers","excerpt":"<p>Mercedes-Benz USA, LLC (MBUSA) is recalling certain 2018 Mercedes-Benz C300 4Matic Coupe, C300 4Matic Cabrio, E300, E300 4Matic, C300, C300 4Matic, C300 Coupe and C300 Cabrio vehicles due to fire risk.</p>\n","description":"<p>Laguna Hills, CA – October 31, 2018 – Mercedes-Benz USA, LLC (MBUSA) is recalling certain 2018 Mercedes-Benz C300 4Matic Coupe, C300 4Matic Cabrio, E300, E300 4Matic, C300, C300 4Matic, C300 Coupe and C300 Cabrio vehicles. A documentation error may have resulted in a potentially incorrect battery cover to be installed on the starter battery. This recall affects 4,073 vehicles.</p>\n<h3>The Defect</h3>\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V725-7808.PDF\">NHTSA Recall Safety Report</a>, Daimler AG (&#8220;DAG&#8221;), the manufacturer of Mercedes-Benz vehicles, has determined that on certain 2018 C-Class (205 platform) and E-Class vehicles (213 platform) vehicles, an incorrect cover for the starter battery could have been installed. The incorrect cover may not have the required geometry to provide protection for live electrical components.</p>\n<p>Since the cover for the starter battery may not cover the live positive electrical wire, in certain crashes, the vehicle&#8217;s strut brace may deform and short circuit the battery. If the battery is shorted, on-board electrical system might not be able to support post-crash functions (such as emergency door unlocking from the outside by an emergency responder, or activation of hazard warning lamps). Unlocking and opening of the doors from the inside is not affected. A short circuit could also lead to an increased risk of fire.</p>\n<h3>Timeline of Events</h3>\n<p>DAG&#8217;s initial investigations were based on a report from the production plant in September 2018, regarding the installation of wrong positive pole covers for the starter battery. In October 2017, a documentation error following a design change was identified as the root cause of the installation of an incorrect starter battery cover, and the range of potentially affected vehicles was identified by the end of 2018.</p>\n<p>Multiple analyses were performed to evaluate possible consequences of the faulty installation, revealing that an incorrect battery cover might not provide the necessary covering for a live electrical cable on the battery. Several standard crash test scenarios were analyzed in detail, and it was determined that in specific crash situations with a heavy deformation of the brace strut, the strut might contact the electrical cable on the starter battery, increasing fire risk. The voluntary recall was ordered at in October 2018.</p>\n<h3>The Solution</h3>\n<p>As a precautionary measure an authorized Mercedes-Benz dealer will replace the positive pole cover on the affected vehicles, free of charge. MBUSA will notify owners by mail. The recall is expected to begin November 23, 2018. Owners may contact MBUSA customer service at 1-800-367-6372. Owners may also call the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153). The NHTSA Campaign Number for this recall is 18V- 725.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16192","createdAt":"2018-10-31T09:08:16.000Z","date_gmt":"2018-10-31T22:53:16.000Z","updatedAt":"2020-10-01T13:14:53.000Z","modified_gmt":"2020-10-02T02:59:53.000Z","display_date":"October 31, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2018,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/10/2016-white-Mercedes-benz-sedan-model-C300-768x383.jpg","alt_text":"","cld_public_id":"2016-white-Mercedes-benz-sedan-model-C300","category":{"id":5,"name":"Mercedes-Benz","slug":"mercedes-benz-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mercedes_RM.png"},"tags":[],"categories":[{"id":5,"name":"Mercedes-Benz","slug":"mercedes-benz-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mercedes_RM.png"}]},{"id":16181,"title":"Ford Recalls More Than One Million Vehicles for Stalling Issues","link":"https://www.motorsafety.org/ford-recalls-more-than-one-million-vehicles-for-stalling-issues/","status":"publish","slug":"ford-recalls-more-than-one-million-vehicles-for-stalling-issues","excerpt":"<p>Ford Motor Company (Ford) is recalling certain 2012-2018 Ford Focus vehicles with a 2.0L GDI or 2.0L GTDI engine due to an issue with the fuel vapor management system.</p>\n","description":"<p>Laguna Hills, CA – October 30, 2018 – Ford Motor Company (Ford) is recalling certain 2012-2018 Ford Focus vehicles with a 2.0L GDI or 2.0L GTDI engine due to an issue with the fuel vapor management system. This recall affects 1, 282,586 vehicles.</p>\n<h3>The Defect</h3>\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V735-2126.PDF\">NHTSA Recall Safety Report</a>, this safety recall involves affected vehicles equipped with 2.0L GDI and 2.0L GTDI engines may experience a malfunctioning Canister Purge Valve (CPV) and malfunctioning Powertrain Control Module (PCM) software. If the CPV sticks in &#8220;open&#8221; position, and the PCM software does not adequately detect the stuck-open CPV. the result can be excessive vacuum in the fuel vapor management system, potentially deforming the fuel tank.</p>\n<p>If the vehicle is affected, the customer may observe a Malfunction Indicator Light (MIL), inaccurate or erratic fuel gauge indication, drivability concerns or loss of motive power, but may have no warning at all in case of simultaneous malfunction. An engine stall while driving without warning or without the ability to restart, can increase the risk of a crash.</p>\n<h3>Timeline of Events</h3>\n<p>NHTSA contacted Ford on May 29, 2018 regarding consumer complaints alleging loss of motive power on 2012-2014 model year Ford Focus vehicles. Ford reviewed the complaints and associated internal data and discovered information indicating canister purge valve malfunction that could cause excessive vacuum within the fuel system during evaporative emissions monitoring.</p>\n<p>Consumer complaints included MIL illumination, fuel gauge inaccuracy, drivability issues, loss of motive power, or costly repairs. An investigative overview of the Focus fuel system operation and reviews of Ford&#8217;s data commenced, and on October 15, 2018, Ford&#8217;s Field Review Committee approved a field action. Ford is not aware of any reports of accident or injury related to this issue.</p>\n<h3>The Solution</h3>\n<p>Owners will be notified by mail and instructed to take their vehicle to a Ford or Lincoln dealer to have the Powertrain Control Module (PCM) reprogrammed with new software that will detect a malfunctioning CPV and prevent a potential excessive fuel vapor system vacuum condition from occurring. Dealers will check for Diagnostic Trouble Codes (DTC) and replace the CPV as necessary. If the CPV is replaced, dealers will inspect and replace the carbon canister, fuel tank and fuel delivery module as necessary. There will be no charge for this service.</p>\n<p>Until the vehicle is serviced for this concern customers are advised to maintain at least 1/2 tank of fuel. The recall is expected to begin December 10, 2018. Owners may contact Ford Customer service at 1-866-436-7332. Ford&#8217;s number for this recall is 18S32. Owners may also call the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153). The NHTSA Campaign Number for this recall is 18V- 735.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16181","createdAt":"2018-10-30T10:36:53.000Z","date_gmt":"2018-10-31T00:21:53.000Z","updatedAt":"2020-10-01T13:16:54.000Z","modified_gmt":"2020-10-02T03:01:54.000Z","display_date":"October 30, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2018,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/10/Red-2018-New-Ford-Focus-ST-Line-768x512.jpg","alt_text":"","cld_public_id":"Red-2018-New-Ford-Focus-ST-Line","category":{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"},"tags":[],"categories":[{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"}]},{"id":16183,"title":"Hyundai Recalls More Than 8,000 Santa Fe Vehicles for Faulty Airbags","link":"https://www.motorsafety.org/hyundai-recalls-more-than-8000-santa-fe-vehicles-for-faulty-airbags/","status":"publish","slug":"hyundai-recalls-more-than-8000-santa-fe-vehicles-for-faulty-airbags","excerpt":"<p>Hyundai  is recalling certain 2019 Hyundai Santa Fe vehicles. The Side Curtain Air Bag (SCAB) mounting bolts may interfere with and damage the air bags during deployment.</p>\n","description":"<p>Laguna Hills, CA – October 29, 2018 – Hyundai Motor America (Hyundai) is recalling certain 2019 Hyundai Santa Fe vehicles. The Side Curtain Air Bag (SCAB) mounting bolts may interfere with and damage the air bags during deployment. The number of units affected by this recall is 8,204, with a 100% estimated affected rate.</p>\n<h2>The Defect</h2>\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V715-2409.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">NHTSA Recall Safety Report</a>, this safety recall involves subject vehicles which are equipped with Side Curtain Airbags (&#8220;SCAB&#8221;) that were installed using bolts that could interfere with and damage the airbags during deployment. The bolts were produced with sharp corners on the hexagonal bolt head, increasing the risk of interference with the SCAB during installation. If the SCAB becomes damaged during deployment, the air bag may not inflate properly during a crash, increasing the risk of injury.</p>\n<h2>Timeline of Events</h2>\n<p>On August 8, 2018, Hyundai Motor Company (&#8220;HMC&#8221;) discovered a torn Side Curtain Airbag (&#8220;SCAB&#8221;) during an NCAP crash test conducted in Europe. The initial investigation revealed the SCAB could have become damaged due to interference with the bolts which were used to install the airbag and connect them to the body of the vehicle. HMC searched through past crash test records and did not find any previous instances of a deployed, torn SCAB.</p>\n<p>On September 3, 2018, HMC conducted internal crash testing. This test successfully replicated the damage to the SCAB and confirmed that it was caused by interference from the mounting bolts. HMC immediately notified all regional distributors of vehicles using these specific bolts, and subsequently convened its Technical Committee on October 2, 2018 and began voluntary safety recall to address the condition in the subject vehicles. Hyundai has not, to date, been made aware of any incidents, crashes, or injuries related to this defect.</p>\n<h2>The Solution</h2>\n<p>Hyundai will notify owners, and dealers will install a protective cover over the SCAB installation bolts, free of charge. The recall is expected to begin November 30, 2018. Owners may contact Hyundai customer service at 1-855-371-9460. Hyundai&#8217;s number for this recall is 177.</p>\n<p>Owners may also call the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153). The NHTSA Campaign Number for this recall is 18V-715.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16183","createdAt":"2018-10-29T10:36:51.000Z","date_gmt":"2018-10-30T00:21:51.000Z","updatedAt":"2020-10-22T03:45:02.000Z","modified_gmt":"2020-10-22T17:30:02.000Z","display_date":"October 29, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"18V715000","recall_date":"October 11, 2018"},"year":2018,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/10/white-2019-Hyundai-Snata-Fe-768x512.jpg","alt_text":"","cld_public_id":"white-2019-Hyundai-Snata-Fe","category":{"id":10,"name":"Hyundai","slug":"hyundai-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/hyundai_RM.png"},"tags":[{"id":1048,"name":"2019 Hyundai Santa Fe recall","slug":"2019-hyundai-santa-fe-recall"},{"id":1049,"name":"Hyundai side curtain air bag recall","slug":"hyundai-side-curtain-air-bag-recall"}],"categories":[{"id":10,"name":"Hyundai","slug":"hyundai-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/hyundai_RM.png"}]},{"id":16140,"title":"Mercedes Benz Recalls an Additional Nearly 4,000 Vehicles for Seat Belt Issues","link":"https://www.motorsafety.org/mercedes-benz-recalls-an-additional-nearly-4000-vehicles-for-seat-belt-issues/","status":"publish","slug":"mercedes-benz-recalls-an-additional-nearly-4000-vehicles-for-seat-belt-issues","excerpt":"<p>Mercedes-Benz is recalling roughly four thousand 2016-2018 Mercedes-Benz vehicles due to seat belts which can become unusable due to a missing element. This is in addition to over 100,000 vehicles recalled for the same issue in March of 2018.</p>\n","description":"<p>Laguna Hills, CA – October 26, 2018 – Mercedes-Benz USA, LLC. (MBUSA) is recalling roughly four thousand 2016-2018 Mercedes-Benz GLC300 and GLC300 4Matic, 2018 GLC350e and GLC63 AMG 4Matic and 2017-2018 GLC43 AMG 4Matic vehicles due to seat belts which can become unusable due to a missing element. This is in addition to over 100,000 vehicles recalled for the same issue in March of 2018.</p>\n<h3>The Defect</h3>\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V683-9514.PDF\">NHTSA Recall Safety Report</a>, an error during production led to felt strips not having been applied between the C-pillar and rear side paneling according to current production specification.&nbsp;&nbsp; The outboard rear seats&#8217; seat belt latch plates, which are intended to insert into the buckles, may retract into the interior paneling, becoming inaccessible and preventing vehicle occupants from being able to use them. The probability of occurrence is generally low, but if a rear seat passenger does not fasten the seatbelt, there is an increased risk of injury in the event of a crash.</p>\n<h3>Timeline of Events</h3>\n<p>In the beginning of February 2018, DAG launched an inquiry into two complaints of customers about the seat belt issue. The subsequent investigations showed that the described defect was reproducible under specific conditions, and that a geometrical design of the paneling parts was the root cause of the problem. The range of vehicles was examined for potential safety concerns, in early March 2018, DAG recalled 116,000 vehicles under recall notice 18V177. The current recall relates to an additional 4,079 vehicles identified in early September that also may not have had the necessary felt strips installed during the production process.</p>\n<h3>The Solution</h3>\n<p>MBUSA will notify owners, and dealers will install felt strips between the C-pillar and rear side paneling, free of charge. The recall is expected to begin November 2, 2018. Owners may contact MBUSA customer service at 1-800-367-6372. MBUSA&#8217;s number for this recall is 2018100002. Owners may also contact the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153). The NHTSA Campaign Number for this recall is 18V683000.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16140","createdAt":"2018-10-26T02:12:42.000Z","date_gmt":"2018-10-26T15:57:42.000Z","updatedAt":"2020-10-01T13:19:28.000Z","modified_gmt":"2020-10-02T03:04:28.000Z","display_date":"October 26, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2018,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/10/White-Mercedes-AMG-GLC-43-2017-768x512.jpg","alt_text":"","cld_public_id":"White-Mercedes-AMG-GLC-43-2017","category":{"id":5,"name":"Mercedes-Benz","slug":"mercedes-benz-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mercedes_RM.png"},"tags":[],"categories":[{"id":5,"name":"Mercedes-Benz","slug":"mercedes-benz-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mercedes_RM.png"}]},{"id":16138,"title":"BMW Recalls Over 100 Vehicles for Improperly Hardened Control Arm","link":"https://www.motorsafety.org/bmw-recalls-over-100-vehicles-for-improperly-hardened-control-arm/","status":"publish","slug":"bmw-recalls-over-100-vehicles-for-improperly-hardened-control-arm","excerpt":"<p>BMW of North America, LLC (BMW) is recalling certain 2019 BMW X6 sDrive35i, X6 xDrive35i, X6 xDrive50i and X6M vehicles due to rear upper control arms that may not have been produced by the suppliers to acceptable specifications.</p>\n","description":"<p>Laguna Hills, CA – October 25, 2018 – BMW of North America, LLC (BMW) is recalling certain 2019 BMW X6 sDrive35i, X6 xDrive35i, X6 xDrive50i and X6M vehicles. Approximately 108 vehicles are suspected to have been manufactured with rear upper control arms that possibly have not been produced by the suppliers to acceptable specifications. This recall affects several different BMW models, and units recalled were produced between September 10 and September 20, 2018.</p>\n<h3>The Defect</h3>\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V680-3433.PDF\">NHTSA Recall Safety Report</a>, certain BMW vehicles may have been produced with a faulty part. The rear upper control arm&#8217;s pivot bolt may not have been properly hardened during supplier production, due to a failure in the production process. An arm that was not produced to specifications could break, which could then affect vehicle handling and control, increasing the risk of a crash.</p>\n<h3>Timeline of Events</h3>\n<p>On September 12, 2018, several damaged control arms were noticed during vehicle assembly. The supplier was contacted, who was able to determine that certain rear upper control arms may not have been properly hardened, and identify all potentially affected parts to generate a list that was the matched with vehicle assembly records. Approximately 108 vehicles were identified, and on September 21, 2018, BMW decided to conduct a voluntary safety recall. BMW has not received any reports of any accidents or injuries related to this issue.</p>\n<h3>The Solution</h3>\n<p>Owners will be notified by First Class mail and instructed to take their vehicle to an authorized BMW center to have both rear upper control arms replaced for free. As affected vehicles are covered by the BMW New Vehicle Limited Warranty program, there is no need for owners to cover the cost and no need for a reimbursement program. Notification to owners is planned to begin and end on November 12. Owners may also contact the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153). The NHTSA Campaign Number for this recall is 18V680000.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16138","createdAt":"2018-10-25T02:12:49.000Z","date_gmt":"2018-10-25T15:57:49.000Z","updatedAt":"2020-10-01T13:22:23.000Z","modified_gmt":"2020-10-02T03:07:23.000Z","display_date":"October 25, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2018,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/10/Silver-2018-New-BMW-X6-M50d-768x512.jpg","alt_text":"","cld_public_id":"Silver-2018-New-BMW-X6-M50d","category":{"id":15,"name":"BMW","slug":"bmw-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/bmw_RM.png"},"tags":[],"categories":[{"id":15,"name":"BMW","slug":"bmw-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/bmw_RM.png"}]},{"id":16136,"title":"Chrysler Recalls Over 18,000 Jeep Wranglers for Faulty Weld","link":"https://www.motorsafety.org/chrysler-recalls-over-18000-jeep-wranglers-for-faulty-weld/","status":"publish","slug":"chrysler-recalls-over-18000-jeep-wranglers-for-faulty-weld","excerpt":"<p>Chrysler (FCA US LLC) is recalling certain 2018-2019 Jeep Wrangler vehicles due to improperly welded front track bar brackets. </p>\n","description":"<p>Laguna Hills, CA – October 24, 2018 – Chrysler (FCA US LLC) is recalling certain 2018-2019 Jeep Wrangler vehicles due to improperly welded front track bar brackets. The recall affects 18,005 vehicles produced between May 7 and August 21, 2018.</p>\n<h3>The Defect</h3>\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V675-1532.PDF\">NHTSA Recall Safety Report</a>, certain 2018-2019 MY Jeep Wrangler left hand drive vehicles may have been built with a front track bar bracket that featured an out-of-specification weld. This defect could potentially result in the bracket separating from the frame. The separation of the front track bar bracket from the frame may cause a reduction in steering response, which can cause vehicle crash without prior warning, or after any or a combination of the following: a front end noise, an off-center steering wheel position, a &#8220;Service Electronic Stability Control&#8221; message and an Electronic Stability Control light in the cluster.</p>\n<h3>Timeline of Events</h3>\n<p>On August 13, 2018, as a result of customer complaints related to the front track bar bracket separating from the frame, the FCA US LLC (&#8220;FCA US&#8221;) Vehicle Safety and Regulatory Compliance (&#8220;VSRC&#8221;) organization opened an investigation and meetings were subsequently conducted with the supplier to determine and correlate suspect part delivery dates with vehicle build dates and settle on corrective actions. The number of reports was sufficient that a voluntary recall was implemented. There have been no reports of injury due to this defect.</p>\n<h3>The Solution</h3>\n<p>Chrysler will notify owners of all suspected to be affected vehicles to inspect and repair the front track bar bracket welds as needed free of charge. The recall is expected to begin November 17, 2018. Owners may contact Chrysler customer service at 1-800-853-1403. Chrysler&#8217;s number for this recall is UA5. Owners may also contact the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153). The NHTSA Campaign Number for this recall is 18V675000.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16136","createdAt":"2018-10-24T02:12:50.000Z","date_gmt":"2018-10-24T15:57:50.000Z","updatedAt":"2020-10-27T23:19:34.000Z","modified_gmt":"2020-10-28T13:04:34.000Z","display_date":"October 24, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2018,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/10/2017-A-Jeep-Wrangler-768x512.jpg","alt_text":"","cld_public_id":"2017-A-Jeep-Wrangler","category":{"id":33,"name":"Jeep","slug":"jeep-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/jeep_ms.png"},"tags":[],"categories":[{"id":33,"name":"Jeep","slug":"jeep-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/jeep_ms.png"}]},{"id":16169,"title":"BMW Recalls More Than 2500 Vehicles for Defective Driveshaft Flanges","link":"https://www.motorsafety.org/bmw-recalls-more-than-2500-vehicles-for-defective-driveshaft-flanges/","status":"publish","slug":"bmw-recalls-more-than-2500-vehicles-for-defective-driveshaft-flanges","excerpt":"<p>BMW of North America, LLC (BMW) is recalling certain 2016-2017 BMW M3 Sedans, 2016-2017 BMW M4 and M4 GTS Coupes and 2017 BMW M4 Convertible vehicles due to potential driveshaft failure.</p>\n","description":"<p>Laguna Hills, CA – October 19, 2018 – BMW of North America, LLC (BMW) is recalling certain 2016-2017 BMW M3 Sedans, 2016-2017 BMW M4 and M4 GTS Coupes and 2017 BMW M4 Convertible vehicles due to potential driveshaft failure. The potential number of units affected by this recall is 2,661.</p>\n<h3>The Defect</h3>\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V713-3364.PDF\">NHTSA Recall Safety Report</a>, this safety recall involves an integral flange located in the driveshaft, which has insufficient long-term durability. Due to this defect, the connection between the driveshaft and the flange may loosen over time, to the point of separating completely.</p>\n<p>Loss of connection between the driveshaft and the flange means that, then drive torque may no longer be transmitted to the rear wheels. Lack of drive torque results in a loss of propulsion, increasing the risk of a crash. The driver may be alerted by noise and/or vibration from underneath the vehicle, which may increase over time and indicates the need to take the car to a dealership.</p>\n<h3>Timeline of Events</h3>\n<p>On July 9, 2018, BMW was informed of field incidents involving the driveshaft of M3 Sedan, M4 Coupe, and M4 Convertible vehicles. Drivers of these vehicles reported hearing noise, noticing vibration, and, in some cases, experiencing a loss of power. BMW subsequently requested the drive shafts in order to carry out comprehensive inspection and analysis, considering factors such as vehicle age and mileage, engine power / torque, and operating and environmental conditions.</p>\n<p>By late August, preliminary analyses suggested the integral driveshaft flange was the faulty part, and in September, further in-depth analyses were conducted taking into account vehicle construction, engine type, driveshaft design/build configuration history, and drive train geometry. Once individual case assessments were completed, these engineering analyses concluded that the integral flange may not have been produced with sufficient long-term durability characteristics during a specific production period, and separation from the drive shaft was a risk.</p>\n<p>Driveshaft production records and vehicle manufacturing information were utilized to identify the quantity and production date range of potentially affected vehicles, and on October 4, 2018, BMW issued a voluntary safety recall. BMW has not received any reports or been made aware of any accidents or injuries related to this issue.</p>\n<h3>The Solution</h3>\n<p>The drive shaft, containing the integral flange, will be replaced. Owners will be notified by First Class mail and instructed to take their vehicle to an authorized BMW center to have the drive shaft replaced at no charge. This process typically takes several hours. Owners who have replaced the drive shaft at their own expense prior to the recall notification may be eligible for reimbursement according to BMW Group&#8217;s reimbursement plan. The recall is expected to begin December 3, 2018; owners will be notified and advised whether or not their local dealership has available parts for the repair. If not, a second letter will advise owners when parts become&nbsp; Owners may contact BMW customer service at 1-800-525-7417.</p>\n<p>Owners may also call the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153). The NHTSA Campaign Number for this recall is 18V-713.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16169","createdAt":"2018-10-19T03:59:13.000Z","date_gmt":"2018-10-19T17:44:13.000Z","updatedAt":"2020-10-01T13:24:02.000Z","modified_gmt":"2020-10-02T03:09:02.000Z","display_date":"October 19, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2018,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/10/Black-2019-BMW-M4-768x512.jpg","alt_text":"","cld_public_id":"Black-2019-BMW-M4","category":{"id":15,"name":"BMW","slug":"bmw-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/bmw_RM.png"},"tags":[],"categories":[{"id":15,"name":"BMW","slug":"bmw-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/bmw_RM.png"}]},{"id":16147,"title":"Toyota Recalls Certain 2019 C-HR Vehicles Due to Improperly Tightened Axle Bearing Bolts","link":"https://www.motorsafety.org/toyota-recalls-certain-2019-c-hr-vehicles-due-to-improperly-tightened-axle-bearing-bolts/","status":"publish","slug":"toyota-recalls-certain-2019-c-hr-vehicles-due-to-improperly-tightened-axle-bearing-bolts","excerpt":"<p>Toyota Motor Engineering &#038; Manufacturing (Toyota) is recalling certain 2019 Toyota C-HR vehicles due to insufficiently tightened rear axle bearing bolts.</p>\n","description":"<p>Laguna Hills, CA – October 19, 2018 – Toyota Motor Engineering &amp; Manufacturing (Toyota) is recalling certain 2019 Toyota C-HR vehicles due to insufficiently tightened rear axle bearing bolts. The recall is expected to include 681 potentially affected vehicles, as no more than 0.1% of those included are expected to actually contain the defect. Toyota estimates this based on the results of inspections that, as of September 25th, out of 4500 inspected vehicles, there were 4 vehicles with the hub bearing bolts not tightened sufficiently.</p>\n<h3>The Defect</h3>\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V710-4902.PDF\">NHTSA Recall Safety Report</a>, the subject vehicles are equipped with left-hand and right-hand rear axle hub bearing assemblies. These are connected to the rear axle carrier subassemblies by four rear axle bearing bolts. One or more rear axle bearing bolts on a few vehicles may not have been sufficiently during the manufacturing process at one particular facility.</p>\n<p>Any insufficiently tightened bolt could become loose during vehicle operation and could eventually detach. Any detached bolt could damage the rear brake components during rotation, or result in a rear wheel detaching completely, Either of these events can cause a reduction of brake performance or a potential loss of vehicle stability, increasing the risk of a crash.</p>\n<h3>Timeline of Events</h3>\n<p>In late August 2018, Toyota received a field report from the Russia market about a 2018MY C-HR. The report indicated that of the four rear left-hand axle hub and bearing bolts, three were loose and one was missing altogether.&nbsp; Toyota Motor Manufacturing Turkey (TMMT) investigated the possibility of any abnormality in the hub and bearing assembly manufacturing process.</p>\n<p>A review revealed that during the production period spanning four days after a planned manufacturing facility shutdown in mid-June, tightening errors occurred sporadically in the hub bearing tightening process. This was confirmed to be due to several process and equipment changes in the hub and bearing assembly manufacturing process which caused a failure to confirm the torque and allowed the passing of parts to the next process.</p>\n<p>TMMT initiated a 100% tightening torque confirmation and introduced a series of improvements to prevent bolt tightening error and began to inspect the vehicles in Toyota inventory equipped with the hub and bearing assemblies that were produced in the indicated production period.</p>\n<p>An additional field report was received on September 18th from the UK market describing a C-HR vehicle produced outside the time period, with two loose and two missing rear left-hand axle bearing bolts. The investigation allowed an expanded time period for potential issues to be identified and confirmed, and Toyota decided to conduct a voluntary safety recall campaign in early October.</p>\n<h3>The Solution</h3>\n<p>All known owners of the subject vehicles will be notified by first class mail to return their vehicles to a Toyota dealer. The dealership will inspect all rear axle hub bearing bolts, and if a bolt is found to be loose or detached, the dealer will replace the rear axle hub bearing assembly and rear axle carrier sub-assembly with new parts, free of charge. The recall is expected to begin November 9, 2018. Owners may contact Toyota customer service at 1-888-270-9371. Toyota&#8217;s number for this recall is J0Y.</p>\n<p>Owners may also call the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153). The NHTSA Campaign Number for this recall is 18V-710.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16147","createdAt":"2018-10-19T02:51:08.000Z","date_gmt":"2018-10-19T16:36:08.000Z","updatedAt":"2020-10-01T13:26:05.000Z","modified_gmt":"2020-10-02T03:11:05.000Z","display_date":"October 19, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2018,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/10/Blue-2017-Toyota-C-HR-Hybrid-768x512.jpg","alt_text":"","cld_public_id":"Blue-2017-Toyota-C-HR-Hybrid","category":{"id":17,"name":"Toyota","slug":"toyota-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/toyota_ms.png"},"tags":[],"categories":[{"id":17,"name":"Toyota","slug":"toyota-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/toyota_ms.png"}]},{"id":16149,"title":"Ford Recalls 176 2017-2018 GT Vehicles Due to Fire Risk","link":"https://www.motorsafety.org/ford-recalls-176-2017-2018-gt-vehicles-due-to-fire-risk/","status":"publish","slug":"ford-recalls-176-2017-2018-gt-vehicles-due-to-fire-risk","excerpt":"<p>Ford Motor Company (Ford) is recalling certain 2017-2018 Ford GT vehicles due to a hydraulic fluid leak that increases the risk of fire.</p>\n","description":"<p>Laguna Hills, CA – October 18, 2018 – Ford Motor Company (Ford) is recalling certain 2017-2018 Ford GT vehicles due to a hydraulic fluid leak that increases the risk of fire. The potential number of units affected by this recall is 176.</p>\n<h3>The Defect</h3>\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V707-1746.pdf\">NHTSA Recall Safety Report</a>, a seal failure in the rear wing valve block may result in leakage of hydraulic fluid onto the exhaust. A hydraulic fluid leak in the presence of an ignition source can increase the risk of a fire.</p>\n<p>The subject component responsible for the risk was introduced into production in late December 2016, and the condition was remedied on all vehicles produced after July 31, 2018. All prior generation Ford GT vehicles are unaffected by this recall. Ford is aware of one vehicle fire report in Germany with no injuries.</p>\n<h3>Timeline of Events</h3>\n<p>On June 19, 2018, Ford&#8217;s Critical Concern Review Group (CCRG) reviewed a report of a vehicle fire that occurred in Germany on June 16, 2018. Subsequently, on June 25, 2018, Ford inspected the report vehicle in Germany. Ford was unable to identify the cause of the fire, and Ford&#8217;s CCRG subsequently conducted a review of field data and warranty claims, the vehicle inspection, and design and manufacturing process data, accompanies by an extensive engineering investigation, laboratory testing, and.</p>\n<p>By the end of September 2018, the investigation found that seal specifications could be exceeded for hydraulic pressure in the rear wing valve block assembly, and on October 1, 2018, Ford&#8217;s Field Review Committee reviewed the concern and approved a field action, issuing a recall for affected vehicles. Ford is aware of one vehicle fire report in Germany with no injuries.</p>\n<h3>The Solution</h3>\n<p>Ford will notify owners, and dealers will perform a software update to the fully integrated vehicle controller, which eliminates the possibility of excessive pressure in the valve block assembly. Some vehicles will have a rear wing hydraulic check valve installed and will have the O-rings and the filter replaced, if needed. The repairs will be performed free of charge. The recall is expected to begin November 26, 2018. Owners may contact Ford customer service at 1-866-436-7332. Ford&#8217;s number for this recall is 18S29.</p>\n<p>Owners may also call the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153). The NHTSA Campaign Number for this recall is 18V-707.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16149","createdAt":"2018-10-18T02:51:07.000Z","date_gmt":"2018-10-18T16:36:07.000Z","updatedAt":"2020-10-01T13:26:45.000Z","modified_gmt":"2020-10-02T03:11:45.000Z","display_date":"October 18, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2018,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/10/2017-Black-Ford-Mustang-GT-convertible-768x512.jpg","alt_text":"","cld_public_id":"2017-Black-Ford-Mustang-GT-convertible","category":{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"},"tags":[],"categories":[{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"}]},{"id":16151,"title":"Hyundai Recalls Over 10,000 Hybrid Vehicles Due to Fire Hazard","link":"https://www.motorsafety.org/hyundai-recalls-over-10000-hybrid-vehicles-due-to-fire-hazard/","status":"publish","slug":"hyundai-recalls-over-10000-hybrid-vehicles-due-to-fire-hazard","excerpt":"<p>Hyundai Motor America (Hyundai) is recalling certain 2017-2018 Hyundai Ioniq Hybrid and 2018 Ioniq Plug-In Hybrid vehicles due to an electric defect that causes a fire hazard.</p>\n","description":"<p>Laguna Hills, CA – Hyundai Motor America (Hyundai) is recalling certain 2017-2018 Hyundai Ioniq Hybrid and 2018 Ioniq Plug-In Hybrid vehicles due to an electric defect that causes a fire hazard. The potential number of units affected by this recall is 10,575.</p>\n<h2>The Defect</h2>\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V704-3002.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">NHTSA Recall Safety Report</a>, the subject vehicles contain a Power Relay Assembly (&#8220;PRA&#8221;) which is located underneath the rear seat. The PRA is equipped with a main relay, which may have been installed too loosely during assembly.</p>\n<p>If the PRA operates in this condition, a loose connection between the main power relay contacts could increase electrical resistance. This electrical resistance can generate excessive heat and increase the risk of a fire. Drivers may see illumination of the HEV warning light while driving and/or experience an inability to start their vehicle, which is an indicator of this problem in affected vehicles.</p>\n<h2>Timeline of Events</h2>\n<p>On March 7, 2018, HMC received a report indicating that heat damage had occurred on the rear seat of model year 2017 Kia Niro sold in the Korean market. HMC immediately began testing under various driving conditions and maneuvers to determine the cause of the damage, but as of June 2018, was unable to replicate the damage and thus began to focus its investigation on component testing with the supplier.</p>\n<p>This testing concluded in August 2018 and again the damage could not be replicated by component bench testing alone. However, HMC conducted additional testing independently, and did manage to replicate the damage on September 18, 2018. Upon inspection of the test vehicle&#8217;s damaged rear seat, it was discovered that the damage was caused by increased heat generated by the PRA. The PRA was subsequently examined, and it was discovered that the main relay was loosely connected. This indicated that the heat was the result of increased electrical resistance caused by a loose contact between the main relay terminals.</p>\n<p>HMC also noted that the main relay had lower manufacturing specifications for terminal tightening torque and contact pressure, due to being coerced from a former supplier, and that the current supplier was providing main relays which had been produced with higher specifications for terminal tightening torque and contact pressure. The vehicles potentially affected by the former batch of relays was identified via production and supplier delivery records.</p>\n<p>All regional distributors of the affected vehicles have informed of these findings, and October 2, 2018, HMC decided to conduct a voluntary safety recall to address the condition in the subject vehicles. Hyundai is unaware of any incidents, crashes, or injuries related to the faulty relays.</p>\n<h2>The Solution</h2>\n<p>Hyundai will notify owners, and dealers will inspect the Power Relay Assembly (PRA) for damage. If no damage is found, the main relay will be replaced. If damage is found, the PRA will be replaced. These repairs will be performed free of charge. The recall is expected to begin November 30, 2018. Owners may contact Hyundai customer service at 1-855-371-9460. Hyundai&#8217;s number for this recall is 178.</p>\n<p>Owners may also call the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153). The NHTSA Campaign Number for this recall is 18V-704.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16151","createdAt":"2018-10-17T02:51:06.000Z","date_gmt":"2018-10-17T16:36:06.000Z","updatedAt":"2020-10-22T03:48:56.000Z","modified_gmt":"2020-10-22T17:33:56.000Z","display_date":"October 17, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"18V704000","recall_date":"October 25, 2018"},"year":2018,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/10/Blue-2018-Hyundai-Ioniq-768x512.jpg","alt_text":"","cld_public_id":"Blue-2018-Hyundai-Ioniq","category":{"id":10,"name":"Hyundai","slug":"hyundai-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/hyundai_RM.png"},"tags":[{"id":1621,"name":"2017-2018 Hyundai Ioniq recall","slug":"2017-2018-hyundai-ioniq-recall"},{"id":498,"name":"Hyundai fire risk","slug":"hyundai-fire-risk"},{"id":1622,"name":"Hyundai hybrid powertrain recall","slug":"hyundai-hybrid-powertrain-recall"}],"categories":[{"id":10,"name":"Hyundai","slug":"hyundai-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/hyundai_RM.png"}]},{"id":16153,"title":"Daimler Recalls More Than 500 School Buses Due to Inadequate Emergency Egress","link":"https://www.motorsafety.org/daimler-recalls-more-than-500-school-buses-due-to-inadequate-emergency-egress/","status":"publish","slug":"daimler-recalls-more-than-500-school-buses-due-to-inadequate-emergency-egress","excerpt":"<p>Daimler Trucks North America LLC (DTNA) is recalling certain 2016-2019 Thomas Built Buses Minotour school buses with 36&#8243; or 39&#8243; wide seats due emergency exit doors which do not meet requirements.</p>\n","description":"<p>Laguna Hills, CA – October 17, 2018 – Daimler Trucks North America LLC (DTNA) is recalling certain 2016-2019 Thomas Built Buses Minotour school buses with 36&#8243; or 39&#8243; wide seats due emergency exit doors which do not meet requirements. The recall is expected to affect 525 vehicles which may be subject to the defect.</p>\n<h3>The Defect</h3>\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V698-6173.PDF\">NHTSA Recall Safety Report,</a> the rear emergency exit door may not open wide enough to meet the unobstructed emergency egress area requirements do to interference from a specific seat configuration. If the emergency exit door does not open wide enough, it may limit the ability to exit the bus, increasing the risk of injury in the event of an emergency.</p>\n<h3>Timeline of Events</h3>\n<p>In June of 2018, while using a parallelepiped fixture to check the minimum opening for emergency egress during the production process, Thomas Built Buses identified a bus that did not meet unobstructed area requirements for emergency egress. During the check, a minor interference was identified at the upper hinged side of the door.</p>\n<p>DTNA opened an investigation to determine the scope of the issue, and the bus was fully inspected to determine if the issue was related to manufacturing or design; however, the bus was determined to be properly manufactured. The next step was to evaluate all of the different seating configurations available on the Minotour to determine compliance with emergency egress requirements.</p>\n<p>The issue was narrowed down to 36&#8243; and 39&#8243; wide seats from a specific manufacturer. DTNA discovered that the obstruction only occurs when the 36&#8243; and 39&#8243; seats from this manufacturer are installed within 10&#8243; of the back wall. DTNA subsequently searched their full production records to identify buses with these seating configurations, and on October 5, 2018 DTNA chose to conduct a voluntary recall of certain Thomas Built Buses Minotour school buses that had the potential for noncompliance with emergency egress requirements.</p>\n<h3>The Solution</h3>\n<p>DTNA will notify owners, and dealers will modify the rear door slide system, increasing the angle that the door can open, free of charge. The recall is expected to begin December 3, 2018. Owners may contact DTNA customer service at 1-800-547-0712. DTNA&#8217;s number for this recall is FL-797.</p>\n<p>Owners may also call the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153). The NHTSA Campaign Number for this recall is 18V-698.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16153","createdAt":"2018-10-17T02:51:05.000Z","date_gmt":"2018-10-17T16:36:05.000Z","updatedAt":"2020-10-01T13:29:28.000Z","modified_gmt":"2020-10-02T03:14:28.000Z","display_date":"October 17, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2018,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/10/Daimler-bus-768x512.jpg","alt_text":"","cld_public_id":"Daimler-bus","category":null,"tags":[],"categories":[]},{"id":16155,"title":"Collins Recalls Nearly 3,000 School Buses for Insufficient Leg protection","link":"https://www.motorsafety.org/collins-recalls-nearly-3000-school-buses-for-insufficient-leg-protection/","status":"publish","slug":"collins-recalls-nearly-3000-school-buses-for-insufficient-leg-protection","excerpt":"<p>Collins Bus Corporation (Collins) is recalling certain 2011-2018 Collins SL, SH, DH, DE, and TH school buses, built on Promaster chassis due to insufficient passenger leg protection.</p>\n","description":"<p>Laguna Hills, CA – October 16, 2018 – Collins Bus Corporation (Collins) is recalling certain 2011-2018 Collins SL, SH, DH, DE, and TH school buses, built on Promaster chassis, equipped with CE White/HSM SB11-30&#8243; series, standard, unbelted, school bus seats, or SB11-30&#8243; series school bus seats with lap belts only, due to insufficient passenger leg protection.</p>\n<h3>The Defect</h3>\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V696-6667.PDF\">NHTSA Recall Safety Report</a>, HSM Solution has determined that SB11-30&#8243; and 26&#8243; School bus seats not installed in the rear row of a school bus as manufactured by CE White/ HSM solutions may not comply with the impact requirements of CFR 49.571.222.</p>\n<p>Specifically, the foam in the knee impact area of the lower seat back may be insufficient, and may not absorb enough impact in the event of a crash. If the seat foam does not absorb enough impact energy, it can increase the risk of injury in the event of a crash.</p>\n<h3>Timeline of Events</h3>\n<p>On October 1, 2018 Collins was notified by Hickory Springs Manufacturing Company HSM (recall 18E056), about a potential safety issue in SB 11-30&#8243; and SB11-26&#8243; Series School bus seats. The seats not installed in the rear row of the school buses fail to conform to Federal Motor vehicle safety standard No. 571.222&#8243; School Bus Passenger Seating and Crash Protection&#8221;, specifically the requirements for leg protection zones.</p>\n<p>The affected population was determined to include a potential 2,667 vehicles with SB11-30&#8243; seats manufactured by HSM Solutions/CE White Company which had been shipped between April 24, 2011 and July 17, 2018, or SB11-26&#8243; seats manufactured by HSM Solution/CE white company, shipped between April 24, 2011 and September 7, 2018.&nbsp; Collins issued a voluntary recall to add foam to the seats.</p>\n<h3>The Solution</h3>\n<p>Collins will notify owners, and dealers will install additional foam into the seat backs, free of charge. The recall is expected to begin October 31, 2018. Owners may contact Collins customer service 1-800-533-1850, extension 424. Collins&#8217; number for this recall is 18e056.</p>\n<p>HSM Solutions/CE White will facilitate the repairs via with the Collins dealers or customer. HSM will provide parts and a service repair procedures &#8220;SRP1801-0013 (for 30&#8243;Seat) and SRP1801-0014 (for 26&#8243;seat) which will provide instruction on how the repair must be conducted, to the servicing agent upon receipt of a completed HSM &#8220;Recall Parts Kit Order Card&#8221;. The expected out of service time necessary to affect repairs is 10 mins per seat.</p>\n<p>Owners may also call the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153). The NHTSA Campaign Number for this recall is 18V-696.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16155","createdAt":"2018-10-16T02:50:58.000Z","date_gmt":"2018-10-16T16:35:58.000Z","updatedAt":"2020-10-01T13:30:38.000Z","modified_gmt":"2020-10-02T03:15:38.000Z","display_date":"October 16, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2018,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/10/Collins-bus-768x512.jpg","alt_text":"","cld_public_id":"Collins-bus","category":null,"tags":[],"categories":[]},{"id":16157,"title":"Toyota Recalls More Than 168,000 Vehicles for Potential Airbag Malfunction","link":"https://www.motorsafety.org/toyota-recalls-more-than-168000-vehicles-for-potential-airbag-malfunction/","status":"publish","slug":"toyota-recalls-more-than-168000-vehicles-for-potential-airbag-malfunction","excerpt":"<p>Toyota Motor Engineering &#038; Manufacturing (Toyota) is recalling certain 2018-2019 Toyota Tundra and Sequoia vehicles and 2019 Toyota Avalon and Avalon Hybrid vehicles due to a potential issue with the air bag electronic control unit (ECU).</p>\n","description":"<p>Laguna Hills, CA – October 16, 2018 – Toyota Motor Engineering &amp; Manufacturing (Toyota) is recalling certain 2018-2019 Toyota Tundra and Sequoia vehicles and 2019 Toyota Avalon and Avalon Hybrid vehicles. The air bag electronic control unit (ECU) may erroneously detect a fault during the vehicle start-up self-check. If this occurs, the ECU may not deploy the airbags as intended, in the event of a crash. The defect affects in excess of a potential 168,000 vehicles.</p>\n<h3>The Defect</h3>\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V685-3603.pdf\">NHTSA Recall Safety Report</a>, due to inappropriate programming in the subject vehicles, the Airbag (SRS) ECU may erroneously detect a fault in one or more of the front or side SRS satellite sensors during a self-check that occurs at each vehicle start up. This condition will cause the vehicle to set a specific trouble code, disable the affected sensor(s), sound a warning buzzer, activate multiple warning lights, and display a message on the combination meter display. If a fault is erroneously detected, the Airbag ECU may not appropriately identify the crash condition if a crash occurs, and the airbags may not deploy as intended, significantly increasing the chance of injury.</p>\n<p>Toyota is unable to provide an estimate of the percentage of the vehicles to actually contain the noncompliance. Whether the condition will occur prior to first sale and constitute a noncompliance will differ depending on part variation and whether normal sensor variances will cause the inappropriate programming of the diagnostic function to set a specific trouble code in each case.</p>\n<h3>Timeline of Events</h3>\n<p>In early July 2018, Toyota received reports describing illumination of the SRS warning light, which was the result of one of a specific type of diagnostic trouble code (DTC) being set. The light was accompanied by a warning buzzer, master warning light illumination, and a message on the multi-information display. Toyota recovered replaced SRS satellite sensors and began an investigation.</p>\n<p>In mid-July 2018, the supplier performed bench testing of the sensors alone, and did not identify a fault. Testing was then conducted with the sensors connected to the entire SRS system including the ECU and, in some cases, the same DTCs related to the airbag sensors were recreated.</p>\n<p>In early August, a review of the Airbag ECU software identified that the parameters for this self-check were not correct for the type of satellite sensors used in the system, which could result in a failure of the self-check. Failure of the self-check could disable only the sensor which failed for that key cycle. Each ignition on cycle performs the self-check, and factors such as heat can affect whether the sensor will pass this check using the incorrect parameters.</p>\n<p>A study was initiated to evaluate how the SRS system would function in the event of a crash with any of these satellite sensors disabled. Based on the results of the investigation, the results of the aforementioned analysis, and the field information from the U.S. market indicating that this phenomenon could occur prior to first sale, on September 28, 2018, Toyota decided that the subject vehicles may not meet certain requirements and issued a voluntary recall to correct the problem.</p>\n<h3>The Solution</h3>\n<p>All known owners of the subject vehicles will be notified by first class mail to return their vehicles to a Toyota dealer. The dealers will update the software of the Airbag ECU at no cost to owners. As the owner notification letters will be mailed out well within the active period of the Toyota New Vehicle Limited Warranty, all involved vehicle owners for this recall would have been provided a repair at no cost under Toyota&#8217;s Warranty. The recall is expected to begin October 22, 2018.</p>\n<p>Owners may contact Toyota customer service at 1-888-270-9371. Toyota&#8217;s number for this recall is J0X. Owners may also call the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153). The NHTSA Campaign Number for this recall is 18V-685.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16157","createdAt":"2018-10-16T02:50:56.000Z","date_gmt":"2018-10-16T16:35:56.000Z","updatedAt":"2020-10-01T13:33:06.000Z","modified_gmt":"2020-10-02T03:18:06.000Z","display_date":"October 16, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2018,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/10/2019-Black-Toyota-Sequoia-768x511.jpg","alt_text":"","cld_public_id":"2019-Black-Toyota-Sequoia","category":{"id":17,"name":"Toyota","slug":"toyota-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/toyota_ms.png"},"tags":[],"categories":[{"id":17,"name":"Toyota","slug":"toyota-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/toyota_ms.png"}]},{"id":16159,"title":"Toyota Recalls More Than 80,000 Prius Hybrids for Vehicle Stall Problems","link":"https://www.motorsafety.org/toyota-recalls-more-than-80000-prius-hybrids-for-vehicle-stall-problems/","status":"publish","slug":"toyota-recalls-more-than-80000-prius-hybrids-for-vehicle-stall-problems","excerpt":"<p>Toyota Motor Engineering &#038; Manufacturing is recalling certain 2010-2014 Toyota Prius and 2012-2014 Toyota Prius V vehicles due to excessive voltage in the inverter which may cause the hybrid system to shut down and the vehicle to stall while being driven.</p>\n","description":"<p>Laguna Hills, CA – October 15, 2018 – Toyota Motor Engineering &amp; Manufacturing (Toyota) is recalling certain 2010-2014 Toyota Prius and 2012-2014 Toyota Prius V vehicles due to excessive voltage in the inverter which may cause the hybrid system to shut down and the vehicle to stall while being driven. This recall affected more than 80,000 vehicles, including ones subject to prior recalls.</p>\n<h3>The Defect</h3>\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V684-7527.pdf\">NHTSA</a> Recall Safety Report, the vehicles subject to this recall contain software used to control the Intelligent Power Module (IPM) within the inverter assembly. This module is part of the vehicle&#8217;s hybrid system. Certain characteristics of the software used to control the boost converter in the IPM could cause higher thermal stress than normal to occur in specific transistors in the IPM, specifically during high-load driving activities, such as accelerating during highway driving. Over time, stress could damage certain transistors.</p>\n<p>In limited instances, the motor/generator ECU could reset, or – if a specific transistor within the IPM fails in a certain way during a high-load driving condition &#8211; an abnormally high voltage could be generated. In either case, there is the possibility that the hybrid system could shut down instead of entering a failsafe driving mode, which could cause the vehicle to lose motive power while driving at higher speeds, increasing the risk of a crash. Drivers may be warned of transistor damage via the illumination of various warning lights and the display of a warning message on the instrument panel.</p>\n<h3>Timeline of Events</h3>\n<p>Between the month of January and March 2018, based on VOQs and other available information, NHTSA contacted Toyota about allegations of potential incidents where vehicles experienced a loss of motive power while driving at some time after having received the software updates from prior, related recalls (14V-053 and 15V-449.) Toyota began reviewing the information and recovering parts from the field.</p>\n<p>Toyota conducted a search of available data for vehicles involved in 14V-053 and 15V-449 and identified a limited number of instances where the data in connection with certain inverter-related trouble codes suggested a possible &#8220;ready off.&#8221; Based on an initial analysis of recovered failed parts, damage was observed in certain transistors. Toyota surveyed vehicles to identify the software version present in field vehicles, and, in those cases where an inverter failure occurred. Continued analysis of the recovered failed inverters and freeze frame data in a limited number of cases did identify an unexpected, abnormally high voltage value related to the hybrid boost converter.</p>\n<p>In September 2018, a design review of the software used to control the hybrid system components in addition to a review of the inverter circuit design identified a potential mechanism for the hybrid system to shutdown instead of entering a failsafe mode based on the observation of an abnormally high voltage in extremely rare cases. Toyota could not exclude the possibility that a limited population of vehicles did not successfully receive a software update in one or both of the ECUs, and the company decided to conduct a voluntary safety recall campaign.</p>\n<h3>The Solution</h3>\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RMISC-18V684-8461.pdf\">Toyota Defect Information Report</a>, Toyota will notify owners, and dealers will update the software for the motor/generator control electronic control unit (ECU) and the hybrid control ECU as necessary, free of charge. Interim notices informing owners of the safety risk began October 22, 2018. Owners will receive a second notice when the remedy becomes available.</p>\n<p>Owners may contact Toyota customer service at 1-888-270-9371. Toyota&#8217;s number for this recall is J0V. Owners may also call the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153). The NHTSA Campaign Number for this recall is 18V-684. The software updates in this recall are needed even if the vehicle had the software previously updated under recalls 14V-053 or 15V-449.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16159","createdAt":"2018-10-15T02:50:54.000Z","date_gmt":"2018-10-15T16:35:54.000Z","updatedAt":"2020-10-02T21:41:14.000Z","modified_gmt":"2020-10-03T11:26:14.000Z","display_date":"October 15, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2018,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/10/Orange-2012-Toyota-Prius-C-768x512.jpg","alt_text":"","cld_public_id":"Orange-2012-Toyota-Prius-C","category":{"id":17,"name":"Toyota","slug":"toyota-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/toyota_ms.png"},"tags":[],"categories":[{"id":17,"name":"Toyota","slug":"toyota-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/toyota_ms.png"}]},{"id":16110,"title":"Toyota Recalls Multiple 2018-2019 Vehicles Due to Air Bag Deployment Issue","link":"https://www.motorsafety.org/toyota-recalls-multiple-2018-2019-vehicles-due-to-air-bag-deployment-issue/","status":"publish","slug":"toyota-recalls-multiple-2018-2019-vehicles-due-to-air-bag-deployment-issue","excerpt":"<p>Toyota Motor Engineering &#038; Manufacturing (Toyota) is recalling certain 2018-2019 Toyota Tundra and Sequoia vehicles and 2019 Toyota Avalon and Avalon Hybrid vehicles due to a programming error that could affect air bag deployment.</p>\n","description":"<p>Laguna Hills, CA – October 12, 2018 – Toyota Motor Engineering &amp; Manufacturing (Toyota) is recalling certain 2018-2019 Toyota Tundra and Sequoia vehicles and 2019 Toyota Avalon and Avalon Hybrid vehicles due to a programming error that could affect air bag deployment.</p>\n<h3>The Defect</h3>\n<p>According to the NHTSA Safety Recall Report, Toyota has determined that due to inappropriate programming of the air bag electronic control unit (ECU), a fault may be erroneously detected and disable a front or side supplemental restraint system (SRS) sensor.</p>\n<p>If this were to occur, the air bag ECU may not appropriately identify a crash condition, the air bags may not deploy as intended, and as a result, this could lead to an increased risk of injury in the event of a crash.</p>\n<h3>Timeline of Events</h3>\n<p>Toyota received reports describing illumination of the SRS warning light accompanied by a warning buzzer, master warning light illumination, and a message on the multi-information display, and began an investigation in June 2018.</p>\n<p>A review of the Airbag ECU software identified that parameters for a routine self-check were not correct for the type of satellite sensors used in this system. This can result in a failure of the self-check, which will disable only the sensor which failed for that key cycle. Factors such as heat can affect whether the sensor will pass this check using the incorrect parameters.</p>\n<p>Based on the results of the investigation, Toyota decided that the subject vehicles may not meet certain mandated requirements and issued a recall.</p>\n<h3>The Solution</h3>\n<p>All known owners of the subject vehicles will be notified by first class mail to return their vehicles to a Toyota dealer. The dealers will update the software of the Airbag ECU at no cost to owners. As the owner notification letters will be mailed out well within the active period of the Toyota New Vehicle Limited Warranty, all involved vehicles are assumed to be covered for this repair under Toyota&#8217;s Warranty.</p>\n<p>The recall is expected to begin October 22, 2018. Owners may contact Toyota customer service at 1-888-270-9371. Toyota&#8217;s number for this recall is J0X. Owners may also contact the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153). The NHTSA number for this recall is 18V-685.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16110","createdAt":"2018-10-12T02:57:39.000Z","date_gmt":"2018-10-12T16:42:39.000Z","updatedAt":"2020-10-02T21:43:16.000Z","modified_gmt":"2020-10-03T11:28:16.000Z","display_date":"October 12, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2018,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/10/black-Toyota-Tundra-2014-768x512.jpg","alt_text":"","cld_public_id":"black-Toyota-Tundra-2014","category":{"id":17,"name":"Toyota","slug":"toyota-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/toyota_ms.png"},"tags":[],"categories":[{"id":17,"name":"Toyota","slug":"toyota-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/toyota_ms.png"}]},{"id":16326,"title":"Kia recalls 27,000 Niro Hybrids Over Electrical Fire Concerns","link":"https://www.motorsafety.org/kia-recalls-27000-niro-hybrids-over-electrical-fire-concerns/","status":"publish","slug":"kia-recalls-27000-niro-hybrids-over-electrical-fire-concerns","excerpt":"","description":"<div class=\"video-wrapper feature-video\"><iframe src=\"https://player.vimeo.com/video/307150825?app_id=122963\" width=\"1170\" height=\"658\" frameborder=\"0\" title=\"Kia recalls 27,000 Niro Hybrids Over Electrical Fire Concerns\" allow=\"autoplay; fullscreen\" allowfullscreen></iframe></div>\n<p><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16326","createdAt":"2018-10-08T08:39:48.000Z","date_gmt":"2018-10-08T22:24:48.000Z","updatedAt":"2020-10-22T03:50:04.000Z","modified_gmt":"2020-10-22T17:35:04.000Z","display_date":"October 08, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2018,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/04/motorsafetylogo_small.png","alt_text":"","cld_public_id":"motorsafetylogo_small","category":null,"tags":[],"categories":[]},{"id":16096,"title":"Jaguar Land Rover Recalls Nearly 100 Vehicles for Malfunctioning AEB Software","link":"https://www.motorsafety.org/jaguar-land-rover-recalls-nearly-100-vehicles-for-malfunctioning-aeb-software/","status":"publish","slug":"jaguar-land-rover-recalls-nearly-100-vehicles-for-malfunctioning-aeb-software","excerpt":"<p>Jaguar Land Rover North America, LLC (Land Rover) is recalling certain 2018 Land Rover Range Rover, Land Rover Range Rover Sport and Land Rover Discovery vehicles due to malfunction of the Autonomous Emergency Braking (AEB) system.</p>\n","description":"<p>Laguna Hills, CA – October 8, 2018 – Jaguar Land Rover North America, LLC (Land Rover) is recalling certain 2018 Land Rover Range Rover, Land Rover Range Rover Sport and Land Rover Discovery vehicles due to malfunction of the Autonomous Emergency Braking (AEB) system. The defect is believed to only affect small batches in each vehicle group, totaling less than 100 vehicles.</p>\n<h2>The Defect</h2>\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V625-1654.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">NHTSA Safety Recall Report</a>, concern has been identified on certain 2018 Land Rover Range Rover, Range Rover Sport and Discovery vehicles where the Autonomous Emergency Braking (AEB) feature will not be available. A warning message will not be displayed on the instrument cluster to inform the driver AEB is unavailable. If the AEB system is disabled both in function and in respect to warning the driver that the system is not functional, it could lead to an increased risk of a crash.</p>\n<h2>Timeline of Events</h2>\n<p>The Jaguar Land Rover&#8217;s Product Safety and Compliance Committee (PSCC) became aware of the potential issue in June 2018 following an Electronic Product Quality Report (EPQR) from an approved repairer. The report stated that the Autonomous Emergency Braking (AEB) feature was not operating as designed. Engineering subsequently collected and researched claims of a similar nature, which showed after an upgrade to the vehicle software, the AEB failed to continue to operate correctly on 2018MY vehicles. A Field Service Action (FSA) released to the market had caused a corruption of the AEB functionality.</p>\n<p>Approved repairers were contacted to suspend the use of the FSA at the end of May 2018, but a number of 2018 MY vehicles had already received the FSA since it had been released early in the month. Engineering requested a change to the software to be developed. The Jaguar Land Rover Recall Determination Committee (RDC) determined that vehicles in this condition with no obvious related warning message displayed to the driver on the instrument cluster represented an unreasonable risk to safety. This led to the voluntary safety recall being conducted. Jaguar stated that there have been no reported accidents, injuries or fires as a result of the AEB malfunction on affected vehicles.</p>\n<h2>The Solution</h2>\n<p>Land Rover will notify owners, and dealers will update the vehicle software, free of charge. The recall is expected to begin November 9, 2018. Owners may contact Land Rover customer service at 1-800-637-6837, Option 9. Land Rover&#8217;s number for this recall is N227. Owners may also contact the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153). The NHTSA&#8217;s number for this recall is 18V-625.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16096","createdAt":"2018-10-08T05:27:41.000Z","date_gmt":"2018-10-08T19:12:41.000Z","updatedAt":"2021-01-04T10:26:42.000Z","modified_gmt":"2021-01-05T00:11:42.000Z","display_date":"October 08, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"18V625000","recall_date":"September 13, 2018","meta_title":"","meta_description":"","meta_keywords":"","custom_schema":""},"year":2018,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/10/Black-2016-Range-Rover-768x512.jpg","alt_text":"","cld_public_id":"Black-2016-Range-Rover","category":{"id":103,"name":"Land Rover","slug":"land-rover-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/landrover_RM.png"},"tags":[{"id":1628,"name":"2018 Land Rover Discovery recall","slug":"2018-land-rover-discovery-recall"},{"id":1626,"name":"2018 Land Rover Range Rover recall","slug":"2018-land-rover-range-rover-recall"},{"id":1627,"name":"2018 Land Rover Range Rover Sport recall","slug":"2018-land-rover-range-rover-sport-recall"},{"id":1630,"name":"Land Rover AEB","slug":"land-rover-aeb"},{"id":1629,"name":"Land Rover braking system","slug":"land-rover-braking-system"}],"categories":[{"id":103,"name":"Land Rover","slug":"land-rover-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/landrover_RM.png"}]},{"id":16322,"title":"2018 Mercedes-AMG E63 S Hit with Recall","link":"https://www.motorsafety.org/2018-mercedes-amg-e63-s-hit-with-recall/","status":"publish","slug":"2018-mercedes-amg-e63-s-hit-with-recall","excerpt":"","description":"<div class=\"video-wrapper feature-video\"><iframe src=\"https://player.vimeo.com/video/307146058?app_id=122963\" width=\"1170\" height=\"658\" frameborder=\"0\" title=\"2018 Mercedes-AMG E63 S Hit with Recall\" allow=\"autoplay; fullscreen\" allowfullscreen></iframe></div>\n<p><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16322","createdAt":"2018-10-05T08:37:52.000Z","date_gmt":"2018-10-05T22:22:52.000Z","updatedAt":"2018-12-19T08:53:21.000Z","modified_gmt":"2018-12-19T22:38:21.000Z","display_date":"October 05, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":null,"nhtsa_campaign_number":null,"recall_date":null,"meta_title":null,"meta_description":null,"meta_keywords":null,"custom_schema":null},"year":2018,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/04/motorsafetylogo_small.png","alt_text":"","cld_public_id":"motorsafetylogo_small","category":{"id":5,"name":"Mercedes-Benz","slug":"mercedes-benz-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mercedes_RM.png"},"tags":[],"categories":[{"id":5,"name":"Mercedes-Benz","slug":"mercedes-benz-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mercedes_RM.png"}]},{"id":16077,"title":"Mercedes-Benz Recalls Nearly 400 Sedans for Rear Window Defect","link":"https://www.motorsafety.org/mercedes-benz-recalls-nearly-400-sedans-for-rear-window-defect/","status":"publish","slug":"mercedes-benz-recalls-nearly-400-sedans-for-rear-window-defect","excerpt":"<p>Mercedes-Benz USA, LLC (MBUSA) is recalling certain 2018 Mercedes-Benz C300, C300 4MATIC, C63 AMG, and C63S AMG vehicles due to incorrect bonding of the rear window.</p>\n","description":"<p>Laguna Hills, CA – October 4, 2018 – Mercedes-Benz USA, LLC (MBUSA) is recalling certain 2018 Mercedes-Benz C300, C300 4MATIC, C63 AMG, and C63S AMG vehicles due to incorrect bonding of the rear window.</p>\n<p>Daimler AG (&#8220;DAG&#8221;), the manufacturer of Mercedes-Benz vehicles, has determined that on certain Model Year (&#8220;MY&#8221;) 2018 C-Class (205 platform) vehicles, the bonding of the rear window might not meet current production specification. This defect was caused by an error during production, during which the rear window bonding activator may not have been applied correctly.</p>\n<p>The recall is thought to potentially have occurred in just 387 vehicles, which has been determined through production records. Vehicles not affected by the recall have correct rear window bonding.</p>\n<h3>The Defect</h3>\n<p>Incorrect bonding of the rear window may lead to decreased long-term adhesion of the rear window. As a result, the rear window could loosen and detach from the vehicle, creating a road hazard and increase the risk of a crash for following traffic.</p>\n<h3>Timeline of Events</h3>\n<p>In mid-June 2018 DAG conducted initial investigations based on previous findings in the assembly plant. The investigation determined there had been an error during rear window installation, resulting in a potential incomplete rear window bonding process.</p>\n<p>Further investigation determined that the glass activator on the rear window was not applied as required, and further analysis performed in July 2018 determined that the missing glass activator could impact the long-term adhesion of the rear window.</p>\n<p>In August 2018 the range of potentially affected vehicles was identified, and in September 2018 DAG determined that the potential safety risk could not be ruled out and issued a voluntary recall.</p>\n<h3>The Solution</h3>\n<p>MBUSA will notify owners, and an authorized Mercedes-Benz dealer will rework the rear window bonding as a precautionary, free of charge. MBUSA does not plan to provide notice about pre-notice reimbursement to owners since all involved vehicles remain covered under the new vehicle warranty.</p>\n<p>The recall is expected to begin November 2, 2018. Owners may contact MBUSA customer service at 1-800-367-6372.Owners may also contact the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153). The assigned NHTSA Recall Number is 18V-608.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16077","createdAt":"2018-10-04T06:36:44.000Z","date_gmt":"2018-10-04T20:21:44.000Z","updatedAt":"2020-10-04T05:29:43.000Z","modified_gmt":"2020-10-04T19:14:43.000Z","display_date":"October 04, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2018,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/10/Black-2019-Mercedes-E53-AMG-768x512.jpg","alt_text":"","cld_public_id":"Black-2019-Mercedes-E53-AMG","category":{"id":5,"name":"Mercedes-Benz","slug":"mercedes-benz-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mercedes_RM.png"},"tags":[],"categories":[{"id":5,"name":"Mercedes-Benz","slug":"mercedes-benz-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mercedes_RM.png"}]},{"id":16079,"title":"2018 Mercedes-Benz, Mercedes-AMG C-Class: Recall Alert","link":"https://www.motorsafety.org/2018-mercedes-benz-mercedes-amg-c-class-recall-alert/","status":"publish","slug":"2018-mercedes-benz-mercedes-amg-c-class-recall-alert","excerpt":"<p>2018 Mercedes-Benz, Mercedes-AMG C-Class: Recall Alert Vehicles Affected:&nbsp;Approximately 400 model-year 2018 Mercedes-Benz C300, C300 4Matic, and Mercedes-AMG C63 and C63S convertibles, coupes and sedans The Problem:&nbsp;Incorrect bonding of the rear window may cause the window to loosen and detach from the vehicle, which can become a road hazard, increasing the risk of a crash. The</p>\n","description":"<p class=\"article-title\"><a href=\"https://www.cars.com/articles/2018-mercedes-benz-mercedes-amg-c-class-recall-alert-1420703104555/\" target=\"_blank\" rel=\"noopener noreferrer\">2018 Mercedes-Benz, Mercedes-AMG C-Class: Recall Alert</a></p>\n<div class=\"article-byline\">\n<p><strong><a href=\"https://www.cars.com/articles/2018-mercedes-benz-mercedes-amg-c-class-recall-alert-1420703104555/\"><img loading=\"lazy\" class=\"alignleft\" src=\"https://www.cstatic-images.com/stock/1170x1170/36/img-1795646136-1532620561236.jpg\" width=\"328\" height=\"219\"></a>Vehicles Affected:</strong>&nbsp;Approximately 400 model-year 2018 Mercedes-Benz C300, C300 4Matic, and Mercedes-AMG C63 and C63S convertibles, coupes and sedans</p>\n<p><strong>The Problem:</strong>&nbsp;Incorrect bonding of the rear window may cause the window to loosen and detach from the vehicle, which can become a road hazard, increasing the risk of a crash.</p>\n<p><strong>The Fix:</strong>&nbsp;Dealers will rework the rear window bonding for free&#8230;<a href=\"https://www.cars.com/articles/2018-mercedes-benz-mercedes-amg-c-class-recall-alert-1420703104555/\" target=\"_blank\" rel=\"noopener noreferrer\">Read more on Cars.com</a></p>\n</div>\n<p><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16079","createdAt":"2018-10-04T05:22:16.000Z","date_gmt":"2018-10-04T19:07:16.000Z","updatedAt":"2020-10-02T21:47:54.000Z","modified_gmt":"2020-10-03T11:32:54.000Z","display_date":"October 04, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2018,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/10/shutterstock_1375403681-768x272.jpg","alt_text":"","cld_public_id":"shutterstock_1375403681","category":{"id":5,"name":"Mercedes-Benz","slug":"mercedes-benz-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mercedes_RM.png"},"tags":[],"categories":[{"id":5,"name":"Mercedes-Benz","slug":"mercedes-benz-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mercedes_RM.png"}]},{"id":16067,"title":"Mercedes-Benz Recalls 22 Vehicles for Front Passenger Seat Adjustment Issues","link":"https://www.motorsafety.org/mercedes-benz-recalls-22-vehicles-for-front-passenger-seat-adjustment-issues/","status":"publish","slug":"mercedes-benz-recalls-22-vehicles-for-front-passenger-seat-adjustment-issues","excerpt":"<p>Mercedes-Benz is recalling certain 2018 Mercedes-Benz E63S AMG 4MATIC vehicles, as Daimler AG has determined that on certain 2017 E-Class AMG vehicles, the adjustment range of the front passenger seat might not be limited correctly.</p>\n","description":"<p>Laguna Hills, CA – October 3, 2018 – Mercedes-Benz USA, LLC (MBUSA) is recalling certain 2018 Mercedes-Benz E63S AMG 4MATIC vehicles. Daimler AG, (&#8220;DAG&#8221;) the manufacturer of Mercedes-Benz vehicles, has determined that on certain Model Year (&#8220;MY&#8221;) 2017 E-Class AMG (213 platform) vehicles, the adjustment range of the front passenger seat might not be limited correctly, which allows it to be adjusted beyond its intended limit.</p>\n<p>The recall is believed to only affect 22 individual units, according to a recall population that was determined through production records. Vehicles not affected by this recall will have seats with sufficient mechanical limitation and correct seat software calibration.</p>\n<h3>The Defect</h3>\n<p>According to the <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V609-6763.pdf\">NHTSA&nbsp;Safety Recall Report</a>, due to an insufficient design of the front passenger seat mechanical limits and seating software calibration, the adjustment range on affected vehicles was not limited to meet current production specifications.</p>\n<p>This defect can lead to the occupant load for certain seating positions on the front passenger seat being increased, leading to an higher risk of potential injury for the front passenger during a crash.</p>\n<h3>Timeline of Events</h3>\n<p>In December 2016, DAG launched an initial investigation based on the failure of internal certification crash tests in the development phase. This investigation indicated an incorrect limitation of the front passenger seat adjustment range as the root cause of the test failure, and further analysis was initiated.</p>\n<p>The necessary front passenger seat updates and changes in the seat control unit software to correctly limit the seat travel were subsequently defined, and in February 2017 the introduction of an updated seat control unit software was implemented. Furthermore, in March 2017 the passenger seat design as updated with the addition of a mechanical adjustment range limitation.</p>\n<p>Vehicles produced before installation of mechanical adjustment range limitation were slated to be reworked during vehicle production or in the vehicle preparation center prior to sale, but in July 2018 it was determined through routine monitoring that reworking to correct this issue was not completed for all vehicles in the vehicle preparation center.</p>\n<p>As a result, a range of 22 units were confirmed to be in the hands of drivers, with the range of potentially affected vehicles in the field being determined in August 2018. At the beginning of September 2018 DAG determined that a potential safety risk could not be ruled out and voluntarily announced a recall for the 22 units to allow reworking to be completed.</p>\n<h3>The Solution</h3>\n<p>As a precautionary measure an authorized Mercedes-Benz dealer will check the adjustment range of the passenger seat on the affected vehicles, and, if needed, install the mechanical adjustment range limitation or update the seat control unit software respectively. This process will be free of charge to the vehicle owner as these units are still under new vehicle warranty.</p>\n<p>The recall is expected to begin October 19, 2018. Owners may contact MBUSA customer service at 1-800-367-6372. Owners may also contact the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY1-800-424-9153). The NHTSA Campaign Recall Number is 18V-609.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16067","createdAt":"2018-10-03T08:07:16.000Z","date_gmt":"2018-10-03T21:52:16.000Z","updatedAt":"2020-10-02T21:49:44.000Z","modified_gmt":"2020-10-03T11:34:44.000Z","display_date":"October 03, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2018,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2018/10/2019-Mercedes-Benz-E63-768x512.jpg","alt_text":"","cld_public_id":"2019-Mercedes-Benz-E63","category":{"id":5,"name":"Mercedes-Benz","slug":"mercedes-benz-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mercedes_RM.png"},"tags":[],"categories":[{"id":5,"name":"Mercedes-Benz","slug":"mercedes-benz-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mercedes_RM.png"}]},{"id":16324,"title":"Mercedes-Benz Recalls GLC Class Vehicles with LED Headlights","link":"https://www.motorsafety.org/mercedes-benz-recalls-glc-class-vehicles-with-led-headlights/","status":"publish","slug":"mercedes-benz-recalls-glc-class-vehicles-with-led-headlights","excerpt":"","description":"<div class=\"video-wrapper feature-video\"><iframe src=\"https://player.vimeo.com/video/307148138?app_id=122963\" width=\"1170\" height=\"658\" frameborder=\"0\" title=\"Mercedes-Benz Recalls GLC Class Vehicles with LED Headlights\" allow=\"autoplay; fullscreen\" allowfullscreen></iframe></div>\n<p><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16324","createdAt":"2018-10-02T08:38:42.000Z","date_gmt":"2018-10-02T22:23:42.000Z","updatedAt":"2018-12-19T08:52:56.000Z","modified_gmt":"2018-12-19T22:37:56.000Z","display_date":"October 02, 2018","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":null,"nhtsa_campaign_number":null,"recall_date":null,"meta_title":null,"meta_description":null,"meta_keywords":null,"custom_schema":null},"year":2018,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2016/04/motorsafetylogo_small.png","alt_text":"","cld_public_id":"motorsafetylogo_small","category":{"id":5,"name":"Mercedes-Benz","slug":"mercedes-benz-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mercedes_RM.png"},"tags":[],"categories":[{"id":5,"name":"Mercedes-Benz","slug":"mercedes-benz-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mercedes_RM.png"}]}]