[{"id":17693,"title":"Nissan Expands Recall Involving Brake Fluid Leaks","link":"https://www.motorsafety.org/nissan-expands-recall-involving-brake-fluid-leaks/","status":"publish","slug":"nissan-expands-recall-involving-brake-fluid-leaks","excerpt":"<p>Nissan has announced a recall of 394,025 vehicles due to brake fluid leak fears and potential electrical short. This recall includes 3 Nissan models and 1 Infiniti. </p>\n","description":"<p>Laguna Hills, CA &#8211; Nov. 21, 2019 &#8211; A massive automotive recall is underway for Nissan North America, as more than 394,000 models &#8211; including Pathfinder, Infiniti, QX60, Murano and Maxima &#8211; contain flaws that put motorists&#8217; safety at risk. The problem concerns brake fluid and what that liquid might touch in such an event. Specifically, if it drips onto certain circuitry, an electrical shortage may occur that increases the chances of an engine fire.</p>\n<p>Nissan intends to inform registered users of the affected models starting in November. Recipients should take their car off the road if they think they may be impacted. An area dealer will fix the problem if one exists, free of charge.</p>\n<h2>The Defect</h2>\n<p>Nissan has announced the automotive recall of 394,025 vehicles, <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCAK-19V807-8089.pdf\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">according to documentation</a> released by the National Highway Traffic Safety Administration. Unlike other automotive recalls, which usually affect one specific model, this one affects several. They include:</p>\n<ul>\n<li>2017-2019 Infiniti QX60</li>\n<li>2016-2018 Maxima</li>\n<li>2015-2018 Murano</li>\n<li>2017-2019 Pathfinder</li>\n</ul>\n<p>Even though these models are different and several were manufactured in different production periods, they each are equipped with ADVICS ABS actuators. The sealant, however, may be inadequate and run the risk of leaking brake fluid. In high temperature environments, the oil seal may subsequently soften and leach out fluid. This could reduce the braking capability of the ABS actuators and also runs the risk of igniting a fire within the engine compartment. Either of these worst-case scenarios are major safety hazard for drivers as well as anyone else who is in the vicinity of motorists driving a Nissan model with the apparent flaw.</p>\n<p>Some of the models subject to this latest recall were originally part of a separate one that involved the same issue that have not been corrected. Others vehicles, however, were examined in the first brake fluid-related recall but were errantly determined not to require any repair work.</p>\n<h2>Timeline of Events</h2>\n<p>Usually when recalls are announced, NHTSA puts together a comprehensive Part 573 Safety Recall Report, which details how the problem came up and a brief chronology of what the automaker involved did to seek a solution. The agency says Nissan is expected to provide background regarding these details at a future date.</p>\n<p>Nissan did, however, <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RMISC-19V807-7934.pdf\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">release an estimate </a>as to how many of the 394,000+ recalled vehicles are Maximas, Muranos, Pathfinders and Infiniti QX60s. Pathfinder comprises the most at 126,579, followed by Murano (115,518), Maxima (82,374) and finally Infiniti QX60 (69,554).</p>\n<p>Although the expansion of the original recall suggests more may be impacted than previously realized, Nissan suspects only 1% of the models recalled actually contain the defect.</p>\n<p>Registered Nissan Infiniti QX60 operators have another <a href=\"https://www.motorsafety.org/category/nissan-recalls/\" target=\"_blank\" rel=\"noopener noreferrer\">recall out on their model</a>, which was announced in September. That one affected 1.2 million Nissans overall that relate to rear camera display settings that are out of compliance with Federal Motor Safety Standard No. 111.</p>\n<h2>The Solution</h2>\n<p>As for the automotive recall involving the potential for leaking brake fluid, Nissan is informing motorists officially by first-class mail. If you&#8217;re an owner, expect to receive a notification some time after Dec. 2. Dealers have already been informed. Bring the vehicle to an area Nissan dealer so a repair can be scheduled.</p>\n<p>For more information, visit <a href=\"https://www.motorsafety.org/\" target=\"_blank\" rel=\"noopener noreferrer\">MotorSafety.org</a>.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=17693","createdAt":"2019-11-22T06:20:09.000Z","date_gmt":"2019-11-22T20:05:09.000Z","updatedAt":"2020-10-15T00:22:33.000Z","modified_gmt":"2020-10-15T14:07:33.000Z","display_date":"November 22, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V807000","recall_date":"November 8, 2019"},"year":2019,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/11/shutterstock_538791661-768x510.jpg","alt_text":"","cld_public_id":"shutterstock_538791661","category":{"id":40,"name":"Infiniti","slug":"infiniti","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/infiniti_RM.png"},"tags":[{"id":1248,"name":"2015-2018 Nissan Murano recall","slug":"2015-2018-nissan-murano-recall"},{"id":1247,"name":"2016-2018 Nissan Maxima recall","slug":"2016-2018-nissan-maxima-recall"},{"id":1246,"name":"2017-2019 Infiniti QX60 recall","slug":"2017-2019-infiniti-qx60-recall"},{"id":1249,"name":"2017-2019 Nissan Pathfinder recall","slug":"2017-2019-nissan-pathfinder-recall"},{"id":1252,"name":"Infiniti break fluid leak","slug":"infiniti-break-fluid-leak"},{"id":1253,"name":"Infiniti electrical shortage","slug":"infiniti-electrical-shortage"},{"id":1250,"name":"Nissan break fluid leak","slug":"nissan-break-fluid-leak"},{"id":1251,"name":"Nissan electrical shortage","slug":"nissan-electrical-shortage"}],"categories":[{"id":40,"name":"Infiniti","slug":"infiniti","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/infiniti_RM.png"},{"id":14,"name":"Nissan","slug":"nissan-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/nissan_RM.png"}]},{"id":17692,"title":"Ford F-150s Pulled Due To Loose Engine Assemblies","link":"https://www.motorsafety.org/ford-f-150s-pulled-due-to-loose-engine-assemblies/","status":"publish","slug":"ford-f-150s-pulled-due-to-loose-engine-assemblies","excerpt":"<p>Ford Motor Company says it intends to recall over 135,000 F-150 pickup trucks over engine performance safety concerns. </p>\n","description":"<p>Laguna Hills, CA &#8211; Nov. 21, 2019 &#8211; Ford Motor Company says it intends to recall over 135,000 F-150 pickup trucks. The flawed vehicles &#8211; with 2019 and 2020 model years &#8211; may be equipped with power distribution boxes and battering monitoring systems whose fasteners may be improperly installed. Should they loosen, performance of the automobile could be adversely impacted, which could be manifested by the engine stalling or disabling the steering assist feature. Any or all of these outcomes increase the risk of an accident and resultant injury.</p>\n<p>Motorists made aware of the 2019-2020 Ford F-150 recall are kindly asked to contact their local dealership so this issue can be addressed. Operators will not be charged for parts or labor.</p>\n<h2>The Defect</h2>\n<p>As <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCAK-19V805-6346.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">detailed in paperwork</a>&nbsp;prepared by the National Highway Traffic Safety Administration, Ford is recalling 135,725 F-150 pickup trucks from the road as well as those that have yet to be sold. Within the engines of the automaker&#8217;s latest F-150 models &#8211; 2019 and 2020 &#8211; are power distribution and battery monitoring system boxes, which ensure a smooth delivery of energy to the pickup&#8217;s various parts.</p>\n<p>At some point during manufacturing, however, the cable wire harnesses and eyelets were not torqued properly. Insufficient tautness may impair other elements of the car&#8217;s functions, such as panel displays, braking assist, steering assist or stalling of the engine. The abruptness of these performance issues may lead to a crash, thus increasing the risk of injury.</p>\n<h2>Timeline of Events</h2>\n<p>This problem <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLRPT-19V805-5506.PDF\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">first came to light</a>&nbsp;in late September, according to NHTSA documentation. Corporate offices assigned Ford&#8217;s Critical Concern Review Group to investigate. They discovered in a sample case shortly afterward that the wiring sealant adhesive used in the BMS terminal eyelit was preventing the unit from adhering to the F-150&#8217;s battery B+ terminals. A follow-up investigation was subsequently&nbsp;ordered&nbsp;to see if this issue was&nbsp;aberrant&nbsp;or institutional. The audit revealed that others models could be affected due to a supplier change that the company made in June of this year. Process changes had also gone into effect around this time.</p>\n<p>By Nov. 4, Ford decided to reach out to NHTSA to inform the agency that a recall was necessary, which became official Nov. 12.</p>\n<p>It&#8217;s little wonder the recall potentially affects so many of the same model because the F-150 is a perennial leader in sales for Ford. The Dearborn, Michigan-based automaker sold 214,176 Ford F-Series pickups in the third quarter, Motor1.com <a href=\"https://www.motor1.com/news/375096/ford-f-series-outsold-2019-q3\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">reported</a>. It was the best-selling model in the three-month period overall, outperforming the Ram Pickup and Chevrolet Silverado.</p>\n<h2>The Solution</h2>\n<p>The automaker has an answer to the 2019-2020 Ford F-150 recall. Registered motorists who receive notifications about this problem are urged to take their automobile to a local authorized Ford dealer. There, the vehicle will be assessed to determine if the problems exists and reassemble the flawed joint or retorque loosened fasteners. These repairs will come at no cost. Operators can expect to receive mailers alerting them to this problem starting Nov. 25.</p>\n<p>For more information on this and other <a href=\"https://www.motorsafety.org/category/ford-recalls/\" target=\"_blank\" rel=\"noopener noreferrer\">Ford recalls</a>, visit <a href=\"https://www.motorsafety.org/\" target=\"_blank\" rel=\"noopener noreferrer\">MotorSafety.org</a>.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=17692","createdAt":"2019-11-22T06:18:01.000Z","date_gmt":"2019-11-22T20:03:01.000Z","updatedAt":"2020-10-15T00:28:48.000Z","modified_gmt":"2020-10-15T14:13:48.000Z","display_date":"November 22, 2019","sticky":false,"recall":false,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V805000","recall_date":"November 12, 2019"},"year":2019,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/11/shutterstock_1077223076-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_1077223076","category":{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"},"tags":[{"id":1254,"name":"2019-2020 Ford F-150 recall","slug":"2019-2020-ford-f-150-recall"},{"id":1256,"name":"Ford battery monitoring system recall","slug":"ford-battery-monitoring-system-recall"},{"id":1255,"name":"Ford power distribution box","slug":"ford-power-distribution-box"}],"categories":[{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"}]},{"id":17694,"title":"GM Recalls Pickup Trucks Due to Seat Belt Fire Fears","link":"https://www.motorsafety.org/gm-recalls-pickup-trucks-due-to-seat-belt-fire-fears/","status":"publish","slug":"gm-recalls-pickup-trucks-due-to-seat-belt-fire-fears","excerpt":"<p>Well over a half-million pickup trucks manufactured by General Motors LLC are poised to be pulled from the marketplace over safety concerns related to the front seat belt pretensioners.</p>\n","description":"<p>Laguna Hills, CA &#8211; Nov. 21, 2019 &#8211; Well over a half-million pickup trucks manufactured by General Motors LLC are poised to be pulled from the marketplace over safety concerns related to the front seat belt pretensioners. When passengers strap themselves in, a hot gas may emit from pretensioner bracket opening. This could cause a fire within the interior of the vehicle. The potentially compromised models in question include the Chevrolet Silverado and GMC Sierra.</p>\n<p>Although GM has yet to announce when motorists will be officially notified of this safety issue by mail, the automaker intends to send mailers alerting registered owners shortly. Recipients are urged to have their cars examined by an area dealership so this problem can be resolved, if one exists. The repair comes at no charge.</p>\n<h2>The Defect</h2>\n<p>According to documents submitted to and <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCAK-19V814-5812.pdf\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">distributed by</a> the National Highway Traffic Safety Administration, GM is recalling approximately 556,399 pickup trucks nationwide whose seat belt pretensioners &#8211; both on the driver and passenger side of the car &#8211; may be compromised. Upon the belt&#8217;s deployment from the assembly, a flammable gas may emanate out of the bracket aperture. Such a scenario may lead to a fire. All the suspect vehicles have carpet floor mats, which are not fire retardant. Those with vinyl floor coverings are not in any danger.</p>\n<p>The specific automobiles included in the GM seat belt fire recall are the following:</p>\n<ul>\n<li>2019-2020 Chevrolet Silverado 1500</li>\n<li>2020 Chevrolet Silverado 2500</li>\n<li>2020 Chevrolet Silverado 3500</li>\n<li>2019-2020 GMC Sierra 1500</li>\n<li>2020 GMC Sierra 2500</li>\n<li>2020 GMC Sierra 3500</li>\n</ul>\n<p>Chevrolet Silverados represent the lion&#8217;s share of the GM seat belt fire recall at 355,878, based upon NHTSA records and estimates.</p>\n<h2>Timeline of Events</h2>\n<p>This issue first came to GM&#8217;s attention July 25, when corporate headquarters <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLRPT-19V814-4342.PDF\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">was briefed about</a> a fire occurring within the cab of a GM-manufactured pickup truck. Internal fire investigators participated in the inquiry as well and determined approximately five days later that the problem may be linked to a similar event that involved the same make and model.</p>\n<p>GM and the internal fire experts referred the case to GM&#8217;s technical center for follow-up analysis and a more in-depth breakdown as to the nature and cause of the conflagration and how best to resolve it. This subsequent investigation took place in September.</p>\n<p>In mid-October, those leading the inquiry determined the most likely cause was a hot gas that vented from the pretensioner opening, which subsequently ignited carpet fibers found on the floor. These findings were then submitted to GM open investigation review board Nov. 4. Three days later, the automaker decided a safety recall was appropriate. No known crashes, deaths or injuries have been reported as a result of this seat belt glitch.</p>\n<h2>The Solution</h2>\n<p>While General Motors dealers have since been <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCMN-19V814-4667.pdf\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">notified about this safety alert</a>, motorists soon will be, according to the automaker&#8217;s  records. There&#8217;s no official date as of yet, but GM expects mailers being distributed sent out in the first or second week of December. Those informed are asked to bring their automobile to a local dealer. If deemed necessary after inspecting the suspect seat belt unit, the pretensioner aperture will be closed off, thus stopping the gas&#8217;s outflow.</p>\n<p>For more information on the GM seat belt fire recall or <a href=\"https://www.motorsafety.org/category/gm-recalls/\" target=\"_blank\" rel=\"noopener noreferrer\">additional recalls</a> recently announced by the Detroit, Michigan-based automaker, please visit <a href=\"https://www.motorsafety.org/\" target=\"_blank\" rel=\"noopener noreferrer\">MotorSafety.org</a>.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=17694","createdAt":"2019-11-22T06:16:44.000Z","date_gmt":"2019-11-22T20:01:44.000Z","updatedAt":"2020-10-15T00:36:12.000Z","modified_gmt":"2020-10-15T14:21:12.000Z","display_date":"November 22, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V814000","recall_date":"November 14, 2019"},"year":2019,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/11/shutterstock_1374350609-768x524.jpg","alt_text":"","cld_public_id":"shutterstock_1374350609","category":{"id":12,"name":"Chevrolet","slug":"chevrolet-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/chevy_ms.png"},"tags":[{"id":1182,"name":"2019-2020 Chevrolet Silverado 1500 recall","slug":"2019-2020-chevrolet-silverado-1500-recall"},{"id":1183,"name":"2019-2020 GMC Sierra 1500 recall","slug":"2019-2020-gmc-sierra-1500-recall"},{"id":1257,"name":"2020 Chevrolet Silverado 2500 recall","slug":"2020-chevrolet-silverado-2500-recall"},{"id":1258,"name":"2020 Chevrolet Silverado 3500 recall","slug":"2020-chevrolet-silverado-3500-recall"},{"id":1259,"name":"2020 GMC Sierra 2500 recall","slug":"2020-gmc-sierra-2500-recall"},{"id":1260,"name":"2020 GMC Sierra 3500 recall","slug":"2020-gmc-sierra-3500-recall"},{"id":1262,"name":"Chevrolet seat belt recall","slug":"chevrolet-seat-belt-recall"},{"id":1261,"name":"GMC seat belt recall","slug":"gmc-seat-belt-recall"}],"categories":[{"id":12,"name":"Chevrolet","slug":"chevrolet-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/chevy_ms.png"},{"id":72,"name":"GMC","slug":"gmc-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/gmc_RM.png"}]},{"id":17695,"title":"Potential Tread Detachment Spurs Recall on Mazda CX-9s","link":"https://www.motorsafety.org/potential-tread-detachment-spurs-recall-on-mazda-cx-9s/","status":"publish","slug":"potential-tread-detachment-spurs-recall-on-mazda-cx-9s","excerpt":"<p>A select number of CX-9 vehicles, manufactured by Mazda North America are scheduled for recall because the wrong rubber compound may have been installed during tire assembly</p>\n","description":"<p>Laguna Hills, CA &#8211; Nov. 22, 2019 &#8211; A select number of CX-9 vehicles, manufactured by Mazda North America, are scheduled for recall because the wrong rubber compound may have been installed during tire assembly. The binding agent used in the compound may be insufficient and cause the tread to separate as a result. Any errors or wear and tear issues associated with the tires can result in a crash and potential for injury by diminishing vehicle stability.</p>\n<p>Mazda has settled on a solution and plans to inform operators informed of the flaw how they can get the tire issue corrected. They&#8217;re advised to bring their vehicle to a Mazda dealership so their cars can be inspected. If necessary, replacement tires will be installed at no charge.</p>\n<h2>The Defect</h2>\n<p>According to <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCAK-19V770-4232.pdf\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">official filings</a> with the National Highway Traffic Safety Administration, roughly 146 Mazda CX-9s &#8211; model year 2019 &#8211; may be installed with features that make the vehicle unsafe to operate. Specifically, the rubber compound used in Sumitomo Falken ZIEX CT50 A/S tires may be the wrong type for tire sizes P255/50R20 104 V, as an investigation found the compound designed for prototype tires was errantly applied.</p>\n<p>It&#8217;s possible that the tread containing the compound may degrade prematurely and detach from the tire frame. A loss of control of the vehicle could ultimately lead to a car crash.</p>\n<p>The suspect tires in question have a date code stamped 1619, NHTSA documents specify.</p>\n<h2>Timeline of Events</h2>\n<p>Mazda&#8217;s tire supplier, Sumitomo Rubber Industries, <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLRPT-19V770-2883.PDF\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">reached out to</a> the automaker&#8217;s corporate headquarters Sept. 9 in order to inform the company of the safety issue and the potential for harm that existed. The supplier was apprised of the issue after seven warranties were submitted to the company complaining of tire troubles. These issues were evidenced by the way in which the cars performed, causing vehicles to shake or make strange noises. In some cases, the tread physically detached from the automobiles. No injuries or crashes occurred in the aftermath, however.</p>\n<p>An internal investigation by SRI determined that the suspect tires were manufactured in April, which enabled the supplier to isolate which cars were potentially vulnerable. On the last day of September, SRI confirmed where the compromised tires were sent.</p>\n<p>By Oct. 25, Mazda determined that a small scale recall was appropriate and informed NHTSA of this fact Oct. 28.</p>\n<p>Over the course of 2019, Mazda has <a href=\"https://www.motorsafety.org/category/mazda-recalls/\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">issued multiple recalls</a>, most of them related to vehicle performance. These included windshield wiper failures, faulty indicator lights and rearview mirrors detaching from their mounts.</p>\n<p>Although 146 Mazdas are subject to the recall, the automaker anticipates that approximately half of the CX-9s in question &#8211; 44%, or 64 vehicles &#8211; contain the flaw.</p>\n<h2>The Solution</h2>\n<p>Starting Dec. 18, Mazda will reach out to registered CX-9 users about this safety issue by first-class mail. The serial numbers will be checked and if there&#8217;s a match, the tires will be replaced with the proper ones. One or all four may need to be swapped out.</p>\n<p>For more information, please visit <a href=\"https://www.motorsafety.org/\" target=\"_blank\" rel=\"noopener noreferrer\">MotorSafety.org</a>.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=17695","createdAt":"2019-11-22T06:14:48.000Z","date_gmt":"2019-11-22T19:59:48.000Z","updatedAt":"2020-10-15T01:04:40.000Z","modified_gmt":"2020-10-15T14:49:40.000Z","display_date":"November 22, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V770000","recall_date":"October 28, 2019"},"year":2019,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/11/shutterstock_1060199429-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_1060199429","category":{"id":18,"name":"Mazda","slug":"mazda-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mazda.png"},"tags":[{"id":1263,"name":"2019 Mazda CX-9 recall","slug":"2019-mazda-cx-9-recall"},{"id":1264,"name":"Mazda tire tread issue","slug":"mazda-tire-tread-issue"}],"categories":[{"id":18,"name":"Mazda","slug":"mazda-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mazda.png"}]},{"id":17684,"title":"2019 Dodge Challengers and Chargers recalled for brake issues","link":"https://www.motorsafety.org/2019-dodge-challengers-and-chargers-recalled-for-brake-issues/","status":"publish","slug":"2019-dodge-challengers-and-chargers-recalled-for-brake-issues","excerpt":"<p>Fiat Chrysler Automobiles U.S. recently issued a recall on some 2019 Dodge Challengers and Chargers with concerns over front and rear brake packages.</p>\n","description":"<p>Laguna Hills, CA &#8211; Nov. 12, 2019 &#8211; Fiat Chrysler Automobiles U.S. recently <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLQRT-19V758-6150.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">issued a recall</a> for well over 100 of its model year 2019 Dodge Challengers and Chargers, due to concerns over front and rear brake packages.</p>\n<p>Specifically, the recall involves 173 vehicles, including:</p>\n<ul>\n<li>111 four-door 2019 Dodge Chargers</li>\n<li>62 two-door 2019 Dodge Challengers</li>\n</ul>\n<p>All are believed to have the defect described below, which can lead to an increased risk of crashing.</p>\n<h2>The Defect</h2>\n<p>In both cases, the vehicles in question may have been built with front and rear brake packages that are incompatible with each other, and may not leave enough space between the tires&#8217; inner sidewalls and the suspension steering knuckle. In these cases, there may be contact between the components, which could result in damage to the tires that would&nbsp;lead to a sudden loss of air pressure.</p>\n<p>That, in turn, would potentially result in drivers losing control of the vehicle without warning, increasing the risk of an accident.</p>\n<p>All Challengers in the recall were produced from May 28 to Sept. 20, 2019, and affected Chargers were made between May 29 and Sept. 25. FCA used vehicle production records to determine which cars were made with these incompatible wheel and brake packages. Other Chargers and Challengers produced in the 2019 model year do not have this issue.</p>\n<h2>Timeline of Events</h2>\n<p>On Sept. 13, 2019, FCA&#8217;s&nbsp;assembly plant in Brampton, Ontario, alerted its parent company of a possible issue related to how close tires in some vehicles might be to the steering knuckles that are part of the brake packages.</p>\n<p>Five days later, the company&#8217;s Vehicle Safety and Regulatory Compliance organization launched an investigation into the issue after completing an engineering evaluation of one potentially affected vehicle. Between Sept. 18 and 27, 2019, all involved &#8211; including FCA U.S. Engineering &#8211; held meetings to look at the problem, its potential consequences and the&nbsp;scope of the issue.</p>\n<p>As of Oct. 14, the company had not received any field reports of accidents related to the defect, nor had any warranty claims been filed. Furthermore, it was not aware of any accidents or injuries that might have been related to this problem.</p>\n<p>Nonetheless, the company decided through its VSRC that it would conduct a voluntary recall beginning on Oct. 17, 2019.</p>\n<h2>The Solution</h2>\n<p>Drivers will be asked to bring their affected vehicles to an auto technician that can install the proper brake packages, as well as inspect the front tires on that car to determine whether they need to be replaced. They will also replace the rear tires to ensure they match the front replacements. If necessary, these mechanics might also need to adjust the wheel alignment. The company will provide reimbursement for any such repairs already undertaken, as long as owners have the original receipt or other proof of the transaction.</p>\n<p>Both dealers and owners will receive notification of the recall on Dec. 13, 2019.</p>\n<p>For additional details about this recall, consumers can contact Fiat Chrysler by phone at 1-800-853-1403, or call the National Highway Traffic Safety Administration hotline at 1-888-327-4236.</p>\n<p>For more information on this or other recalls past or present, visit <a href=\"http://MotorSafety.org\" target=\"_blank\" rel=\"noopener noreferrer\">MotorSafety.org</a>.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=17684","createdAt":"2019-11-13T06:15:25.000Z","date_gmt":"2019-11-13T20:00:25.000Z","updatedAt":"2020-11-06T03:04:13.000Z","modified_gmt":"2020-11-06T16:49:13.000Z","display_date":"November 13, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V758000","recall_date":"October 24, 2019"},"year":2019,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/11/shutterstock_1551081002-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_1551081002","category":{"id":7,"name":"Dodge","slug":"dodge-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/dodge.png"},"tags":[{"id":991,"name":"2019 Dodge Challenger recall","slug":"2019-dodge-challenger-recall"},{"id":1265,"name":"2019 Dodge Charger recall","slug":"2019-dodge-charger-recall"},{"id":1266,"name":"Dodge brake issue","slug":"dodge-brake-issue"}],"categories":[{"id":7,"name":"Dodge","slug":"dodge-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/dodge.png"}]},{"id":17683,"title":"Nearly 108,000 Dodge pickups recalled due to fire risk","link":"https://www.motorsafety.org/nearly-108000-dodge-pickups-recalled-due-to-fire-risk/","status":"publish","slug":"nearly-108000-dodge-pickups-recalled-due-to-fire-risk","excerpt":"<p>Fiat Chrysler Automobiles U.S. recently issued a recall for more than 107,000 RAM pickups produced between 2013 and 2019 for concerns that their exhaust gas recirculation coolers could pose a risk.</p>\n","description":"<p>Laguna Hills, CA &#8211; Nov. 11, 2019 &#8211; Fiat Chrysler Automobiles U.S. recently <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLRPT-19V757-7573.PDF\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">issued a recall</a> for more than 107,000 Ram pickup trucks produced between 2013 and 2019 for concerns that their exhaust gas recirculation coolers could pose a fire risk.</p>\n<p>Specifically, the 107,979 vehicles in the recall could see their EGR coolers experience thermal fatigue, which would cause that component to crack internally over time.</p>\n<p>The vehicles are in the 2014 through 2019 model years, and many are either Ram 1500 or 1500 Classic pickups with 3.0-liter Eco Diesel engines. Some of these trucks do not have the Eco Diesel engines but were built in the same production periods for these vehicles &#8211; ranging from June 12, 2013, to Oct. 23, 2019.</p>\n<h2>The Defect</h2>\n<p>If the EGR coolers in these trucks experience long-term thermal fatigue, they can crack internally, which would potentially introduced heated, vaporized coolant into its system while the engine is running. That mixture could interact with other hydrocarbons and air in the coolers and combust in the intake manifold, which in turn could result in an engine fire that could injure people in or near the vehicle, and otherwise damage the vehicle and property around it.</p>\n<p>Drivers in affected vehicles may be able to identify such a defect if they find they are unexpectedly running low on coolant, their in-vehicle heater isn&#8217;t working or if a warning light on the dashboard becomes illuminated.</p>\n<h2>Timeline of Events</h2>\n<p>Fiat Chrysler <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RMISC-19V757-6098.pdf\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">first opened an investigation</a> into this issue on May 22, 2019, after receiving multiple reports of fires in affected vehicles. In all cases, it was found that these originated in the general vicinity of the engine. Throughout July, the company met with engineers to understand what could possibly be happening under the hood of these vehicles to start the fires, and in the following two months held weekly meetings to review more information, including failed parts collected from the field.</p>\n<p>Throughout the remainder of September, multiple vehicles were inspected, along with warranty reports. Then on Oct. 11, the company found that more than 8,900 EGR cooler replacements had been ordered, with dozens more field reports related to failure of that component. While no accidents had happened, these fires resulted in four minor injuries.</p>\n<p>The company decided to initiate the recall Oct. 17.</p>\n<h2>The Solution</h2>\n<p>While the company does not yet have an official remedy for this issue, FCA plans to reimburse owners for the cost of repairing or replacing the components in such cases. Affected owners who already paid for repairs will be asked to keep the original receipt for these repairs or otherwise provide proof of payment so they can be properly reimbursed.</p>\n<p>Affected owners and dealers will be receive full notification of the recall on or around Dec. 13.</p>\n<p>For additional details about this recall, consumers can contact FCA U.S. by phone at 1-800-853-1403, or call the National Highway Traffic Safety Administration hotline at 1-888-327-4236.</p>\n<p>For more information on this or other recalls past or present, visit <a href=\"http://MotorSafety.org\" target=\"_blank\" rel=\"noopener noreferrer\">MotorSafety.org</a>.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=17683","createdAt":"2019-11-13T06:14:23.000Z","date_gmt":"2019-11-13T19:59:23.000Z","updatedAt":"2020-10-15T01:34:14.000Z","modified_gmt":"2020-10-15T15:19:14.000Z","display_date":"November 13, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V757000","recall_date":"October 24, 2019"},"year":2019,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/11/shutterstock_1233176011-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_1233176011","category":{"id":9,"name":"RAM","slug":"ram-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/11/RAM.png"},"tags":[{"id":1267,"name":"2014-2019 RAM 1500 recall","slug":"2014-2019-ram-1500-recall"},{"id":1268,"name":"RAM classic recall","slug":"ram-classic-recall"},{"id":1269,"name":"RAM Eco Diesel recall","slug":"ram-eco-diesel-recall"},{"id":1270,"name":"RAM EGR cooler","slug":"ram-egr-cooler"}],"categories":[{"id":9,"name":"RAM","slug":"ram-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/11/RAM.png"}]},{"id":17682,"title":"BMW Recalls SUVs for Faulty Steering Pinion","link":"https://www.motorsafety.org/bmw-recalls-suvs-for-faulty-steering-pinion/","status":"publish","slug":"bmw-recalls-suvs-for-faulty-steering-pinion","excerpt":"<p>BMW of North America recently determined that it will need to recall 20 of its light SUV models for issues with a steering pinion gear that could lead to crash risk.</p>\n","description":"\n<p><em>Laguna Hills, CA &#8211; November 8, 2019</em> &#8211; BMW of North America recently determined that it <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLQRT-19V738-6715.PDF\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"will need to recall (opens in a new tab)\">will need to recall</a> 20 of its 2020 light SUV models due to concerns over a defect in the production process for a steering pinion gear, which could lead to increased crash risk.</p>\n\n\n\n<p>Of the vehicles in the recall, all but one are 2020 BMW X3 M40i crossover SUVs, and the other is a&nbsp;2020 BMW X3 M40i. All those light SUVs are expected to have this issue.</p>\n\n\n\n<h2><strong>The defect</strong></h2>\n\n\n\n<p>The affected X3 and X4 SUVs likely contain a steering pinion gear that is suspected to have been produced outside specification, and were made within a two-day span &#8211; September 27 and 28, 2019. </p>\n\n\n\n<p>During the manufacturing process for these components, a supplier likely did not produce the gears with a proper mixing ratio in the quenching bath. </p>\n\n\n\n<p>Consequently, the teeth of the pinion gears would not be hard enough to withstand certain driving conditions, and have the potential to break under pressure. That would likely lead to a loss of steering and, consequently, control of the vehicle.</p>\n\n\n\n<p>These conditions, in turn, greatly increase the risk of a crash. The recall population was determined based on supplier production data that was then checked against vehicle assembly information on BMW&#8217;s end.</p>\n\n\n\n<h2><strong>Timeline of events</strong></h2>\n\n\n\n<p>On October 1, just a few days after these vehicles were produced, BMW of North America received word from the components&#8217; supplier &#8211; based in Greenville, South Carolina &#8211; that a specific production lot may have contained the steering pinion gears that were not hard enough to meet specification. </p>\n\n\n\n<p>The auto maker then issued a hold on vehicles that may have been affected, and conducted a review to see if these gears may have been delivered and used in the assembly of any vehicles.</p>\n\n\n\n<p>Within a few days, the company found that some vehicles had likely been affected, and identified which ones fell into this population. </p>\n\n\n\n<p>A little more than a week after receiving the report from the supplier, BMW issued the voluntary recall on October 9, but had not received any reports of accidents or injuries related to the problem in question.</p>\n\n\n\n<p>The company notified dealers of the recall on October 16, and notified one likely affected owner on October 9.</p>\n\n\n\n<h2><strong>The solution</strong></h2>\n\n\n\n<p>To date, only one of the vehicles in the recall had an owner. That person was reached by phone and told not to drive the vehicle until it could be repaired by having the steering pinion gear replaced. The vehicle was transported to a nearby dealership for the remedy shortly thereafter.</p>\n\n\n\n<p>Because this was essentially a single-vehicle recall at that point, BMW did not anticipate having to notify any other drivers via first class mail as it normally would in a recall situation. </p>\n\n\n\n<p>However, if any more of these issues come to light, the repairs would fall under the BMW New Vehicle Limited Warranty, as the affected light SUVs are all from the 2020 model year. Reimbursement would, therefore, not be necessary.</p>\n\n\n\n<p>Check your car’s recall status using MotorSafety’s <a href=\"https://www.motorsafety.org/\">free vehicle lookup tool</a>.</p>\n<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script>","source":"https://www.motorsafety.org/?p=17682","createdAt":"2019-11-13T06:12:08.000Z","date_gmt":"2019-11-13T19:57:08.000Z","updatedAt":"2020-10-15T01:37:41.000Z","modified_gmt":"2020-10-15T15:22:41.000Z","display_date":"November 13, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V738000","recall_date":"October 16, 2019"},"year":2019,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/11/BMW-X3-M40i-768x513.jpg","alt_text":"Navy blue BMW X3 M40i by the sea.","cld_public_id":"BMW-X3-M40i","category":{"id":15,"name":"BMW","slug":"bmw-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/bmw_RM.png"},"tags":[{"id":1271,"name":"2020 BMW X3 M40i recall","slug":"2020-bmw-x3-m40i-recall"},{"id":1272,"name":"BMW steering issue","slug":"bmw-steering-issue"},{"id":1273,"name":"BMW steering pinion gear","slug":"bmw-steering-pinion-gear"}],"categories":[{"id":15,"name":"BMW","slug":"bmw-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/bmw_RM.png"}]},{"id":17681,"title":"Porsche issues recall on Cayennes and Panameras","link":"https://www.motorsafety.org/porsche-issues-recall-on-cayennes-and-panameras/","status":"publish","slug":"porsche-issues-recall-on-cayennes-and-panameras","excerpt":"<p>Porsche Cars North America will have to recall tens of thousands of its Panamera hatchbacks and Cayenne light SUVs due to faulty brake warning lights.</p>\n","description":"<p>Laguna Hills, CA &#8211; Nov. 11, 2019 &#8211; Porsche Cars North America <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLRPT-19V735-1282.PDF\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">recently revealed</a> that it will have to recall tens of thousands of its Panamera hatchbacks and Cayenne light SUVs in the near future, due to an issue with their brake warning indicators.</p>\n<p>Specifically, the recall involves 44,128 vehicles &#8211; 100% of which are expected to have the issue in question &#8211; including those that have been recalled previously, such as:</p>\n<ul>\n<li>Porsche Panamera hatchback variants from the 2017 and 2018 model years.</li>\n<li>Porsche Cayenee light SUV variants from the 2019 and 2020 model years.</li>\n</ul>\n<p>In both cases, it seems a faulty software update is to blame for the issues that led to the recall.</p>\n<h2>The Defect</h2>\n<p>All vehicles in this Porsche recall were originally subject to a recall in February 2019, as well as vehicles that were found to potentially have this problem but which had not been identified during the first recall. All were identified using data regarding production dates, and every vehicle in the recall is expected to carry a software defect.</p>\n<p>The defect in the vehicles&#8217; software will make it so that, if the brake pad&#8217;s are worn down to dangerous levels and need to be replaced, the red dashboard warning light meant to indicate a potential problem will not illuminate. This could be particular problematic for drivers who look at these displays in the &#8220;map&#8221; or &#8220;night vision&#8221; submenus on the dashboard screen.</p>\n<p>The only way drivers would be able to tell there was an issue with their brake pads at all would be a yellow warning message in the vehicles&#8217; multi-functional displays, though those could easily be dismissed by the operator until they turn the vehicles on again. In certain traffic conditions, driving on worn-out brake pads could increase the risk of a crash.</p>\n<p>Affected Panameras were produced from Sept. 23, 2016 to Dec. 21, 2018. Affected Cayennes were manufactured between April 4, 2018, and Aug. 2, 2019. However, the identification numbers on the vehicles in the recall were non-sequential.</p>\n<h2>Timeline of Events</h2>\n<p>The original recall mentioned above was initiated Feb. 20, 2019, and was meant to address this software problem. Porsche attempted at the time to develop and implement a software patch that would create a brake-wear warning light that remained continuously illuminated, given the gravity of such a problem.</p>\n<p>However, after installing that software patch on affected vehicles, the company learned that this solution was also faulty &#8211; specifically, it would not show up as continuously lit in the display&#8217;s map and night vision modes. Posche identified this issue later on, which prompted an additional investigation to determine how many more vehicles may have been affected by the problem. Based on those findings, the auto manufacturer issued a secondary recall on Oct. 9, 2019 to supersede the first action.</p>\n<p>The company noted that Panameras manufactured on or after June 19, 2019, and Cayennes produced on or after July 29, 2019, will not have this software problem.</p>\n<h2>The Solution</h2>\n<p>Drivers of affected vehicles should take their Posches to a dealership, where the new software will be added to those vehicles&#8217; systems. This includes both owners of vehicles that had not previously been involved in the recall &#8211; who will soon receive notification from the manufacturer about this problem &#8211; and those who already received a remedy.</p>\n<p>Dealers received notification of the recall on Oct. 16, 2019, and owners can expect to receive notifications of their own around Dec. 16.</p>\n<p>For additional information about this recall, consumers can contact Porsche Cars North America by phone at 1-800-767-7243, or call the National Highway Traffic Safety Administration hotline at 1-888-327-4236.</p>\n<p>For more information on this or other recalls past or present, visit <a href=\"http://MotorSafety.org\" target=\"_blank\" rel=\"noopener noreferrer\">MotorSafety.org</a>.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=17681","createdAt":"2019-11-13T06:02:05.000Z","date_gmt":"2019-11-13T19:47:05.000Z","updatedAt":"2020-10-15T01:45:44.000Z","modified_gmt":"2020-10-15T15:30:44.000Z","display_date":"November 13, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V735000","recall_date":"October 16, 2019"},"year":2019,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/11/shutterstock_1367015729-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_1367015729","category":{"id":25,"name":"Porsche","slug":"porsche-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/porsche.jpg"},"tags":[{"id":1274,"name":"2017-2018 Porsche Panamera recall","slug":"2017-2018-porsche-panamera-recall"},{"id":1275,"name":"2019-2020 Porsche Cayenne recall","slug":"2019-2020-porsche-cayenne-recall"},{"id":1276,"name":"Porsche brake warning light","slug":"porsche-brake-warning-light"}],"categories":[{"id":25,"name":"Porsche","slug":"porsche-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/porsche.jpg"}]},{"id":17680,"title":"Two BMW Models Recalled for Faulty Components","link":"https://www.motorsafety.org/two-bmw-models-recalled-for-faulty-components/","status":"publish","slug":"two-bmw-models-recalled-for-faulty-components","excerpt":"<p>BMW of North America recently announced that it will recall two different models &#8211; both sedans &#8211; due to potentially faulty engine components.</p>\n","description":"\n<p><em>Laguna Hills, CA &#8211; November 6, 2019</em> &#8211; BMW of North America recently announced that it will recall two different models &#8211; both sedans &#8211; due to potentially faulty engine components.</p>\n\n\n\n<p>In all, 217 vehicles &#8211; 100% of which are expected to contain the defect &#8211; are involved in the recall, including:</p>\n\n\n\n<ul><li>205 BMW 330i and 330i xDrive four-door sedans from the 2019 and 2020 model years</li><li>12 BMW Z4 two-door sedan from the 2020 model year</li></ul>\n\n\n\n<p>It is expected that all of the recalled components may not have been produced within specifications.</p>\n\n\n\n<h2><strong>The defect</strong></h2>\n\n\n\n<p>All 217 vehicles in the recall were made with an engine that contains needle roller bearings for counterbalance shafts that may not have been properly installed initially. </p>\n\n\n\n<p>Specifically, this started during the production process, which may have been out of specification, during set production periods that vary by model. </p>\n\n\n\n<p>For the 330i and 330i xDrive models in the recall, this lasted from November 22, 2018 to August 26, 2019. For the Z4s, it stretched from May 24, 2018, to April 3, 2019.</p>\n\n\n\n<p>Due to the potentially improper installation process, affected needle roller bearings could lead to the counterbalance shaft loosening, causing severe engine damage. </p>\n\n\n\n<p>That, in turn, could lead to the engines in recalled vehicles shutting down, increasing the risk of a crash. Drivers would be able to notice if this happened to their vehicles because there would be a loud noise emanating from&nbsp;the engine compartment.</p>\n\n\n\n<h2><strong>Timeline of events</strong></h2>\n\n\n\n<p>In May 2019, BMW was made aware of two separate instances in which drivers of affected vehicles heard the aforementioned&nbsp;noises, right before their vehicles broke down. </p>\n\n\n\n<p>The first of these involved a 2019 3 Series sedan that had been made in February, and the second, involving a vehicle outside the U.S., was made in April. Both vehicles had low&nbsp;mileages, and the engines were flagged for return, tear down and analysis.&nbsp;</p>\n\n\n\n<p>In June, BMW of North America conducted an engineering review &nbsp;of both engines and initially found that the counterbalance shaft&#8217;s needle roller bearings may have been to blame for the breakdowns. </p>\n\n\n\n<p>Further analysis included looking into the production process while the company continued to monitor other vehicles in the field.</p>\n\n\n\n<p>During that analysis period, another similar breakdown, this time including a 5 Series sedan that was made in May, occurred in September.</p>\n\n\n\n<p>The engineering review eventually found that the press-in force for some needle roller bearings of the counterbalance shafts was smaller than specified, and engine production records indicated which of these components were&nbsp;affected by the defect based on production dates. </p>\n\n\n\n<p>That, in turn, allowed BMW to determine which vehicles to recall, and the voluntary order itself was made on October 8.</p>\n\n\n\n<p>To date, the company has not received any reports of accidents or injuries related to the defect.</p>\n\n\n\n<h2><strong>The solution</strong></h2>\n\n\n\n<p>Owners of affected vehicles will be asked to bring their vehicles to authorized BMW dealers to have the engines replaced free of charge. These changes will be covered by the BMW New Vehicle Limited Warranty program and therefore will not require reimbursement.</p>\n\n\n\n<p>Dealers received notification of the recall on October 15, and owners should get letters via First Class mail on or around December 6.</p>\n\n\n\n<p>Check your car’s recall status using MotorSafety’s <a href=\"https://www.motorsafety.org/\">free vehicle lookup tool</a>.</p>\n<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script>","source":"https://www.motorsafety.org/?p=17680","createdAt":"2019-11-13T05:54:02.000Z","date_gmt":"2019-11-13T19:39:02.000Z","updatedAt":"2020-10-05T07:08:18.000Z","modified_gmt":"2020-10-05T20:53:18.000Z","display_date":"November 13, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":"November 6, 2019"},"year":2019,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/11/shutterstock_1778134298-768x256.jpg","alt_text":"","cld_public_id":"shutterstock_1778134298","category":{"id":15,"name":"BMW","slug":"bmw-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/bmw_RM.png"},"tags":[{"id":710,"name":"2019 - 2020 205 BMW 330i","slug":"2019-2020-205-bmw-330i"},{"id":690,"name":"2019 - 2020 BMW 330i xDrive","slug":"2019-2020-bmw-330i-xdrive"},{"id":669,"name":"BMW recall","slug":"bmw-recall"},{"id":408,"name":"Crash Risk","slug":"crash-risk"},{"id":258,"name":"engine","slug":"engine"},{"id":711,"name":"Engine Damage","slug":"engine-damage"},{"id":260,"name":"xDrive","slug":"xdrive"},{"id":261,"name":"Z4","slug":"z4"}],"categories":[{"id":15,"name":"BMW","slug":"bmw-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/bmw_RM.png"}]},{"id":17676,"title":"Cadillac Luxury Sedan Recalled Over Sensor Issue","link":"https://www.motorsafety.org/cadillac-luxury-sedan-recalled-over-sensor-issue/","status":"publish","slug":"cadillac-luxury-sedan-recalled-over-sensor-issue","excerpt":"<p>General Motors recently notified dealers that it would have to recall a small population of its Cadillac CT6 luxury sedans due to a problem with their tire pressure sensors.</p>\n","description":"\n<p><em>Laguna Hills, CA &#8211; November 5, 2019</em> &#8211; General Motors recently notified dealers that it would have to recall a <a rel=\"noopener noreferrer nofollow\" href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLRPT-19V731-2375.PDF\" target=\"_blank\">small population of its Cadillac CT6 luxury sedans</a> due to a problem with their tire pressure sensors.</p>\n\n\n\n<p>In all, just 81 CT6 sedans from the 2020 model year will be recalled &#8211;&nbsp;100%&nbsp;of which were identified as having this issue. The company noted that similar vehicles that did not have the accessory wheels installed at their dealers are not included in this recall.</p>\n\n\n\n<h2>The defect</h2>\n\n\n\n<p>Specifically, these vehicles &#8211; all produced between August 1 and September 9, 2019 &#8211; came equipped with specific accessory wheels that had been installed by dealers, but which do no meet <a href=\"https://www.federalregister.gov/documents/2007/07/12/07-3382/federal-motor-vehicle-safety-standards-tire-pressure-monitoring-systems\">Federal Motor Vehicle Safety Standard rules</a> related to tire pressure monitoring systems. </p>\n\n\n\n<p>This is because their sensors do not use the proper wireless radio frequency to communicate with the vehicle&#8217;s computer, and as a consequence, the system may not be able to properly alert drivers &#8211; via a warning light on the dashboard &#8211; that tire pressure has dropped to potentially dangerous low levels.</p>\n\n\n\n<p>The problem at the heart of the issue is that incorrect part numbers for the tire pressure sensors were put into GM&#8217;s ordering system. </p>\n\n\n\n<p>Ideally, the automatic system would turn on the warning light after 18 minutes of driving at least 28 miles per hour on tires with low pressure, but because of the mismatched radio frequency, this would not occur.</p>\n\n\n\n<p>As a result, drivers may not know of the risks they face unless they manually check their tire pressure before or after a trip. Low pressure can have a detrimental effect on vehicle handling or lead to tire failure, both of which would increase the risk of an accident.</p>\n\n\n\n<h2>Timeline of events</h2>\n\n\n\n<p>In September, General Motors received a report about the issue through its Speak Up for Safety program that the wrong tire pressure sensors had been installed on the affected CT6 sedans with specific accessory wheels. </p>\n\n\n\n<p>On September 24, the company opened an investigation into the issue, consulting with subject-matter experts and the company&#8217;s regulatory engineers. </p>\n\n\n\n<p>The GM Open Investigation Review board looked at the findings of this examination on Oct. 7 and recommended that the company issue a recall.</p>\n\n\n\n<p>Two days later, the GM Safety Field Action Decision Authority followed through on that recommendation.</p>\n\n\n\n<h2>The solution</h2>\n\n\n\n<p>Upon receiving their recall notices, owners should take their affected CT6 sedans to a certified GM dealer, where all four tire pressure sensors will be replaced with proper parts that use the right wireless frequency to communicate with the vehicle. </p>\n\n\n\n<p>Given that these are all 2020 model year vehicles, the repairs are covered by warranty and no reimbursement will be offered.</p>\n\n\n\n<p>The investigation also found that the incorrect part number that led to the wrong sensors being installed was corrected within GM&#8217;s ordering system on September 11. This means that all accessory kits shipped to dealers after that date had the correct sensors.</p>\n\n\n\n<p>Dealers were notified of the recall on October 15, and owner notification dates are yet to be decided.</p>\n\n\n\n<p>Check your car’s recall status using MotorSafety’s <a href=\"https://www.motorsafety.org/\">free vehicle lookup tool</a>.</p>\n<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script>","source":"https://www.motorsafety.org/?p=17676","createdAt":"2019-11-06T04:42:33.000Z","date_gmt":"2019-11-06T18:27:33.000Z","updatedAt":"2020-11-06T02:07:40.000Z","modified_gmt":"2020-11-06T15:52:40.000Z","display_date":"November 06, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V731000","recall_date":"October 15, 2019"},"year":2019,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/11/shutterstock_620251463-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_620251463","category":{"id":36,"name":"Cadillac","slug":"cadillac-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/cadillac.png"},"tags":[{"id":785,"name":"2020 Cadillac CT6 sedans","slug":"2020-cadillac-ct6-sedans"},{"id":1277,"name":"Cadillac tire pressure sensor recall","slug":"cadillac-tire-pressure-sensor-recall"}],"categories":[{"id":36,"name":"Cadillac","slug":"cadillac-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/cadillac.png"}]},{"id":17675,"title":"Mercedes-Benz faces recall over window trim","link":"https://www.motorsafety.org/mercedes-benz-faces-recall-over-window-trim/","status":"publish","slug":"mercedes-benz-faces-recall-over-window-trim","excerpt":"<p>Mercedes-Benz USA recently had to recall a number of vehicles in its 2020 model year for issues related to mounted rear window trim bars that were outside of company specification.</p>\n","description":"<p>Laguna Hills, CA &#8211; Nov. 4, 2019 &#8211; Mercedes-Benz USA recently had to issue a <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLQRT-19V709-4408.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">recall</a> for a number of light sport utility vehicles in its 2020 model year for issues related to mounted rear window trim bars that were installed outside of company specifications.</p>\n<p>Altogether, nearly 13,800 vehicles were involved in the recall, all of which are believed to carry this defect. This includes the following light SUVs, all in the 2020 line:</p>\n<ul>\n<li>10,068 GLE350 4MATICs</li>\n<li>2,290 GLE450 4MATICs</li>\n<li>1,148 GLS450 4MATICs</li>\n<li>22 GLS580 4MATICs</li>\n<li>1 GLE350</li>\n</ul>\n<p>It is believed 100% of the specific vehicles in the recall carry the defect in question. Those light SUVs were identified via production records, and many have non-sequential vehicle identification numbers. However, many other vehicles sharing the same model year but which outside the recall group have trim bars that were installed properly.</p>\n<h2>The Defect</h2>\n<p>Specifically, all those vehicles &#8211; each one a GLE-Class or GLS-Class light SUVs produced between Aug. 23, 2018, and Sept. 27, 2019 &#8211; have a trim bar fastening on the rear door windows that could, under certain driving conditions, separate from the vehicle entirely. While this would not pose a likely risk to the drivers of these vehicles themselves, others around them on the road could be injured or become more likely to crash as a result of such a detachment.</p>\n<p>The issue arises due to a tolerance deviation at the supplier, and unfortunately drivers of these vehicles will not be able to detect whether their fastenings are at risk for failure.</p>\n<h2>Timeline of Events</h2>\n<p>Around mid-August of this year, Daimler Auto Group &#8211; which controls Mercedes-Benz USA &#8211; received a report of a situation in which one such rear door window fastening failure occurred on a GLE-Class light SUV. The company then began an investigation into the issue, to better understand how it began and what could happen in the event of a failure. Over the course of about six weeks, the investigation determined that the issue came at the supplier level, and it would need to be addressed in short order.</p>\n<p>On Sept. 27, the company determined that it could not rule out this issue becoming a safety problem for the other affected vehicles, and ordered the voluntary recall at that time.</p>\n<h2>The Solution</h2>\n<p>Drivers who receive the recall notice should return to an authorized Mercedes-Benz dealer. There, technicians will check the fastening on the rear door windows and, if necessary, rework them so that they once again fall within specification at no cost.</p>\n<p>However, the company does not plan to provide any notice about pre-notice reimbursements for owners of these vehicles, as all the affected models are within warranty, given that they are in the 2020 model year. The company also noted that as of Sept. 27, the design tolerances of the parts DAG receives from the Kentucky-based supplier has changed, so no further issues of this type will occur.</p>\n<p>Mercedes-Benz dealers were first notified of the voluntary recall on Oct. 11, and owners of these vehicles will receive their own notifications around the first week of December.</p>\n<p>For additional information about this recall, consumers can contact Mercedes-Benz USA via phone at 1-877-496-3691, or call the National Highway Traffic Safety Administration hotline at 1-888-327-4236.</p>\n<p>For more information on this or other recalls past or present, visit <a href=\"http://MotorSafety.org\" target=\"_blank\" rel=\"noopener noreferrer\">MotorSafety.org</a>.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=17675","createdAt":"2019-11-06T04:40:14.000Z","date_gmt":"2019-11-06T18:25:14.000Z","updatedAt":"2020-10-15T01:57:23.000Z","modified_gmt":"2020-10-15T15:42:23.000Z","display_date":"November 06, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V709000","recall_date":"October 4, 2019"},"year":2019,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/11/shutterstock_1668412747-1-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_1668412747-1","category":{"id":5,"name":"Mercedes-Benz","slug":"mercedes-benz-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mercedes_RM.png"},"tags":[{"id":1278,"name":"2020 Mercedes-Benz GLE350 recall","slug":"2020-mercedes-benz-gle350-recall"},{"id":1279,"name":"2020 Mercedes-Benz GLE450 recall","slug":"2020-mercedes-benz-gle450-recall"},{"id":1280,"name":"2020 Mercedes-Benz GLS450 recall","slug":"2020-mercedes-benz-gls450-recall"},{"id":1281,"name":"2020 Mercedes-Benz GLS580 recall","slug":"2020-mercedes-benz-gls580-recall"},{"id":1282,"name":"Mercedes-Benz light SUV recall","slug":"mercedes-benz-light-suv-recall"},{"id":1283,"name":"Mercedes-Benz window trim","slug":"mercedes-benz-window-trim"}],"categories":[{"id":5,"name":"Mercedes-Benz","slug":"mercedes-benz-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mercedes_RM.png"}]},{"id":17668,"title":"Chrysler Announces Recall on Certain Ram 1500 Trucks","link":"https://www.motorsafety.org/chrysler-announces-recall-on-certain-ram-1500-trucks/","status":"publish","slug":"chrysler-announces-recall-on-certain-ram-1500-trucks","excerpt":"<p>New recall of certain 2014-2019 Ram 1500 trucks, including some 1500 Classic Pickup vehicles, was announced by Chrysler earlier this month.</p>\n","description":"\n<p><em>Laguna Hills, CA – October 31, 2019</em> – The recall of certain 2014 &#8211; 2019 Ram 1500 trucks, including some 1500 Classic Pickup vehicles, was announced by Chrysler earlier this month. </p>\n\n\n\n<p>All trucks involved with the recall are equipped with 3.0L Eco Diesel engines that have been outfitted with a faulty exhaust gas recirculation (EGR) cooler.</p>\n\n\n\n<h2><strong>The defect</strong></h2>\n\n\n\n<p>The <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLRPT-19V757-7573.PDF\" rel=\"noopener noreferrer nofollow\">safety recall report</a> filed with the National Highway Traffic Safety Administration explains that the issue involves the EGR coolers on vehicles listed for the recall. The defect leaves the coolers susceptible to thermal fatigue.</p>\n\n\n\n<p>&#8220;Thermal fatigue may cause the cooler to crack internally over time,&#8221; stated Chrysler&#8217;s own description of the defect within the safety recall report. </p>\n\n\n\n<p>&#8220;An EGR cooler with an internal crack will introduce pre-heated, vaporized coolant to the EGR system while the engine is running &#8230; potentially resulting in combustion within the intake manifold, which may lead to a vehicle fire.&#8221;&nbsp;</p>\n\n\n\n<p>More than 100,000 vehicles are involved in the recall, all of which are expected to contain the defect. Chrysler utilized engine assembly plant records and other information to determine which vehicles were built with the &#8220;suspect&#8221; EGR coolers.</p>\n\n\n\n<h2><strong>Timeline of events</strong></h2>\n\n\n\n<p>The first signs of the defect came in May 2019,&nbsp;when an investigation was opened into engine compartment fires in Ram 1500 3.0L Eco Diesel trucks, according to the chronology report provided by Chrysler. </p>\n\n\n\n<p>An inquiry running through October revealed numerous instances of warranty reports and associated repair orders that were related to the defect. </p>\n\n\n\n<p>Meetings with diesel engineers and vehicles inspected from other countries allowed the manufacturer to &#8220;better understand the fire dynamics involved, and to rule out climate as a potential exacerbating factor.&#8221;</p>\n\n\n\n<p>The decision to conduct a vehicle recall was made on October 17, after Chrysler had identified more than 60 field reports potentially related to EGR cooler failure. </p>\n\n\n\n<h2><strong>The solution</strong></h2>\n\n\n\n<p>According to&nbsp;<a rel=\"noopener noreferrer nofollow\" href=\"https://static.nhtsa.gov/odi/rcl/2019/RCAK-19V757-4850.pdf\">paperwork Chrysler has filed with the NHTSA</a>, the recall itself is expected to begin sometime in December 2019, although the remedy itself remains under development at the current time. </p>\n\n\n\n<p>For more information on vehicle recalls, be sure to <a href=\"http://motorsafety.org\">use MotorSafety.org&#8217;s free look-up tool</a>.&nbsp;</p>\n<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script>","source":"https://www.motorsafety.org/?p=17668","createdAt":"2019-11-01T06:15:05.000Z","date_gmt":"2019-11-01T20:00:05.000Z","updatedAt":"2020-11-06T02:38:50.000Z","modified_gmt":"2020-11-06T16:23:50.000Z","display_date":"November 01, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V757000","recall_date":"October 31, 2019"},"year":2019,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/11/shutterstock_244912069-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_244912069","category":{"id":20,"name":"Chrysler","slug":"chrysler-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/chrysler_RM.png"},"tags":[{"id":903,"name":"2014 - 2019 Ram 1500 trucks","slug":"2014-2019-ram-1500-trucks"},{"id":904,"name":"Eco Diesel engines","slug":"eco-diesel-engines"},{"id":247,"name":"EGR cooler","slug":"egr-cooler"},{"id":248,"name":"exhaust gas recirculation","slug":"exhaust-gas-recirculation"}],"categories":[{"id":20,"name":"Chrysler","slug":"chrysler-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/chrysler_RM.png"},{"id":9,"name":"RAM","slug":"ram-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/11/RAM.png"}]},{"id":17669,"title":"GM Recalls Numerous Vehicles Due to Electronic Stability Control Malfunction","link":"https://www.motorsafety.org/gm-recalls-numerous-vehicles-due-to-electronic-stability-control-malfunction/","status":"publish","slug":"gm-recalls-numerous-vehicles-due-to-electronic-stability-control-malfunction","excerpt":"<p>General Motors has recently informed the National Highway Traffic Safety Administration of a recall involving five different vehicles, all of which share the same wheel-speed sensor defect.</p>\n","description":"\n<p><em>December 16, 2021</em> <em>Update</em> – General Motors (NYSE:GM) has remedied issues with 524,144 models dealing with a software error that can cause unintended braking. Additionally, 2,577 models including the 2020 Tahoe and the 2020 Yukon have been categorized as unreachable, and 26 models have been removed from the recall. These models were remedied in 3 different years, the first group in 2019, four groups in 2020, and two more were fixed in 2021 by these <a href=\"https://www.motorsafety.org/general-motors-trucks-recalled-for-a-software-error/\">incorrect calibrations in the EBCM which has also presented other software errors in many other GM models</a>.</p>\n\n\n\n<p><em>Laguna Hills, CA. – November 1, 2019</em> – General Motors recently informed the National Highway Traffic Safety Administration of a <a href=\"https://static.nhtsa.gov/odi/rcl/2020/RMISC-20V055-5846.pdf\">recall involving five different vehicle models including the Chevrolet Silverado 1500 and GMC Sierra 1500</a>, all of which share the same defect.</p>\n\n\n\n<p><strong>Affected vehicles include:</strong></p>\n\n\n\n<ul><li>2015 &#8211; 2020 Chevrolet Suburban</li><li>2015 &#8211; 2020 Tahoe</li><li>2015 -2020 Yukon</li><li>2014 &#8211; 2018 Chevrolet Silverado 1500</li><li>GMC Sierra 1500 vehicles equipped with a 5.3-liter engine, a 3.08-ratio rear axle and four-wheel drive</li></ul>\n\n\n\n<h2><strong>The defect</strong></h2>\n\n\n\n<p>According to the official report regarding this issue filed by GM with the NHTSA, the vehicles involved in the recall contain a defect caused by incorrect axle-ratio calibrations in the vehicles&#8217; electronic-brake control module (EBCM).</p>\n\n\n\n<p>The flaw can cause the module to incorrectly calculate the speed of a wheel that has a faulted wheel-speed sensor. In specific operating conditions and vehicles, this can trigger the vehicle&#8217;s driveline protection system at an inopportune time.</p>\n\n\n\n<p>&#8220;If a wheel speed sensor fails in these vehicles, a software error in the vehicle&#8217;s EBCM can cause the vehicle&#8217;s driveline protection system to activate when (i) the vehicle&#8217;s electronic transfer case is set to four-wheel drive or automatic mode, and (ii) the vehicle is driven between the speeds of 41 and 60 MPH,&#8221; stated <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLRPT-19V761-4660.PDF\">GM&#8217;s report on the matter</a>.</p>\n\n\n\n<p>&#8220;If the [system] activates, the driver will experience unintended braking on the wheel on the opposite side of the failed sensor, which can be considered as one of the many <a href=\"https://www.motorsafety.org/tag/crash-risk/\">failures that increase the risk of collision in different brands and models</a>.&#8221;</p>\n\n\n\n<h2><strong>Timeline of events</strong></h2>\n\n\n\n<p>The first report involving the recall arrived May 21, when a GM dealer submitted a warranty report to the manufacturer involving a 2018 GMC Yukon whose owner reported that, while driving between 40 and 45 MPH, the brakes were involuntarily applied and caused the vehicle to pull leftward.</p>\n\n\n\n<p>A test of the vehicle confirmed the report, and further investigations revealed all the vehicles which might contain the defect.</p>\n\n\n\n<p>&#8220;GM and ZF (the EBCM supplier) isolated the condition to certain K2 platform vehicles equipped with 5.3-liter engines, four-wheel drive, and 3.08-ratio rear axles, and to specific operating conditions,&#8221;</p>\n\n\n\n<p>the <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RMISC-19V761-7751.pdf\">chronology report provided by GM</a> explained.</p>\n\n\n\n<p>The decision to conduct the recall was made official on Oct. 17. </p>\n\n\n\n<h2><strong>The solution</strong></h2>\n\n\n\n<p>Owners of vehicles involved in the recall will be notified sometime in the near future, although the exact schedule has yet to be set. Authorized dealers will reprogram the EBCM for affected automobiles on behalf of GM, free of charge.</p>\n\n\n\n<h2><strong>Is your vehicle part of this recall?</strong></h2>\n\n\n\n<p>Over 650,000 vehicles are included in this GM recall. To see if your car is one of them, use MotorSafety’s<a href=\"https://www.motorsafety.org/\"> free vehicle lookup tool.</a></p>\n","source":"https://www.motorsafety.org/?p=17669","createdAt":"2019-11-01T06:10:32.000Z","date_gmt":"2019-11-01T19:55:32.000Z","updatedAt":"2022-01-20T11:18:02.000Z","modified_gmt":"2022-01-21T01:03:02.000Z","display_date":"November 01, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V761000","recall_date":"October 24, 2019","meta_title":"GM Recalls - Tahoe, Silverado - Electronic Brake Control Module","meta_description":"GM recalls several 2020 Tahoe, 2020 Yukon, and other models by a software error that can cause unintended braking due to incorrect calibrations in the EBCM.","meta_keywords":"GM Recalls, Chevrolet Tahoe recalls, gm software error, gm electronic brake control module recall","custom_schema":""},"year":2019,"month":11,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/11/Black-2019-Chevy-Tahoe-768x513.jpg","alt_text":"Black 2019 Chevy Tahoe in desert recall","cld_public_id":"Black-2019-Chevy-Tahoe","category":{"id":12,"name":"Chevrolet","slug":"chevrolet-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/chevy_ms.png"},"tags":[{"id":866,"name":"2014 - 2018 Chevrolet Silverado 1500","slug":"2014-2018-chevrolet-silverado-1500"},{"id":863,"name":"2015 - 2020 Chevrolet Suburban","slug":"2015-2020-chevrolet-suburban"},{"id":864,"name":"2015 - 2020 Tahoe","slug":"2015-2020-tahoe"},{"id":865,"name":"2015 -2020 Yukon","slug":"2015-2020-yukon"},{"id":349,"name":"brake systems","slug":"brake-systems"},{"id":867,"name":"GMC Sierra 1500","slug":"gmc-sierra-1500"}],"categories":[{"id":12,"name":"Chevrolet","slug":"chevrolet-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/chevy_ms.png"},{"id":72,"name":"GMC","slug":"gmc-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/gmc_RM.png"}]}]