[{"id":17660,"title":"McLaren Sennas Recalled Over Compromised Engine Harness","link":"https://www.motorsafety.org/mclaren-sennas-recalled-over-compromised-engine-harness/","status":"publish","slug":"mclaren-sennas-recalled-over-compromised-engine-harness","excerpt":"<p>McLaren Automotive announced it&#8217;s recalling a select number of Senna vehicles due to the possibility the model&#8217;s engine harness makes contact with a metal link pipe heat shield.</p>\n","description":"<p><span id=\"pk-id\" value=\"40047913\"></span></p>\n<p>Laguna Hills, CA &#8211; Oct. 28, 2019 &#8211; McLaren Automotive announced it&#8217;s recalling a select number of Senna vehicles due to the possibility the model&#8217;s engine harness makes contact with a metal link pipe heat shield. This may result in chafing, which could ultimately damage the wiring and perhaps cause the engine to power down. Such a scenario increases the risk of&nbsp;crash&nbsp;for motorists.</p>\n<p>McLaren has not announced when it intends to inform registered owners about this 2018-2019 Senna recall, but when the automaker does so, operators are encouraged to bring their car to an area dealer for a free repair.</p>\n<h3>The Defect</h3>\n<p>In filings with the National Highway Traffic Safety Administration, U.K.-based automaker McLaren <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCAK-19V613-1304.pdf\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">is recalling an estimated 129</a> 2018-2019 Senna two-door sports cars nationwide. The fear is that a constituent part of the engine harness may weaken and touch a metal link pipe heat shield. The abrasive rubbing that may ensue over time could cause the heat shield wrap to breach, exposing circuitry bunched within the harness itself. A number of potential consequences may occur as a result of&nbsp;the harness contacting the heat shield, including loss in engine power, reduced torque or the engine stalling. Any of these outcomes raises the risk of a crash.</p>\n<h3>Timeline of Events</h3>\n<p>McLaren first received warning about this engine issue <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLRPT-19V613-9220.PDF\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">back on Aug. 1</a>, so it decided to run some tests to see if the scenario would play out in trial analysis. The inquiry concluded that while there was evidence of chafing, it wasn&#8217;t so significant as to expose the wiring in the harness bundle.</p>\n<p>Nevertheless, the next day McLaren began a comprehensive investigation into whether the issue was anomalous or systemic and why it happened in the first place. Seventy-two hours later, on Aug. 5, results confirmed the issue was not isolated and a full-on voluntary recall was warranted. This decision was made on Aug. 14.</p>\n<h3>The Solution</h3>\n<p>Although the British nameplate has not given any indication as to when motorists will be notified, it does know how to fix the problem. Those informed by first-class mail should bring their Sennas to an authorized dealer. The repair will come at no cost to owners.</p>\n<p>For more information on the 2018-2019 Senna recall <a href=\"https://www.motorsafety.org/recall-news/\" target=\"_blank\" rel=\"noopener noreferrer\">and others</a> that are recent, visit <a href=\"https://www.motorsafety.org/\" target=\"_blank\" rel=\"noopener noreferrer\">MotorSafety.org</a>.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=17660","createdAt":"2019-10-30T02:41:00.000Z","date_gmt":"2019-10-30T16:26:00.000Z","updatedAt":"2020-10-01T02:47:04.000Z","modified_gmt":"2020-10-01T16:32:04.000Z","display_date":"October 30, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2019,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/10/shutterstock_1638594463-768x501.jpg","alt_text":"","cld_public_id":"shutterstock_1638594463","category":{"id":156,"name":"McLaren","slug":"mclaren-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2021/07/McLaren_Logo_j5v8y0.jpg"},"tags":[{"id":239,"name":"engine harness","slug":"engine-harness"},{"id":240,"name":"Senna","slug":"senna"}],"categories":[{"id":156,"name":"McLaren","slug":"mclaren-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2021/07/McLaren_Logo_j5v8y0.jpg"}]},{"id":17661,"title":"Hyundai Issues Two Recalls Related to Loose Parts","link":"https://www.motorsafety.org/hyundai-issues-two-recalls-related-to-loose-parts/","status":"publish","slug":"hyundai-issues-two-recalls-related-to-loose-parts","excerpt":"<p>Hyundai is issuing advisories to owners of its 2019 Ioniq Hybrid and 2020 Elantra vehicles that affect their safety. </p>\n","description":"<p>Laguna Hills, CA &#8211; Oct. 28, 2019 &#8211; Hyundai Motor America, an automaker with few recalls to speak of in 2019, is issuing advisories to owners of its 2019 Ioniq Hybrid and 2020 Elantra vehicles. There are two separate issues for the 2020 Elantra, one involving the lower control arm ball joint &#8211; which may also affect the Ioniq Hybrid &#8211; and the other potentially loose wheel lug nuts on the passenger-side right-rear wheel. Either of these problems manifesting themselves raises the risk of a crash and subsequent injury.</p>\n<p>The small-scale recall is expected to begin shortly after Christmas. Owners who receive notifications alerting them to these problems are advised to contact their nearest Hyundai dealer so the appropriate repair work can be performed, which will be free of charge.</p>\n<h2>The Defect</h2>\n<p><a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLQRT-19V721-5407.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">Hyundai is recalling</a> a total of 792 models over performance issues that could lead to the loss of control for operators of the compromised automobiles, according to the National Highway Traffic Safety Administration. The vehicles involved are as follows:</p>\n<ul>\n<li>2019 Ioniq Hybrid</li>\n<li>2020 Elantra</li>\n</ul>\n<p>The Ioniq Hybrid and Elantra may have lug nuts that weren&#8217;t installed snuggly enough during the manufacturing and assembly process, which are believed to be on the back-right side of the vehicle. The 2020 Elantras may also have ball joints whose fasteners could be poorly tightened, which may cause the lower control arm to detach completely.</p>\n<p>In either of these cases, a wheel or ball joint separating from the vehicle raises crash risk concerns that may also lead to an injury for the parties involved.</p>\n<h2>Timeline of Events</h2>\n<p>Whenever safety recalls are publicized &#8211; whether mandatory or voluntary &#8211; NHTSA publishes a Part 573 Safety Recall Report. These summarize recalls by detailing vehicle information &#8211; type, body style, power train, etc. It also includes data on when the cars were assembled and a chronology that pinpoints the months that certain actions were taken, such as when precisely the automaker discovered a potential issue. This report was not available at press time, however.</p>\n<p>Prior to these most recent Hyundai recalls, the last one occurred back in January. At the time, Hyundai removed 100,000 Santa Fe Sport and Sonata vehicles from the marketplace. This was done mainly for confirmation purposes to ensure that fuel tubes to the high-pressure pumps were installed correctly. The fuel tube recall took place originally in 2015 and 2017, according to a Hyundai <a href=\"https://www.hyundainews.com/en-us/releases/2696\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">press release</a>.</p>\n<p>During this same month, Kia Motors &#8211; an affiliate of Hyundai &#8211; recalled approximately 68,000 Optima, Sorento and Sportage models <a href=\"https://www.motorsafety.org/category/hyundai-recalls/\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">over engine fire fears</a> resulting from defective high-pressure fuel lines.</p>\n<p>When safety recalls are announced, automakers opt to extend the warranties in place  so they&#8217;re for more years or additional miles. Motorists affected by the most recent Hyundai recalls may want to get in touch with dealership they bought their automobiles from to find out more.</p>\n<h2>The Solution</h2>\n<p>While it&#8217;s unclear how many of the nearly 800 potentially problematic Hyundai contain the aforementioned flaws, owners should prioritize getting their vehicles checked out to know for sure. The Fountain Valley, California-based nameplate will distribute notifications by first-class mail starting Dec. 27. If appropriate, the parts in question will either be replaced or simply tightened.</p>\n<p>For more information on these most recent Hyundai recalls or for other safety issues, visit <a href=\"https://www.motorsafety.org/\" target=\"_blank\" rel=\"noopener noreferrer\">MotorSafety.org</a>. Enter your VIN in to determine if you may be one of the 25% of car owners who has an unaddressed recall.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=17661","createdAt":"2019-10-30T02:33:01.000Z","date_gmt":"2019-10-30T16:18:01.000Z","updatedAt":"2020-10-15T02:52:54.000Z","modified_gmt":"2020-10-15T16:37:54.000Z","display_date":"October 30, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V721000","recall_date":"October 9, 2019"},"year":2019,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/10/shutterstock_1709638384-1-768x513.jpg","alt_text":"","cld_public_id":"shutterstock_1709638384-1","category":{"id":10,"name":"Hyundai","slug":"hyundai-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/hyundai_RM.png"},"tags":[{"id":1284,"name":"2019 Hyundai Ioniq recall","slug":"2019-hyundai-ioniq-recall"},{"id":1285,"name":"2020 Hyundai Elantra recall","slug":"2020-hyundai-elantra-recall"},{"id":1286,"name":"Hyundai lug nut","slug":"hyundai-lug-nut"}],"categories":[{"id":10,"name":"Hyundai","slug":"hyundai-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/hyundai_RM.png"}]},{"id":17659,"title":"Another Recall Ordered For Subaru Impreza and Crosstrek Vehicles","link":"https://www.motorsafety.org/another-recall-ordered-for-subaru-impreza-and-crosstrek-vehicles/","status":"publish","slug":"another-recall-ordered-for-subaru-impreza-and-crosstrek-vehicles","excerpt":"<p>Approximately 205,000 Crosstrek and Imprezas distributed and manufactured by Subaru of America are due to be recalled over concerns that the engine may power off as a result of a faulty PCV valve.</p>\n","description":"<p>Laguna Hills, CA &#8211; Oct. 29, 2019 &#8211; Approximately 205,000 hatchbacks and SUVs distributed and manufactured by Subaru of America are <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLQRT-19V744-1939.PDF\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">due to be recalled</a> over concerns that the engine may power off as a result of a faulty PCV valve. The vehicles in question, Impreza and Crosstrek, are also subject to a separate recall related to potentially damaged electronic control modules.</p>\n<p>This particular Impreza and Crosstrek recall is scheduled to occur Dec. 13, which is the day Subaru expects to distribute notifications to owners informing of this engine cooling issue. Those who receive the communiques should bring their automobile to an area Subaru dealer so a repair can be arranged. There will be no charge for the fix, if one is needed.</p>\n<h2>The Defect</h2>\n<p>In paperwork submitted to the National Highway Traffic Safety Administration, Subaru is getting ready to recall 205,000 Imprezas and Crosstrek vehicles &#8211; model years 2017 through 2019 and 2018, respectively &#8211; after discovering the positive crank ventilation valve may be compromised in certain automobiles. Made from aluminum, the PCV valve may crack and cause the components within it to fall into the engine itself. Such a scenario could prevent the engine from functioning and lead to a crash should the engine turn off or cause the automobile to stall.</p>\n<h2>Timeline of Events</h2>\n<p>NHTSA maintains a portal that consumers can use to see when recall takes place and the events that led up to actions requiring correspondence with government traffic safety officials. Among the documents typically made available is what is known as a Product 573 Safety Recall Report. It chronicles recall-specific investigations on a month-to-month basis and also describes the proposed remedy to rectify the safety issues in question. However, this report was not made available at press time.</p>\n<p>Several Product 573 Recall Reports have been revealed by NHTSA in 2019 overall, and for <a href=\"https://www.motorsafety.org/category/subaru-recalls/\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">Subaru in particular</a>. One stemmed from faulty brake pedal mounting brackets that Subaru became aware of over the summer and another for defective driveshafts. The driveshaft problem first came to Subaru&#8217;s attention in June and the voluntary recall became official less than a month later.</p>\n<h2>The Solution</h2>\n<p>As to the Impreza and Crosstrek recall, Subaru says it&#8217;s aiming to inform all the parties for whom this safety risk applies beginning Dec. 13. In the mailers set to be distributed, owners will be asked to bring their automobiles to a dealership so a repair order can get underway, assuming the PCV valve is damaged. This can only be determined by bringing the car in for inspection. If a problem is found, the PCV valve will be replaced free of charge.</p>\n<p>It&#8217;s very possible that you&#8217;re driving a car that may be subject to a recall. Find out for sure by <a href=\"https://www.motorsafety.org/\" target=\"_blank\" rel=\"noopener noreferrer\">entering your VIN</a> at MotorSafety.org.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=17659","createdAt":"2019-10-30T02:26:47.000Z","date_gmt":"2019-10-30T16:11:47.000Z","updatedAt":"2020-10-15T03:04:42.000Z","modified_gmt":"2020-10-15T16:49:42.000Z","display_date":"October 30, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V744000","recall_date":"October 17, 2019"},"year":2019,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/10/shutterstock_1778079896-1-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_1778079896-1","category":{"id":24,"name":"Subaru","slug":"subaru-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/subaru_ms.png"},"tags":[{"id":1287,"name":"2017-2019 Subaru Crosstrek recall","slug":"2017-2019-subaru-crosstrek-recall"},{"id":1288,"name":"2017-2019 Subaru Impreza recall","slug":"2017-2019-subaru-impreza-recall"},{"id":1213,"name":"Subaru PCV issue","slug":"subaru-pcv-issue"}],"categories":[{"id":24,"name":"Subaru","slug":"subaru-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/subaru_ms.png"}]},{"id":17651,"title":"Ill-Mounted Spoiler Sparks Recall of Select Mercedes-Benz Wagons","link":"https://www.motorsafety.org/ill-mounted-spoiler-sparks-recall-of-select-mercedes-benz-wagons/","status":"publish","slug":"ill-mounted-spoiler-sparks-recall-of-select-mercedes-benz-wagons","excerpt":"<p>Mercedes-Benz USA has launched a small-scale recall on certain station wagons over fears that the spoilers attached to the rear portion of these vehicles may dislodge and fall off</p>\n","description":"<p><span id=\"pk-id\" value=\"40047904\"></span></p>\n<p>Laguna Hills, CA &#8211; Oct. 25, 2019 &#8211; Mercedes-Benz USA has launched a small-scale recall on certain station wagons, over fears that the spoilers attached to the rear portion of these vehicles may dislodge and fall off, creating a roadway hazard that could result in a crash were people are injured. The models involved include the 2019 E450 4Matic Wagon, 2017-2018 E400 4Matic Wagon and 2018-2019 E63S 4Matic Wagon.</p>\n<p>The luxury automaker began apprising owners of this rear spoiler recall Oct. 18. Recipients can take their automobile back to the dealer so a new spoiler can be installed if it&#8217;s deemed appropriate. There is no cost for this fix.</p>\n<h3>The Defect</h3>\n<p>Approximately 4,765 Mercedes-Benz station wagons are<a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCAK-19V676-4163.pdf\" target=\"_blank\" rel=\"noopener noreferrer nofollow\"> newly subject to a nationwide recall notice</a>, as the rear spoilers mounted onto the trunks of these vehicles may detach, according to paperwork submitted to and compiled by the National Highway Traffic Safety Administration. The station wagons in question include the following:</p>\n<ul>\n<li>2017-2018 E400</li>\n<li>2018-2019 E63S</li>\n<li>2019 E450</li>\n</ul>\n<p>It&#8217;s possible that these spoilers may ultimately fall from their perch when motorists are out on the road. This could create a hazard that causes motorists to swerve or strike a trailing vehicle and perhaps result in an accident where people are hurt.</p>\n<h3>Timeline of Events</h3>\n<p>This problem first came to the luxury automaker&#8217;s attention in October 2018, after a single instance in which the spoiler on an E-Class model <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLRPT-19V676-8205.PDF\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">fell from its mount</a>. A follow-up investigation into the circumstances surrounding the problem determined that the defective spoiler was likely caused by human error, installed by a worker who was on the job temporarily, according to NHTSA filings. Approximately 16 other station wagons had the same issue and each were recalled to correct the errantly affixed spoilers.</p>\n<p>Roughly a year later, however, Daimler AG &#8211; the parent company of Mercedes-Benz &#8211; was made aware of other instances&nbsp;in which&nbsp;the rear spoilers were improperly installed and that the problem was not isolated to human error but rather a manufacturing flaw.</p>\n<p>Out of an abundance of caution, DAG implemented a voluntary recall on certain station wagons that it had reason to believe were affected. The company estimates that 5% &#8211; or 238 automobiles &#8211; of the recalled population have the defect. They were likely manufactured somewhere between early October of last year and early-to-mid January.</p>\n<p>The rear spoiler recall is the latest safety issue Mercedes-Benz has <a href=\"https://www.motorsafety.org/category/mercedes-benz-recalls/\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">come across over the last year or so.</a> Like many of its contemporaries, MB was also affected by air bag defects, as the luxury automaker recalled nearly 288,800 models in late February. The company administered a separate recall in late December involving 6,000 vehicles, which contained faulty steering rack locknuts.</p>\n<h3>The Solution</h3>\n<p>The luxury automaker is partnering with the NHTSA to ensure that motorists pertaining to the rear spoiler recall are notified. If owners have not already received mailers making them aware of this issue, they should at any time, as the notices were sent out Oct. 18. Dealers were <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCRIT-19V676-2632.pdf\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">informed a week earlier</a>. There is no deadline to have this problem corrected and the repair is for free.</p>\n<p>For more information on existing Mercedes-Benz recall, <a href=\"https://www.motorsafety.org/\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">visit MotorSafety.org</a> and click on the &#8220;Mercedes-Benz&#8221; hyperlink.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=17651","createdAt":"2019-10-25T02:57:10.000Z","date_gmt":"2019-10-25T16:42:10.000Z","updatedAt":"2020-10-18T18:21:47.000Z","modified_gmt":"2020-10-19T08:06:47.000Z","display_date":"October 25, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2019,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/10/shutterstock_309738509-1-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_309738509-1","category":{"id":5,"name":"Mercedes-Benz","slug":"mercedes-benz-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mercedes_RM.png"},"tags":[{"id":228,"name":"4Matic Wagon","slug":"4matic-wagon"},{"id":230,"name":"E400","slug":"e400"},{"id":229,"name":"E450","slug":"e450"},{"id":231,"name":"E63S","slug":"e63s"},{"id":227,"name":"spoiler","slug":"spoiler"}],"categories":[{"id":5,"name":"Mercedes-Benz","slug":"mercedes-benz-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mercedes_RM.png"}]},{"id":17652,"title":"Nearly a Half-Million Subarus Recalled Due to Stall Risk","link":"https://www.motorsafety.org/nearly-a-half-million-subarus-recalled-due-to-stall-risk/","status":"publish","slug":"nearly-a-half-million-subarus-recalled-due-to-stall-risk","excerpt":"<p>Subaru will recall 466,205 Impreza and Crosstrek vehicles over faulty engine control modules. Issues with the ECM may cause vehicles to stall.</p>\n","description":"<p>Laguna Hills, CA &#8211; Oct. 25, 2019 &#8211; A massive <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLQRT-19V743-1385.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">recall</a> is about to get underway for Subaru of America, after the automaker discovered certain Impreza and Crosstrek vehicles &#8211; whose model years stretch from 2017 to 2019 &#8211; may have faulty engine control modules. Specifically, despite the engine being turned off, the ECM may continue to run, a circumstance that has the potential to cause a short circuit or blown fuse. This could lead to an accident if either of these outcomes take place while motorists are traveling.</p>\n<p>The automaker expects to inform registered car owners of this 2017-2019 Subaru recall by Dec. 13. Recipients are encouraged to then bring their vehicles to their local dealership so diagnostic test can be performed. This will determine whether the ignition coil requires replacing or if some other modification. Whatever is deemed necessary, there will be no charge for parts or labor.</p>\n<h2>The Defect</h2>\n<p>Approximately 466,205 Crosstrek SUVs and Impreza hatchbacks are due to be recalled by Subaru, according to documents prepared by the National Highway Traffic Safety Administration. It appears that the engine control module, which manipulates the actuators controlling the internal combustion engine, fails to power down when the engine is shut off. Left unchecked could result in a blown fuse or short circuit of the engine. Either scenario dramatically increases the risk of the automobile stalling and the possibility that the operator encounters an accident.</p>\n<h2>Timeline of Events</h2>\n<p>Typically when safety recalls are ordered, the NHTSA produces what is known as a Part 573 Safety Recall Report. This document details the various elements of an automotive recall, including a chronology of how a performance or safety issue came to light and what led the automaker to make the decision that it did regarding the recall. These particulars were not available in the NHTSA&#8217;s portal at the time of publication.</p>\n<p>Subaru prides itself on its safety record and is a perennial favorite to receive recognition for building some of the safest automobiles on the road from the likes of J.D. Power and Associates and the Insurance Institute for Highway Safety, Highway Loss Data Institute and Kelley Blue Book. In fact, last year, the Camden, New Jersey-headquartered nameplate landed seven models on IIHS&#8217; Top Safety Pick+ list, two of which were the Crosstrek and Impreza, specifically the sedan and 5-door option. Others that received the highly coveted honorific  included the Subaru Outback, WRX, Ascent and Legacy.</p>\n<p>In order to be included among IIHS Top Safety Pick+ selections, vehicles must undergo a battery of tests that analyze how well they hold up in the event of a crash at a high rate of speed, including front, side, rollover and how well the head restraints prevent passengers from experiencing a head or neck injury. Vehicles must received a &#8220;good&#8221; rating for these tests. Headlights must also receive a &#8220;good&#8221; rating, while the front crash prevention test must elicit a &#8220;superior&#8221; or &#8220;advanced&#8221; score.</p>\n<p>&#8220;Each year we continue to improve and innovate the safety features in our vehicles for our customers, said Thomas Doll, CEO and president at Subaru of America, <a href=\"https://www.prnewswire.com/news-releases/subaru-brand-leads-the-industry-with-seven-2019-iihs-top-safety-pick-awards-300769042.html\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">in a press release</a>. &#8220;For the Subaru brand to lead the IIHS TOP SAFETY PICK+ awards with seven winners reflects our commitment to making safety the top priority in our vehicles.&#8221;</p>\n<h2>The Solution</h2>\n<p>The recall is anticipated to begin officially on Dec. 13, the first day in which Subaru plans to distribute mailers to owners of the models in question. Recipients are urged to bring their vehicles to an area Subaru supplier so the ECM can be inspected and the engine coil replaced or modified. Some of these automobiles may also need to have their front exhaust pipes swapped assuming ignition coil damage is confirmed.</p>\n<p>For more information on the 2017-2019 Subaru recall as well as <a href=\"https://www.motorsafety.org/category/subaru-recalls/\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">any others announced</a> within the last few months, please visit <a href=\"https://www.motorsafety.org/\" target=\"_blank\" rel=\"noopener noreferrer\">MotorSafety.org</a> to get the details.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=17652","createdAt":"2019-10-25T02:51:45.000Z","date_gmt":"2019-10-25T16:36:45.000Z","updatedAt":"2020-10-15T03:09:55.000Z","modified_gmt":"2020-10-15T16:54:55.000Z","display_date":"October 25, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V743000","recall_date":"October 18, 2019"},"year":2019,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/10/shutterstock_719377003-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_719377003","category":{"id":24,"name":"Subaru","slug":"subaru-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/subaru_ms.png"},"tags":[{"id":1287,"name":"2017-2019 Subaru Crosstrek recall","slug":"2017-2019-subaru-crosstrek-recall"},{"id":1288,"name":"2017-2019 Subaru Impreza recall","slug":"2017-2019-subaru-impreza-recall"},{"id":1289,"name":"Subaru ECM issue","slug":"subaru-ecm-issue"},{"id":1004,"name":"Subaru stalling issue","slug":"subaru-stalling-issue"}],"categories":[{"id":24,"name":"Subaru","slug":"subaru-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/subaru_ms.png"}]},{"id":17650,"title":"Toyota yanks over 928,200 cars with faulty Takata airbags","link":"https://www.motorsafety.org/toyota-yanks-over-928200-cars-over-air-bag-inflator-failing/","status":"publish","slug":"toyota-yanks-over-928200-cars-over-air-bag-inflator-failing","excerpt":"<p>Toyota and Infiniti are recalling more than 928,200 models of various types due to concerns that the air bags installed may explode upon deployment in a crash.</p>\n","description":"<p><em>Laguna Hills, CA – October 24, 2019</em> – Toyota is recalling more than 928,200 models of various types due to concerns that the air bags installed in these vehicles&#8217; dashboards and steering wheels could explode upon deployment in a crash and hurl deadly shrapnel at the driver or passengers.</p>\n<p>A total of 17 different model types are included in this recall action, several of which are under Toyota&#8217;s luxury brand. Here&#8217;s a partial list:</p>\n<ul>\n<li><strong>2007-2012 Lexus ES350</strong></li>\n<li><strong>2010-2017 Lexus GX460</strong></li>\n<li><strong>2006-2012 Lexus IS 250</strong></li>\n<li><strong>2010-2015 Lexus IS 250c</strong></li>\n<li><strong>2006-2012 Lexus IS 350</strong></li>\n<li><strong>2010-2016 Toyota 4Runner</strong></li>\n<li><strong>2003-2013 Toyota Corolla</strong></li>\n<li><strong>2009-2010 Toyota Corolla Matrix</strong></li>\n<li><strong>2004-2005 Toyota RAV4</strong></li>\n<li><strong>2002-2007 Toyota Sequoia</strong></li>\n</ul>\n<h2><strong>The defect</strong></h2>\n<p>Toyota has announced the <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLRPT-19V741-9055.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">recall of 928,203 models</a> because the air bag inflators may be faulty. The propellant used to inflate the air bags once triggered may degrade in high-humidity environments, which could lead to an explosion of the air bag itself. Sharp objects within the unit could cause serious injury or death should they strike the passenger or driver.</p>\n<h2><strong>Timeline of events</strong></h2>\n<p>As previously noted, Toyota is one of several automakers impacted by air bag recalls, as millions of automobiles have returned to dealerships so their original bags can be swapped out for fully operating ones. In fact, all of the listed vehicles were a part of a separate air bag recall for the same problem. This is the second and final phase of the original recall. The errant air bags in question were developed by Takata, which filed for bankruptcy in 2017. According to Reuters, at least <a href=\"https://www.reuters.com/article/us-toyota-takata-airbags/toyota-conducts-final-phase-of-recall-to-replace-takata-airbag-inflators-idUSKBN1WW2RK\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">24 people have been killed</a> worldwide as a result of rupturing air bags. Of these deaths, 16 took place in the U.S.</p>\n<p>Just because there are recall notices out on numerous makes and models doesn&#8217;t mean that they&#8217;re all attended to, despite owners&#8217; receipt of notifications. In 2018, however, <a href=\"https://www.nhtsa.gov/press-releases/nhtsa-releases-end-year-update-takata-air-bag-recalls\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">repair rates improved rather sharply</a> among several models. These included the 2006 Ford Ranger (82% in October 2018 from 6% in January 2018), and multiple 2001-2003 Honda models, with an overall 96% repair rate by the end of 2018, according to NHTSA data.</p>\n<p>Several of the automobiles subject to this latest air bag recall were also involved in a previous one that was announced in February. That one <a href=\"https://www.motorsafety.org/category/toyota-recalls/\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">affected 1.2 million vehicles</a>, among them 2010-2016 4Runner, 2011-2013 Corolla and 2011-2013 Corolla Matrix vehicles.</p>\n<h2><strong>The solution</strong></h2>\n<p>Starting November 15, Toyota will begin distributing notifications via first-class mail informing owners of this most recent air bag recall. Before this, however, each car will be inspected to determine the nature of the problem and the appropriate corrective action. For example, the driver and/or passenger air bags may be defective. Whatever the case may be, the inflator, air bag assembly or both will be swapped out. This repair is free, and the fix should take approximately one hour to complete.</p>\n<h2><strong>Is your vehicle part of the recall?</strong></h2>\n<p><span data-sheets-value=\"{&quot;1&quot;:2,&quot;2&quot;:&quot;As of April 9, 2021, 545,271 airbags had been repaired, with 382,931 remaining.&quot;}\" data-sheets-userformat=\"{&quot;2&quot;:769,&quot;3&quot;:{&quot;1&quot;:0},&quot;11&quot;:4,&quot;12&quot;:0}\">Over 928,000 cars were originally part of this recall. As of April 9, 2021, 545,271 airbags had been replaced. </span><span style=\"font-weight: 400;\">To see if your car still needs to be repaired, use MotorSafety’s</span><a href=\"https://www.motorsafety.org/\"><span style=\"font-weight: 400;\"> free lookup tool</span></a><span style=\"font-weight: 400;\">.</span></p>\n<p><b><i>Note: June 8, 2021</i></b></p>\n<p><i><span style=\"font-weight: 400;\">We have noticed a large number of readers are interested in this recall. For that reason, we have added the last section to allow the driver to check if his or her car is part of the recall and reflect the most up-to-date information on the recall&#8217;s completion rates</span></i><span style=\"font-weight: 400;\">. </span><i><span style=\"font-weight: 400;\">The article has also been updated to reflect the latest editorial standards.</span></i></p>\n","source":"https://www.motorsafety.org/?p=17650","createdAt":"2019-10-25T02:45:08.000Z","date_gmt":"2019-10-25T16:30:08.000Z","updatedAt":"2021-06-08T13:01:05.000Z","modified_gmt":"2021-06-09T02:46:05.000Z","display_date":"October 25, 2019","sticky":false,"recall":false,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V741000","recall_date":"October 17, 2019","meta_title":"","meta_description":"","meta_keywords":"","custom_schema":""},"year":2019,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/10/Silver-2012-Lexus-GS-768x512.jpg","alt_text":"","cld_public_id":"Silver-2012-Lexus-GS","category":{"id":29,"name":"Lexus","slug":"lexus-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/lexus_ms.png"},"tags":[{"id":1299,"name":"2002-2007 Toyota Sequoia recall","slug":"2002-2007-toyota-sequoia-recall"},{"id":1296,"name":"2003-2013 Toyota Corolla recall","slug":"2003-2013-toyota-corolla-recall"},{"id":1298,"name":"2004-2005 Toyota RAV4 recall","slug":"2004-2005-toyota-rav4-recall"},{"id":1292,"name":"2006-2012 Lexus IS 250 recall","slug":"2006-2012-lexus-is-250-recall"},{"id":1294,"name":"2006-2012 Lexus IS 350 recall","slug":"2006-2012-lexus-is-350-recall"},{"id":1290,"name":"2007-2012 Lexus ES350 recall","slug":"2007-2012-lexus-es350-recall"},{"id":1297,"name":"2009-2010 Toyota Corolla Matrix recall","slug":"2009-2010-toyota-corolla-matrix-recall"},{"id":1293,"name":"2010-2015 Lexus IS 250c recall","slug":"2010-2015-lexus-is-250c-recall"},{"id":1295,"name":"2010-2016 Toyota 4Runner recall","slug":"2010-2016-toyota-4runner-recall"},{"id":1291,"name":"2010-2017 Lexus GX460 recall","slug":"2010-2017-lexus-gx460-recall"}],"categories":[{"id":29,"name":"Lexus","slug":"lexus-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/lexus_ms.png"},{"id":17,"name":"Toyota","slug":"toyota-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/toyota_ms.png"}]},{"id":17644,"title":"Loose Wheel Arch Forces Recall for Certain Audi SUVs","link":"https://www.motorsafety.org/loose-wheel-arch-forces-recall-for-certain-audi-suvs/","status":"publish","slug":"loose-wheel-arch-forces-recall-for-certain-audi-suvs","excerpt":"<p>Volkswagen has announced it&#8217;s recalling nearly 174,300 Audi SQ5 and Q5 sport utility vehicles due to an improperly installed wheel arch cover that may loosen during operation.</p>\n","description":"\n<p><em>Laguna Hills, CA &#8211; Oct. 23, 2019</em> &#8211; Volkswagen Group of North America has announced it&#8217;s recalling nearly 174,300 Audi SQ5 and Q5 sport utility vehicles due to an improperly installed wheel arch cover that may loosen during the course of driving. </p>\n\n\n\n<p>Should it detach, it may result in an accident for the owner or another motorist. All the vehicles have model years between 2018 and 2020. </p>\n\n\n\n<p>Operators are encouraged to remove their SUVs from the road and heed this Audi SQ5 and Q5 recall by bringing their vehicles to an authorized VW or Audi dealership. Should it be deemed necessary, the faulty clips securing the rear wheel arch trim will be swapped out for fully operating ones.</p>\n\n\n\n<h2>The defect</h2>\n\n\n\n<p>In filings with the <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLQRT-19V737-3051.PDF\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">National Highway Traffic Safety Administration</a>, Volkswagen stated that it seeks to recall 174,278 Audi SQ5 and Q5 SUVs from the marketplace over an apparent manufacturing flaw affecting the rear wheel arch cover, which may have not been appropriately affixed to the wheel during the course of assembly.&nbsp;</p>\n\n\n\n<p>The part&#8217;s disconnection from the car could present a road hazard that may result in a crash and the potential for injury.</p>\n\n\n\n<h2>Timeline of events</h2>\n\n\n\n<p>Typically, when the details of recalls are made publicly available by NHTSA, the agency provides written details that document how the recall came about, what the results were when officials investigated the nature of these issues and when they occurred. </p>\n\n\n\n<p>However, these specifics were not published before the notice went to press.</p>\n\n\n\n<p>This <a rel=\"noopener noreferrer\" href=\"https://www.motorsafety.org/category/audi-recalls/\" target=\"_blank\">isn&#8217;t the first recall for Audi</a> or VW in 2019. In August, VW informed NHTSA that it was recalling approximately 7,000 Audi E-Tron&#8217;s &#8211; an all-electric vehicle &#8211; worldwide due to fears that its onboard battery may start a fire. This recall was not just in the U.S., but worldwide as well.</p>\n\n\n\n<p>Prior to that, VW&nbsp;also recalled an estimated 138,000 Audi vehicles &#8211; specifically A3 E-Tron, A3 Cabriolet, S3, and R3 &#8211; because of an onboard computer issue that prevented the system from recognizing the installed air bags. </p>\n\n\n\n<p>Motorists affected by these recalls should have already received notifications either from VW, NHTSA or both via first-class mail.</p>\n\n\n\n<h2>The solution</h2>\n\n\n\n<p>As for the Audi SQ5 and Q5 recall &#8211; which is the automaker&#8217;s best-selling model &#8211; VW believes it has the remedy that will fix the rear wheel arch cover so it stays put. </p>\n\n\n\n<p>As such, drivers who received notifications &#8211; which are due to be sent out by Nov. 1 &#8211; should take their SUVs off the road so that they can bring them to their local VW or Audi dealership. </p>\n\n\n\n<p>A mechanic will inspect the automobile to see if a fix is necessary. Should it be, the clips securing the front portion of the rear wheel arch trim will be replaced so the hold is snug.</p>\n\n\n\n<p>For more information on the Audi SQ5 and Q5 recall, <a href=\"https://www.motorsafety.org/\" target=\"_blank\" rel=\"noopener noreferrer\">please visit</a> MotorSafety.org. You can also use our website to see if there are any existing recalls from this automaker or others so you can take the appropriate measures that ensure your car is always safe to drive.</p>\n<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script>","source":"https://www.motorsafety.org/?p=17644","createdAt":"2019-10-23T02:26:48.000Z","date_gmt":"2019-10-23T16:11:48.000Z","updatedAt":"2020-11-06T01:34:13.000Z","modified_gmt":"2020-11-06T15:19:13.000Z","display_date":"October 23, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V737000","recall_date":"October 16, 2019"},"year":2019,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/10/Red-2020-Audi-SQ5-768x512.jpg","alt_text":"","cld_public_id":"Red-2020-Audi-SQ5","category":{"id":16,"name":"Audi","slug":"audi-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/audi_RM.png"},"tags":[{"id":1301,"name":"2018-2020 Q5 recall","slug":"2018-2020-q5-recall"},{"id":1300,"name":"2018-2020 SQ5 recall","slug":"2018-2020-sq5-recall"},{"id":1302,"name":"Audi wheel arch cover","slug":"audi-wheel-arch-cover"}],"categories":[{"id":16,"name":"Audi","slug":"audi-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/audi_RM.png"}]},{"id":17645,"title":"BMW Launches Massive Recall Due to Backup Camera Glitch","link":"https://www.motorsafety.org/bmw-launches-massive-recall-due-to-backup-camera-glitch/","status":"publish","slug":"bmw-launches-massive-recall-due-to-backup-camera-glitch","excerpt":"<p>BMW of North America is poised to recall an extraordinarily large number of models due to a backup camera and display snafu that may prevent motorists from seeing what&#8217;s behind them.</p>\n","description":"\n<p><em>Laguna Hills, CA &#8211; October 23, 2019</em> &#8211; BMW of North America is poised to recall an extraordinarily large number of models due to a backup camera system snafu that may prevent motorists from seeing what&#8217;s behind them while shifting into reverse. </p>\n\n\n\n<p>Affecting potentially 257,500 vehicles, a handful of the models that may contain this camera glitch include:</p>\n\n\n\n<ul><li> 2018 &#8211; 2020 540d</li><li>2018 &#8211; 2020 640i xDrive Gran Turismo</li><li>2018 &#8211; 2020 Rolls Royce Phantom</li><li>2018 &#8211; 2020 530 ixDrive</li><li>2018 &#8211; 2020 540i xDrive</li><li>2018 -2020 X3 sDrive</li><li>2018 -2020 X3</li><li>2018 &#8211; 2020 M40i, </li><li>2018 &#8211; 2020 X3 M and Z4 sDrive models</li></ul>\n\n\n\n<p>Motorists affected by this BMW&nbsp;recall are urged to bring their vehicle to a local BMW dealer so the system can be updated with the appropriate software. There will be no charge for the repair if one is required.</p>\n\n\n\n<h2><strong>The defect</strong></h2>\n\n\n\n<p>As <a rel=\"noopener noreferrer\" href=\"https://static.nhtsa.gov/odi/rcl/2019/RCAK-19V684-1970.pdf\" target=\"_blank\">documented by</a> the National Highway Traffic Safety Administration, BMW intends to recall an estimated 257,481 2018 &#8211; 2020 model year vehicles because the backup camera can be manipulated in such a way that prevents the display from appearing on the driver&#8217;s screen. </p>\n\n\n\n<p>In addition to the 2020 Toyota Supra and 2018 &#8211; 2019 Rolls Royce Cullinan and Phantom, over 20 BMW models may have faulty backup cameras in place. These included but aren&#8217;t limited to the following:</p>\n\n\n\n<ul><li>330i</li><li>530e</li><li>530i</li><li>540d</li><li>540i</li><li>640i</li><li>740 Le</li><li>740Li</li><li>745 i3</li><li>750Li</li><li>840i</li><li>M340i</li><li>M5</li><li>M550i</li><li>M850i</li></ul>\n\n\n\n<p>Multiple X models, as well as the Z4, are also a part of the recalled BMW model population.&nbsp;</p>\n\n\n\n<h2><strong>Timeline of events</strong></h2>\n\n\n\n<p>In mid May, NHTSA&#8217;s Office of Vehicle Safety Compliance reached out to BMW <a rel=\"noopener noreferrer\" href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLRPT-19V684-8158.PDF\" target=\"_blank\">in order to obtain details</a> on the performance of the automaker&#8217;s X4, specifically in terms of how the rear view camera system was functioning from an overall performance standpoint. </p>\n\n\n\n<p>Roughly three weeks later, BMW provided the OVSC with an exhaustive report of the backup camera unit, which led to a meeting regarding compliance rule FMVSS 111.</p>\n\n\n\n<p>The minutes from this confab revealed that the units may be out of compliance, specifically Section 5.5.6 of FMVSS 111, which pertains to rear visibility. </p>\n\n\n\n<p>In 2014, NHTSA mandated that all 2018 models have backup cameras as standard inclusions to guard against the potential for serious injury, particularly to young children who may be out of motorists&#8217; view when putting their cars in reverse. </p>\n\n\n\n<p>Concerned that other backup cameras may be out of compliance aside from certain X models, BMW decided to launch a voluntary recall on additional models for which there was sufficient evidence to suggest they may be compromised. </p>\n\n\n\n<p>It&#8217;s possible that all of the 257,481 automobiles involved may contain this flaw.</p>\n\n\n\n<p>Some of the models affected by this BMW backup camera recall also have <a rel=\"noopener noreferrer\" href=\"https://www.motorsafety.org/category/bmw-recalls/\" target=\"_blank\">other separate safety recalls</a> in effect. For example, a small portion of M340i models may have rear headrests that could fold down improperly during operation. </p>\n\n\n\n<p>Additionally, M40i vehicles are subject to a voluntary recall over a seat defect that appears to emanate from a welding issue.</p>\n\n\n\n<h2><strong>The solution</strong></h2>\n\n\n\n<p>The fix appears to be as simple as updating the software that&#8217;s used to make the backup camera functional. Motorists thusly advised by first-class mail are encouraged to bring their car to a dealer so these units can be fully inspected. </p>\n\n\n\n<p>The software refresh will come at no cost. Operators can expect to receive a notification in late November or December, as the automaker intends to distribute the notices starting November 19.</p>\n\n\n\n<p>For more information on the BMW backup camera recall or others announced by different manufacturers, visit <a href=\"https://www.motorsafety.org/\" target=\"_blank\" rel=\"noopener noreferrer\">MotorSafety.org</a>. Be sure to have your VIN information available, which you can use to see if your car is subject to an existing recall.</p>\n<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script>","source":"https://www.motorsafety.org/?p=17645","createdAt":"2019-10-23T02:26:42.000Z","date_gmt":"2019-10-23T16:11:42.000Z","updatedAt":"2020-09-16T20:40:48.000Z","modified_gmt":"2020-09-17T10:25:48.000Z","display_date":"October 23, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":"October 23, 2019"},"year":2019,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/10/BMW-Z4-768x512.jpg","alt_text":"Gray BMW Z4 M40i.","cld_public_id":"BMW-Z4","category":{"id":15,"name":"BMW","slug":"bmw-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/bmw_RM.png"},"tags":[{"id":716,"name":"2018 - 2020 530 ixDrive","slug":"2018-2020-530-ixdrive"},{"id":713,"name":"2018 - 2020 BMW 540d","slug":"2018-2020-bmw-540d"},{"id":717,"name":"2018 - 2020 BMW 540i xDrive","slug":"2018-2020-bmw-540i-xdrive"},{"id":714,"name":"2018 - 2020 BMW 640i xDrive Gran Turismo","slug":"2018-2020-bmw-640i-xdrive-gran-turismo"},{"id":720,"name":"2018 - 2020 BMW M40i","slug":"2018-2020-bmw-m40i"},{"id":719,"name":"2018 - 2020 BMW X3","slug":"2018-2020-bmw-x3"},{"id":721,"name":"2018 - 2020 BMW Z4 sDrive","slug":"2018-2020-bmw-z4-sdrive"},{"id":718,"name":"2018 - 2020 X3 sDrive","slug":"2018-2020-x3-sdrive"},{"id":712,"name":"Backup Camera","slug":"backup-camera"},{"id":669,"name":"BMW recall","slug":"bmw-recall"}],"categories":[{"id":15,"name":"BMW","slug":"bmw-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/bmw_RM.png"}]},{"id":17643,"title":"BMW sedans, convertibles recalled over deadly Takata airbags","link":"https://www.motorsafety.org/bmw-sedans-convertibles-recalled-over-faulty-air-bags/","status":"publish","slug":"bmw-sedans-convertibles-recalled-over-faulty-air-bags","excerpt":"<p>BMW of North America recently announced that it&#8217;s pulling over 3,900 models from the marketplace due to the potential that the installed air bags are compromised</p>\n","description":"\n<p><em>Laguna Hills, CA – October 22, 2019</em> – BMW is pulling over 3,900 models from the marketplace due to the possibility that installed air bags are compromised.  In the event of an accident that the air bags to deploy, sharp metal fragments could break through them, potentially leading to a severe injury. </p>\n\n\n\n<p>The recall includes the following vehicles:</p>\n\n\n\n<ul><li><strong>2000 &#8211; 2002 325i</strong></li><li><strong>2000 &#8211; 2002 325xi</strong></li><li><strong>2000 &#8211; 2002 323Ci</strong></li><li><strong>2000 &#8211; 2002 325Ci</strong></li><li><strong>2000 &#8211; 2002 330Ci</strong></li></ul>\n\n\n\n<h2><strong>The defect</strong></h2>\n\n\n\n<p>The cause of this issue is believed to be the propellant used in the release of the air bags. <a href=\"https://www.nhtsa.gov/recalls?nhtsaId=19V698000\" target=\"_blank\" rel=\"noreferrer noopener\">The propellant has the potential to break down over time due to exposure to high levels of humidity and temperature cycling</a>.</p>\n\n\n\n<h2><strong>Timeline of events</strong></h2>\n\n\n\n<p>The 2000 &#8211; 2002 BMW air bag recall is one of several that have affected the auto industry tracing back several years. </p>\n\n\n\n<p>The <a href=\"https://www-odi.nhtsa.dot.gov/tis/index.cfm\">Office of Defects Investigation</a> arm of the NHTSA opened a sweeping inquiry into this issue back in June 2014 after learning of six separate incidents where air bags ruptured, which involved five vehicle manufacturers. </p>\n\n\n\n<p>The ODI determined that the common link between them all was the manufacturer of the air bags &#8211; Takata &#8211; and the locations of where these air bags were installed. All six took place in either Florida or Puerto Rico.</p>\n\n\n\n<p>These events led to a much wider investigation of Takata air bags and their potential to cause serious injury to motorists. </p>\n\n\n\n<p>All told, at least 37 million automobiles had been equipped with 50 million defective air bags manufactured by Takata, <a rel=\"noopener noreferrer\" href=\"https://www.nhtsa.gov/press-releases/nhtsa-releases-end-year-update-takata-air-bag-recalls\" target=\"_blank\">according to the most recent statistics</a> available from the NHTSA. Repair rates among&nbsp;automakers with Takata air bags installed rose 30% in 2018 compared to the previous year.</p>\n\n\n\n<p>&#8220;Communicating the urgency for recall repairs with the help of stakeholders and DMVs is proving effective to protecting lives on our nation&#8217;s roadways,&#8221; NHTSA Deputy Administrator Heidi King said at the time.</p>\n\n\n\n<p>This isn&#8217;t the first time this year that BMW has been affected by an air bag safety issue. In June, the luxury automaker announced it was recalling approximately 2,000 SUVs&nbsp;whose air bags were installed improperly. </p>\n\n\n\n<p>Prior to that, around 1,700 2-Series, 3-Series and 4-Series models were also&nbsp;recalled because of compromised passenger knee air bags.</p>\n\n\n\n<h2><strong>The solution</strong></h2>\n\n\n\n<p>As for the 2000 &#8211; 2002 BMW air bag issue, the luxury automaker is getting ready to start distributing mailers that will inform owners about this problem. BMW says it will begin sending the notifications out starting November 25. </p>\n\n\n\n<p>Recipients of the safety notices are urged to bring their vehicle to a local dealer. If appropriate, a replacement air bag will be installed free of charge.</p>\n\n\n\n<h2><strong>Is your vehicle part of the recall?</strong></h2>\n\n\n\n<p>Over 3,900 airbags were originally part of this recall. As of April 9, 2021 – the last date for which information is available – 1,425 airbags had been replaced. To see if your car still needs to be repaired, use MotorSafety’s<a href=\"https://www.motorsafety.org/\"> free lookup tool</a>.</p>\n\n\n\n<p><strong><em>Note: June 8, 2021</em></strong></p>\n\n\n\n<p><em>We have noticed a large number of readers are interested in this recall. For that reason, we have added the last section to allow the driver to check if his or her car is part of the recall and include the most up-to-date information on the recall’s completion rates</em>. <em>The article has also been updated to reflect the latest editorial standards.</em></p>\n\n\n<p><script src=\"\" type=\"text/javascript\"></script><script src=\"\" type=\"text/javascript\"></script><script src=\"\" type=\"text/javascript\"></script></p>","source":"https://www.motorsafety.org/?p=17643","createdAt":"2019-10-22T05:51:52.000Z","date_gmt":"2019-10-22T19:36:52.000Z","updatedAt":"2021-06-08T12:56:57.000Z","modified_gmt":"2021-06-09T02:41:57.000Z","display_date":"October 22, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":"October 22, 2019","meta_title":"","meta_description":"","meta_keywords":"","custom_schema":""},"year":2019,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/10/BMW-325-768x522.jpg","alt_text":"Dark colored BMW 325.","cld_public_id":"BMW-325","category":{"id":15,"name":"BMW","slug":"bmw-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/bmw_RM.png"},"tags":[{"id":726,"name":"2000 - 2002 BMW 323Ci","slug":"2000-2002-bmw-323ci"},{"id":727,"name":"2000 - 2002 BMW 325Ci","slug":"2000-2002-bmw-325ci"},{"id":723,"name":"2000 - 2002 BMW 325i","slug":"2000-2002-bmw-325i"},{"id":724,"name":"2000 - 2002 BMW 325xi","slug":"2000-2002-bmw-325xi"},{"id":728,"name":"2000 - 2002 BMW 330Ci","slug":"2000-2002-bmw-330ci"},{"id":669,"name":"BMW recall","slug":"bmw-recall"},{"id":408,"name":"Crash Risk","slug":"crash-risk"},{"id":599,"name":"faulty airbag","slug":"faulty-airbag"},{"id":429,"name":"serious injury","slug":"serious-injury"}],"categories":[{"id":15,"name":"BMW","slug":"bmw-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/bmw_RM.png"}]},{"id":17640,"title":"Software Malfunction Leads to Lamborghini Recall","link":"https://www.motorsafety.org/software-malfunction-leads-to-lamborghini-recall/","status":"publish","slug":"software-malfunction-leads-to-lamborghini-recall","excerpt":"<p>Earlier this month, Lamborghini announced a recall on some 2017-19 Aventador S Coupè and Aventador S Roadsters that may stall due to faulty engine management software. </p>\n","description":"<p>Laguna Hills, CA – Oct. 17, 2019 – Earlier this month, Lamborghini announced the recall of certain 2017-19 Aventador S Coupè and Aventador S Roadster vehicles. The reason for the action involves the engine management software used for both vehicles, which, due to a defect, may cause the engine to stall while coasting toward a stop.</p>\n<p>While the recall involves a relatively small number of vehicles (approximately 441), it is nonetheless a vital one: According to the manufacturer, no warning is likely to precede the stall on the affected automobiles. Additionally, all of the vehicles included in the recall are expected to contain the defect, without exception.</p>\n<h2>The Defect</h2>\n<p>As a result of the flaw, the engine might unexpectedly turn off under very specific conditions. The safety recall report issued by Lamborghini <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLRPT-19V696-7919.PDF\" rel=\"noopener noreferrer nofollow\">describes those conditions exactly</a>: &#8220;The affected vehicles might, under certain driving conditions (accelerator pedal released in the idle approach to a stop) present an engine stall event without warning,&#8221; the document explained. &#8220;The engine can switch off approaching a stop at idle, increasing the risk of an accident.&#8221;</p>\n<p>Lamborghini&#8217;s documents also note that the defect occurs because the engine management software &#8220;doesn&#8217;t assure the idle minimum revs in order to maintain the engine running.&#8221; The remedy for the defect will involve dealers installing new engine management software that can maintain the proper level of minimum revs while the vehicle is idle.</p>\n<h2>Timeline of Events</h2>\n<p>First knowledge of the defect came by way of field reports describing cases of alleged engine stalls involving the related vehicles, which reached Lamborghini sometime during May 2019. Following additional complaints received shortly thereafter, an investigation was launched.</p>\n<p>&#8220;Results from the investigation revealed a risk of vehicle stalling,&#8221; stated the manufacturer&#8217;s chronology report. &#8220;On Sept. 25, 2019, the matter was presented at the Product Safety Committee, [at which point the] decision to conduct a safety recall was made.&#8221;</p>\n<p>The specific vehicles containing the defect have been identified using vehicle identification numbers. They were all manufactured between December 2016 and June 2019.</p>\n<h2>The Solution</h2>\n<p>Owners of the vehicles included in the field action should be notified via mail by the end of 2019. They will be instructed to arrange an appointment with an authorized Lamborghini dealer to have the updated engine software &#8211; which is free of the defect that necessitated this recall &#8211; installed on their automobiles.</p>\n<p>Those with further questions can read Lamborghini&#8217;s <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RMISC-19V696-3968.pdf\" rel=\"noopener noreferrer nofollow\">&#8220;frequently asked questions&#8221; document for the recall</a> or contact the manufacturer&#8217;s customer service line at (866) 681-6276. And for more information on other recent vehicle recalls, visit <a href=\"http://MotorSafety.org\">MotorSafety.org</a>.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=17640","createdAt":"2019-10-21T07:13:33.000Z","date_gmt":"2019-10-21T20:58:33.000Z","updatedAt":"2020-10-15T03:41:34.000Z","modified_gmt":"2020-10-15T17:26:34.000Z","display_date":"October 21, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V696000","recall_date":"October 2, 2019"},"year":2019,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/10/shutterstock_1252832461-1-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_1252832461-1","category":{"id":153,"name":"Lamborghini","slug":"lamborghini-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2021/07/Lamborghini-Logo_kiyp9x.png"},"tags":[{"id":1303,"name":"2017-2019 Lamborghini Aventador S coupe recall","slug":"2017-2019-lamborghini-aventador-s-coupe-recall"},{"id":1304,"name":"2017-2019 Lamborghini Aventador S Roadster recall","slug":"2017-2019-lamborghini-aventador-s-roadster-recall"},{"id":1306,"name":"Lamborghini engine management software","slug":"lamborghini-engine-management-software"},{"id":1305,"name":"Lamborghini stall","slug":"lamborghini-stall"}],"categories":[{"id":153,"name":"Lamborghini","slug":"lamborghini-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2021/07/Lamborghini-Logo_kiyp9x.png"}]},{"id":17633,"title":"Recall Announced on Certain 2020 Ford Explorer Vehicles","link":"https://www.motorsafety.org/recall-announced-on-certain-2020-ford-explorer-vehicles/","status":"publish","slug":"recall-announced-on-certain-2020-ford-explorer-vehicles","excerpt":"<p>The Ford Motor Company announced a recall on 2020 Explorer vehicles equipped with 2.3L or 3.3L engines due to improperly secured wiring harnesses with the possibility of electrical short. </p>\n","description":"<p>Laguna Hills, CA – Oct. 10, 2019 – The Ford Motor Company announced a recall on 2020 Explorer vehicles equipped with 2.3L or 3.3L engines due to improperly secured wiring harnesses. According to the manufacturer, this defect could lead to a damaged wiring harness or a damaged air-conditioning belt drive, creating the possibility of &#8220;a short circuit and potential fire&#8221;.</p>\n<h2>The Defect</h2>\n<p>According to documents filed by Ford with the National Highway Traffic Safety Administration, the defect was caused by improperly secured wiring harnesses that were used in production between May 28 and July 19, 2019.</p>\n<p>&#8220;The wiring harness is not secured and may contact the air conditioning pulley, resulting in a damaged wiring harness or damaged A/C drive belt,&#8221; <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLRPT-19V687-7105.PDF\" rel=\"noopener noreferrer nofollow\">read the safety recall report</a>. &#8220;If the wiring harness is not secured properly, the harness may inadvertently contact the air conditioning pulley. Over time, contact with the A/C pulley may rub through the wire harness insulation creating the potential for contact with the unused B+ circuit [and] resulting in a short circuit and potential fire.&#8221;</p>\n<p>Ford has announced that 10,655 vehicles are involved in the recall, all of which are believed to contain the defect.</p>\n<h2>Timeline of Events</h2>\n<p>The first notice of the potential problem came in early July 2019, when a vehicle quality inspection at a Ford facility revealed two vehicles with a loose wiring harness. Ford stopped shipping of any vehicle models potentially including the same defect, and began inspecting vehicles at numerous other facilities in search of the root cause.</p>\n<p>In August, Ford identified reports of loose wiring harnesses in vehicles already sold, &#8220;with customers reporting the wrench light and traction control lights were illuminated in the instrument panel.&#8221; On Sept. 23, the manufacturer&#8217;s field review committee reviewed the subject and approved the field action, <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCAK-19V687-5530.pdf\" rel=\"noopener noreferrer nofollow\">made official in a letter to the NHTSA dated Oct. 4, 2019</a>.</p>\n<h2>The Solution</h2>\n<p>Owners of vehicles involved in the recall will be notified by mail in late October 2019, with messages instructing them to bring their vehicle to an authorized dealership to have the defect repaired. Dealers will complete such repairs in-house at no cost, by installing a tie strap to the wiring harness. Those with further questions may contact Ford&#8217;s customer service line at (866) 436-7332, or the NHTSA line at (888) 327-4236.</p>\n<p>For more information on vehicle recalls announced by Ford or other major automobile manufacturers, visit <a href=\"http://MotorSafety.org\">MotorSafety.org</a>.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=17633","createdAt":"2019-10-16T02:46:45.000Z","date_gmt":"2019-10-16T16:31:45.000Z","updatedAt":"2020-10-15T03:45:34.000Z","modified_gmt":"2020-10-15T17:30:34.000Z","display_date":"October 16, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V687000","recall_date":"September 30, 2019"},"year":2019,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/10/shutterstock_1292833372-1-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_1292833372-1","category":{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"},"tags":[{"id":1214,"name":"2020 Ford Explorer recall","slug":"2020-ford-explorer-recall"},{"id":1307,"name":"Ford Explorer wiring harness issue","slug":"ford-explorer-wiring-harness-issue"}],"categories":[{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"}]},{"id":17634,"title":"Subaru Recalls Forester Vehicles Due to Air Bag Risk","link":"https://www.motorsafety.org/subaru-recalls-forester-vehicles-due-to-air-bag-risk/","status":"publish","slug":"subaru-recalls-forester-vehicles-due-to-air-bag-risk","excerpt":"<p>Subaru of America has announced the recall of more than 366,000 Forester vehicles equipped with heated seats due to a defect that could potentially deactivate the front passenger airbag.</p>\n","description":"<p>Laguna Hills, CA – Oct. 14, 2019 – Subaru of America has announced the recall of more than 366,000 Forester vehicles equipped with heated seats, due to a defect that could potentially deactivate the front passenger air bag.</p>\n<p>An indicator acknowledging the loss of the air bag&#8217;s function will illuminate if deactivation occurs, so hopefully drivers will be fully aware if their vehicle is affected. However, the problem still brings with it an increased possibility of injury for the individual in the passenger seat, thus necessitating the field action.</p>\n<h2>The Defect</h2>\n<p>Documents describing the defect note that it applies to certain 2015-2018 Subaru Forester vehicles, and is caused by electrical issues.</p>\n<p>&#8220;Over time, due to a decrease in contact pressure between terminals in the occupant detection system (ODS) sensor mat harness, a temporarily unstable electrical connection may be possible,&#8221; Subaru&#8217;s <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLRPT-19V701-9776.PDF\" rel=\"noopener noreferrer nofollow\">safety recall report describing the defect</a> pointed out. &#8220;If the connection is temporarily unstable, the ODS may not properly determine the status of a front right seat occupant.&#8221;</p>\n<p>Because the sensor cannot ascertain whether or not the front right seat is occupied, it may fail to activate the air bag.</p>\n<h2>Timeline of Events</h2>\n<p>Subaru&#8217;s own chronology report regarding the defect <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RMISC-19V701-1934.pdf\" rel=\"noopener noreferrer nofollow\">goes back more than three years</a>, as the issue first surfaced in April 2016. At that time, the manufacturer received its first field report related to the ODS sensor issue, which described the condition as it affected a 2016 Forester vehicle. Further reports of the same issue continued to find their way to the automaker throughout much of 2017, although no root cause could be determined by either Subaru or its supplier.</p>\n<p>By September 2018, it had ultimately been determined that &#8220;other factors could cause connection instability, such as harness connectors and/or harness routing,&#8221; which led to a crucial update of the manufacturing process. Roughly one year later, Subaru finally concluded that the root cause of the failure was the unstable electrical connection described above.</p>\n<p>The manufacturer was able to decide the scope of the recall by comparing vehicle production information, results of their own investigation, and field reports describing specific vehicles that contained the defect. Of the 366,282 vehicles currently reported to be included within the recall, Subaru estimates that roughly 10% of them contain the defect.</p>\n<h2>The Solution</h2>\n<p>&#8220;Subaru will notify owners, and dealers will inspect and, as necessary, replace the ODS sensor mat harness, free of charge,&#8221; stated <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCAK-19V701-9184.pdf\" rel=\"noopener noreferrer nofollow\">an official letter that Subaru filed with the National Highway Traffic Safety Administration</a>.</p>\n<p>Dealers have already been notified of the field action, and owners of vehicles affected by the recall will themselves be fully informed by the end of November. However, the parts being used for the repair are not currently available, so owners will be contacted once again, at a later date, when they can actually bring their vehicle in for the remedy to be implemented at no cost.</p>\n<p>For information on other vehicle recalls involving Subaru and other major automobile manufacturers, visit <a href=\"http://MotorSafety.org\">MotorSafety.org</a>.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=17634","createdAt":"2019-10-16T02:36:23.000Z","date_gmt":"2019-10-16T16:21:23.000Z","updatedAt":"2020-10-15T03:49:44.000Z","modified_gmt":"2020-10-15T17:34:44.000Z","display_date":"October 16, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V701000","recall_date":"October 3, 2019"},"year":2019,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/10/shutterstock_1788105914-1-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_1788105914-1","category":{"id":24,"name":"Subaru","slug":"subaru-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/subaru_ms.png"},"tags":[{"id":1308,"name":"2015-2018 Subaru Forester recall","slug":"2015-2018-subaru-forester-recall"},{"id":1309,"name":"Subaru heated seats","slug":"subaru-heated-seats"},{"id":1310,"name":"Subaru ODS","slug":"subaru-ods"}],"categories":[{"id":24,"name":"Subaru","slug":"subaru-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/subaru_ms.png"}]},{"id":17627,"title":"Ford Announces the Recall of Some F-250 and F-350 Vehicles","link":"https://www.motorsafety.org/ford-announces-the-recall-of-some-f-250-and-f-350-vehicles/","status":"publish","slug":"ford-announces-the-recall-of-some-f-250-and-f-350-vehicles","excerpt":"<p>Ford Motor Company recalls certain 2019 F-250 and F-350 pickups due to issues involving the rear deferential as well as the passenger side rear axle shaft.</p>\n","description":"<p>Laguna Hills, CA – Oct. 7, 2019 – The Ford Motor Company has announced the recall of certain 2019 F-250 and F-350 vehicles equipped with electronically locking rear differentials, resulting from issues that involve the passenger-side rear axle shaft. The manufacture has reported that roughly 28,600 vehicles will be affected by the recall, with estimates suggesting that more than 15 percent of those vehicles contain the defect.</p>\n<h2>The Defect</h2>\n<p>According to <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLQRT-19V688-0994.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">Ford&#8217;s description of the defect</a> in the recall report it filed with the National Highway Traffic Safety Administration, the passenger-side axle shaft of the electronically locking rear axle assembly may have been manufactured using steel that did not meet Ford&#8217;s precise specifications. Because of the incorrect material employed in this particular manufacturing run, the automaker believes that the affected passenger-side rear axle shafts involved in the recall may fracture much earlier than expected.</p>\n<p>Damage to the rear axle shaft could result in the loss of motive power to the vehicle. It could also prevent the vehicle from remaining in place while in the park function. Both possibilities significantly increase the possibility of crash, injury or unintended damage to the vehicle.</p>\n<h2>Timeline of Events</h2>\n<p>As detailed by the information included in the safety recall report sent to the NHTSA, the defect first came to light in August 2019, when a supplier notified Ford of a vehicle that had experienced an unusual passenger-side axle shaft failure during production testing. Further investigation revealed that part to have been produced with incorrect materials.</p>\n<p>&#8220;Upon investigation, the supplier determined that a certain batch of axles produced with an incorrect steel type were inadvertently mixed with the correct F-Super Duty axle shafts,&#8221; the automaker explained in its report. &#8220;Axles produced with the [incorrect] material do not meet Ford&#8217;s torsional strength and hardness specifications.&#8221;</p>\n<p>The recall action was officially approved by Ford&#8217;s Field Review Committee on Sept. 23, 2019.</p>\n<h2>The Solution</h2>\n<p>The documents filed by Ford with the NHTSA stated that Ford will begin notifying owners of the potentially affected in early October and encourage them to bring their vehicles in for an examination by their dealerships. Professionals will inspect the passenger-side rear axle shaft, replacing the part whenever necessary at no cost to vehicle owners. The recall is expected to formally begin Oct. 21, 2019.</p>\n<p>Those with further questions about the F-250 and F-350 recalls may contact Ford customer service at (866) 436-7332. The identification number for this field action is 19S31. For other issues or to seek more information, vehicle owners may also contact the NHTSA at (888) 327-4236.</p>\n<p>For additional news on Ford recalls, and other reports from the automotive industry, be sure to regularly visit <a href=\"http://MotorSafety.org\">MotorSafety.org</a>.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=17627","createdAt":"2019-10-09T06:06:28.000Z","date_gmt":"2019-10-09T19:51:28.000Z","updatedAt":"2020-10-15T03:54:19.000Z","modified_gmt":"2020-10-15T17:39:19.000Z","display_date":"October 09, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V688000","recall_date":"September 30, 2019"},"year":2019,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/10/Blue-2016-Ford-F-250-768x512.jpg","alt_text":"Blue 2016 Ford F-250 recall","cld_public_id":"Blue-2016-Ford-F-250","category":{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"},"tags":[{"id":1311,"name":"2019 Ford F-250 recall","slug":"2019-ford-f-250-recall"},{"id":1312,"name":"2019 Ford F-350 recall","slug":"2019-ford-f-350-recall"},{"id":1314,"name":"Ford rear axel","slug":"ford-rear-axel"},{"id":1313,"name":"Ford rear differential","slug":"ford-rear-differential"}],"categories":[{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"}]},{"id":17625,"title":"Chrysler Recalls Jeep Wrangler Vehicles with Right Hand Side Drive","link":"https://www.motorsafety.org/chrysler-recalls-jeep-wrangler-vehicles-with-right-hand-side-drive/","status":"publish","slug":"chrysler-recalls-jeep-wrangler-vehicles-with-right-hand-side-drive","excerpt":"<p>Chrysler has notified the National Highway Traffic Safety Administration of a recall of certain Jeep Wrangler right hand drive vehicles produced between late 2010 and early 2018.</p>\n","description":"<p>Laguna Hills, CA – Oct. 3, 2019 – Chrysler has notified the National Highway Traffic Safety Administration of <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCAK-19V680-1228.pdf\" rel=\"noopener noreferrer nofollow\">a recall pertaining to certain Jeep Wrangler right hand drive vehicles</a> produced between late 2010 and early 2018. The reason for the recall is a defect involving the driver&#8217;s seat belt buckle mounting strap.</p>\n<p>The manufacturer sells a small number of right-hand drive Jeep Wrangler vehicles to American consumers &#8211; in addition to the left hand drive-style vehicles that are standard in the U.S. &#8211; for very particular reasons, at least in theory: They are made specifically for rural mail carriers, who benefit from the unusual design in a number of ways.</p>\n<p>&#8220;Right-hand drive Wranglers are intended for rural mail deliverers who need to deal with both intense climates (hence the Wrangler) and mailboxes mounted on the passenger side of the vehicle (hence right hand drive)&#8221;, <a href=\"https://www.autotrader.com/car-news/you-can-buy-a-new-right-hand-drive-jeep-wrangler-in-the-us-256279\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">stated a report published by AutoTrader three years ago</a>. &#8220;These postal workers don&#8217;t drive to one spot in the neighborhood and walk around to all the houses, since each one of their deliveries can sometimes be several miles apart, so they deliver mail directly from their vehicles.&#8221;</p>\n<p>While the vehicles are made specifically for these mail carriers, there are no restrictions on who is able to purchase them, so the vehicle is available for sale to the general public as well.</p>\n<h2>The Defect</h2>\n<p>According to the safety recall report filed by Chrysler, the defect essentially creates the possibility that over time the seat belt system may become inoperative.</p>\n<p><a href=\"https://www.autotrader.com/car-news/you-can-buy-a-new-right-hand-drive-jeep-wrangler-in-the-us-256279\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">stated a report published by AutoTrader three years ago</a> explained that if the seat belt buckle is &#8220;fatigue-loaded&#8221; &#8211; subjected to excessive stress over time &#8211; its mounting strap can fracture and separate from the seat cushion&#8217;s frame.</p>\n<p>The manufacturer estimates that roughly 11,463 vehicles could potentially be involved in the recall, although it also estimates that only 1% of those vehicles contain the defect. Information on the cause of the flaw has not been included in any of the documents currently available.</p>\n<h2>Timeline of Events</h2>\n<p>The first notice of the possible defect came out March 20, 2019, when the NHTSA provided Chrysler with a vehicle owner questionnaire that described a driver&#8217;s seat belt buckle strap separation on a 2015 Jeep Wrangler right hand drive vehicle.</p>\n<p>Chrysler then conducted a number of tests on the failed buckle strap, and identified a &#8220;fatigue failure near the buckle strap mounting hole&#8221; as the reason for the problem. Additional, similar reports involving 2016 vehicles then followed, leading Chrysler to continue the investigation.</p>\n<p>Chrysler examined field data including customer complaints, vehicle owner questionnaires and warranty claims between July 24 and Aug. 8 and conducted engineering evaluations. These efforts led the automaker to conclude that only 2011-2018 Jeep Wrangler RHD vehicles built for rural mail carriers and sold in the U.S. market were affected.</p>\n<p>On Sept. 19, 2019, following the identification of a number of additional warranty claims and other reports pertaining to the same defect, Chrysler decided to conduct a voluntary safety recall of the affected vehicles.</p>\n<h2>The Solution</h2>\n<p>The recall is still in its early stages, so Chrysler is not planning to notify dealers or vehicle owners until Nov. 15, 2019. At that point, those who own the affected vehicles will bring them into an authorized dealership, where the seat belt buckle assembly will be repaired or replaced as is necessary at no cost.</p>\n<p>For information on additional Chrysler recalls, visit <a href=\"http://MotorSafety.org\">MotorSafety.org</a>.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=17625","createdAt":"2019-10-09T05:40:39.000Z","date_gmt":"2019-10-09T19:25:39.000Z","updatedAt":"2020-10-16T00:28:45.000Z","modified_gmt":"2020-10-16T14:13:45.000Z","display_date":"October 09, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V680000","recall_date":"September 26, 2019"},"year":2019,"month":10,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/10/shutterstock_514919989-1-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_514919989-1","category":{"id":33,"name":"Jeep","slug":"jeep-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/jeep_ms.png"},"tags":[{"id":1328,"name":"2010-2018 Jeep Wrangler recall","slug":"2010-2018-jeep-wrangler-recall"},{"id":1330,"name":"Jeep seat belt issue","slug":"jeep-seat-belt-issue"},{"id":1329,"name":"Jeep Wrangler right hand drive recall","slug":"jeep-wrangler-right-hand-drive-recall"}],"categories":[{"id":33,"name":"Jeep","slug":"jeep-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/jeep_ms.png"}]}]