[{"id":17052,"title":"Honda Issues Recall Due To Metal Fragments Affecting Air Bags","link":"https://www.motorsafety.org/honda-issues-recall-due-to-metal-fragments-affecting-air-bags/","status":"publish","slug":"honda-issues-recall-due-to-metal-fragments-affecting-air-bags","excerpt":"<p>American Honda Motor Co. is recalling certain 2019 CR-V sport utility vehicles due to the possibility that the automobile&#8217;s air bags could malfunction due to a steering wheel manufacturing issue. </p>\n","description":"<p>Laguna Hills, CA &#8211; June 24, 2019 &#8211; American Honda Motor Co. is recalling certain 2019 CR-V sport utility vehicles due to the possibility that the automobile&#8217;s air bags could malfunction or deploy errantly in the event of a crash, a problem linked to metal burrs found within the steering wheel unit. The company says it will inform affected owners by July 8 so motorists can schedule an appointment with their nearest dealer to have the issue checked out. Should a repair be necessary, it will come at no expense.</p>\n<h2>The Defect</h2>\n<p>According to <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCAK-19V383-7126.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">official paperwork filed</a> with and by the National Highway Traffic Safety Administration, nearly 118,600 Honda CR-Vs &#8211; model year 2019 &#8211; are being recalled because the guts of the steering wheel may be laced with metal burrs, or fragments, which may have developed during the assembly or manufacturing process. Some of these burrs may be sharp and potentially damage or short-circuit the cable reel sub-harness. Not only could this impede the driver&#8217;s side air bag from discharging &#8211; as it&#8217;s designed to do during a high-impact collision &#8211; but it may also render other steering unit functions inoperable, such as the horn, the supplemental restraint system warning indicator lights and other control buttons found on the wheel itself. The failure of any of these features poses an operator safety risk, which prompted Honda to take the actions that it did, including the contacting of NHTSA officials.</p>\n<h2>Timeline of Events</h2>\n<p>The first indication there <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLRPT-19V383-5322.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">could be a problem</a> occurred Jan 24, when workers at a Honda manufacturing facility, according to NHTSA documents, were alerted to a warning indicator light illuminating on one of the newly assembled CR-Vs. Further inquiry determined the notification was caused by a blown fuse on the cable reel sub-harness, the part that attaches to the air bag. Apparently, the sub-harness had been damaged by fragments piecing off from the metal core.</p>\n<p>Out of an abundance of caution, Honda notified all of its North American manufacturing facilities that this issue may not be isolated, which prompted a joint investigation 24 hours later alongside Autoliv ASP, Honda&#8217;s steering wheel supplier. The Mexico-based component supplier came up with a solution Jan. 31. But by February, Honda received feedback from a customer, informing the automaker that an air bag had deployed in a traffic situation without notice. A similar situation was brought to Honda&#8217;s attention in March.</p>\n<p>These two incidents &#8211; along with four more that occurred between April and early May &#8211; were enough to raise suspicion that the flaw was not isolated to CR-Vs that hadn&#8217;t yet been delivered to dealers and decided by May 14 to conduct a more broad safety recall. As of this data, the automaker was aware of 41 warranty claims tracing back to this issue, 20 field reports and three non-life threatening injuries, Honda <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RMISC-19V383-3473.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">noted in a press release</a> obtained by NHTSA. No crashes are believed to have occurred as a result.</p>\n<h2>The Solution</h2>\n<p>If dealers haven&#8217;t already been informed of the voluntary safety recall, they soon will be, as notifications were first distributed May 22. In the meantime, Honda says it will distribute mailers to registered CR-V users no later than July 8, advising that they take their SUV to a licensed dealership so the defective parts can be swapped out for those that work, assuming it&#8217;s necessary. The repair may also involve the installation of a protective cover on the steering wheel core. As per usual, parts and labor are free of charge. The automaker maintains that the reason for not informing owners sooner is due to the limited availability of replacement parts, an issue that should be resolved by early July.</p>\n<p>For more information on this specific recall, owners can call Honda directly at (888) 234-2138. Operators can determine if they&#8217;re SUV is affected by simply entering their VIN at <a href=\"https://www.motorsafety.org/\" target=\"_blank\" rel=\"noopener noreferrer\">MotorSafety.org</a>.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=17052","createdAt":"2019-06-24T05:49:16.000Z","date_gmt":"2019-06-24T19:34:16.000Z","updatedAt":"2020-10-20T03:34:22.000Z","modified_gmt":"2020-10-20T17:19:22.000Z","display_date":"June 24, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V383000","recall_date":"May 21, 2019"},"year":2019,"month":6,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/07/shutterstock_1442598269-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_1442598269","category":{"id":4,"name":"Honda","slug":"honda-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/honda_ms.png"},"tags":[{"id":1389,"name":"2019 Honda CR-v recall","slug":"2019-honda-cr-v-recall"},{"id":1435,"name":"Honda airbag","slug":"honda-airbag"},{"id":1434,"name":"Honda steering wheel","slug":"honda-steering-wheel"}],"categories":[{"id":4,"name":"Honda","slug":"honda-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/honda_ms.png"}]},{"id":17051,"title":"Nearly 1.2 million Ford Explorers Sidelined By Toe Link Defect","link":"https://www.motorsafety.org/nearly-1-2-million-ford-explorers-sidelined-by-toe-link-defect/","status":"publish","slug":"nearly-1-2-million-ford-explorers-sidelined-by-toe-link-defect","excerpt":"<p>Over 1.1 million 2011-2017 Ford Explorers are under recall notice due to a rear suspension system issue that poses a potential threat to riders&#8217; safety.</p>\n","description":"<p><span id=\"pk-id\" value=\"40047510\"></span></p>\n<p>Laguna Hills, CA &#8211; June 20, 2019 &#8211; Over 1.1 million 2011-2017 Ford Explorers are under recall notice by the model&#8217;s eponymous automaker due to a rear suspension system issue that poses a potential threat to riders&#8217; safety by increasing their crash risk. Ford Motor Company says it will inform registered owners of this hazard by first-class mail no later than June 24 and&nbsp;advise them to take their vehicles back to the dealer so that&nbsp;the problem, if diagnosed, can be fixed at no cost.</p>\n<h3>The Defect</h3>\n<p>According to filings with the National Highway Traffic Safety Administration, Ford is recalling approximately <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCAK-19V435-5204.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">1.19 million Explorers</a> &#8211; with&nbsp;model years ranging from 2011 to 2019 &#8211; whose rear suspension systems may be compromised. More specifically, the problem affects the sport utility vehicle&#8217;s toe links, which are located in the rear of the vehicle and provide added ballast so the wheels remain in constant contact with the road. However, it&#8217;s possible that these toe links could fracture while the vehicle is in operation, depending on the topography and curvature of a given road surface. In such an event, it could lead to an accident by reducing motorists&#8217; steering control.</p>\n<h3>Timeline of Events</h3>\n<p>This issue first came to Ford&#8217;s attention <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLRPT-19V435-6850.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">back in April 2017</a> when the automaker received feedback from an Explorer user who noted that the toe link on the SUV shattered after mistakenly hitting a curb. The automaker was made aware of other incidents involving the rear suspension issue through December 2018, although none of the incidents led to injury.</p>\n<p>But the number of events was enough to prompt an internal investigation, which featured engineers recreating situations that were similar to the ones referenced by motorists whose toe links broke or suspension systems failed. These tests determined that when Explorers were under stress &#8211; experiencing &#8220;suspension articulation,&#8221; in automotive jargon &#8211; the toe links could fracture, especially if exposed to the same types of jostling regularly and over time. A break could then lead to a steering failure and potential risk of an injury in the event of a crash.</p>\n<p>Ford&#8217;s Field Review Committee ultimately determined that a safety recall was warranted and informed NHTSA of this in early June.</p>\n<h3>The Solution</h3>\n<p>The recall is rather wide in scope, involving Explorers built between May 2010 and January 2017. Most of the potentially problematic SUVs are 2015 and 2016 models, as Ford says it&#8217;s recalling a combined 466,000 vehicles manufactured during this period. Of the 1.19 million warranting a recall, around 12,000 SUVs have the defect and will need to be serviced, according to NHTSA&nbsp;documents.&nbsp;</p>\n<p>Nevertheless, Ford says it will send out fliers to owners starting on June 24 to inform them of the safety issue and instruct drivers to take their SUVs to their nearest authorized dealer so the rear suspension toe links can be repaired or replaced. The recall is expected to cost the automaker <a href=\"https://www.bbc.com/news/business-48614704\" target=\"_blank\" rel=\"noopener noreferrer\">approximately $180 million</a>, according to BBC News, but for motorists themselves, the repair is free.</p>\n<p>For more information on this, contact Ford at 1-866-436-7332. You can also enter your VIN at <a href=\"https://www.motorsafety.org/\" target=\"_blank\" rel=\"noopener noreferrer\">MotorSafety.org</a> to see if your vehicle is affected by this or a separate recall. An estimated 25% of vehicles currently on the road have a recall that has yet to be repaired.&nbsp;<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=17051","createdAt":"2019-06-20T07:50:46.000Z","date_gmt":"2019-06-20T21:35:46.000Z","updatedAt":"2020-09-28T02:55:07.000Z","modified_gmt":"2020-09-28T16:40:07.000Z","display_date":"June 20, 2019","sticky":false,"recall":false,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2019,"month":6,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/06/shutterstock_1496899349-1-768x604.jpg","alt_text":"","cld_public_id":"shutterstock_1496899349-1","category":{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"},"tags":[],"categories":[{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"}]},{"id":17050,"title":"Potential Braking Issue Leads To Daimler Trucks Recall","link":"https://www.motorsafety.org/potential-braking-issue-leads-to-daimler-trucks-recall/","status":"publish","slug":"potential-braking-issue-leads-to-daimler-trucks-recall","excerpt":"<p>Daimler Trucks of North America (DTNA) is recalling nearly a dozen 2019 models due to an apparent flaw in the affected vehicles&#8217; air brakes.</p>\n","description":"<p>Laguna Hills, CA &#8211; June 19, 2019 &#8211; Daimler Trucks of North America (DTNA) is recalling nearly a dozen 2019 models due to an apparent flaw in the affected vehicles&#8217; air brakes, which may prevent the brakes from working as effectively as they&#8217;re intended. This may raise the chances of a crash if motorists are in traffic situations that require them to stop suddenly. The manufacturer says it will relay this information to motorists by July 12 so they can make the appropriate arrangements to have the problem assessed. If a repair is necessary, it will come at no charge.</p>\n<h3>The Defect</h3>\n<p>In <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCAK-19V367-4748.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">paperwork submitted</a> to the Department of Transportation&#8217;s National Highway Traffic Safety Administration, approximately 253 Daimler trucks have a potential safety issue that is serious enough to warrant a recall. These 2019 models include the following:</p>\n<ul>\n<li>Freightliner 108SD</li>\n<li>Business Class M2</li>\n<li>114SD</li>\n<li>Cascadia</li>\n<li>Western Star 5700</li>\n<li>FCCC XCL</li>\n<li>FCCC XCM</li>\n<li>FCCC XCR</li>\n<li>FCCC XCS</li>\n</ul>\n<p>According to NHTSA documents, the braking system may have caliper mounting bolts that either weren&#8217;t sufficiently tightened in the vehicle assembly process or may loosen while the trucks are in operation regardless of how they were originally tightened. In such a scenario, when the brake pad is applied, the air brakes&#8217; effectiveness may be reduced, decreasing handling control and increasing the risk of a crash &#8211; as well as the potential for injury.</p>\n<h3>Timeline of Events</h3>\n<p>DTNA was first <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLRPT-19V367-6573.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">alerted to this issue</a>&nbsp;in March 2019, learning that in isolated incidents, certain trucks&nbsp;had caliper mounting bolts that were either loose&nbsp;or missing. Each of these cases were traced back to an assembly plant in York, South Carolina that manufactures and installs brake components.</p>\n<p>Later that month, DTNA reached out to Meritor, its brake manufacturer, to further investigate. The company, Meritor, then reviewed the relevant data and determined that nine models &#8211; each of which were assembled in 2018 between Aug. 20 and Sept. 27 &#8211; had axles without accompanying caliper bolts. It was unclear whether bolts had been&nbsp;improperly fastened or didn&#8217;t exist, having&nbsp;perhaps&nbsp;fallen&nbsp;off at some point. Their findings were then relayed to DTNA in May, which prompted Daimler to issue a voluntary recall for the models in question. NHTSA was alerted May 14.</p>\n<h3>The Solution</h3>\n<p>Starting July 12, Daimler will officially reach out to affected customers by first-class mail to inform them that their vehicles&#8217; air brakes may be impaired. To ensure that such&nbsp;brakes will&nbsp;work properly, motorists should have the issue examined by a DTNA dealer as soon as possible. As with virtually all automotive safety recalls, the repair is complimentary.</p>\n<p>To see if your vehicle is included in this or any other recall, enter your 17-digit VIN in the appropriate field at <a href=\"https://www.motorsafety.org/\" target=\"_blank\" rel=\"noopener noreferrer\">MotorSafety.org</a>.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=17050","createdAt":"2019-06-19T05:14:00.000Z","date_gmt":"2019-06-19T18:59:00.000Z","updatedAt":"2020-09-28T02:58:44.000Z","modified_gmt":"2020-09-28T16:43:44.000Z","display_date":"June 19, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2019,"month":6,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/06/shutterstock_327084110-1-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_327084110-1","category":{"id":5,"name":"Mercedes-Benz","slug":"mercedes-benz-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mercedes_RM.png"},"tags":[],"categories":[{"id":5,"name":"Mercedes-Benz","slug":"mercedes-benz-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mercedes_RM.png"}]},{"id":17046,"title":"Audi Recalling E-Trons Due To Fire Risk","link":"https://www.motorsafety.org/audi-recalling-e-trons-due-to-fire-risk/","status":"publish","slug":"audi-recalling-e-trons-due-to-fire-risk","excerpt":"<p>Around 1,600 Audi E-Tron EV vehicles are being recalled due to an apparent sealant issue that risks moisture impairing the vehicle&#8217;s battery. This defect could result in a fire. </p>\n","description":"\n<p><em>Laguna Hills, CA &#8211; June 18, 2019</em> &#8211; Around 1,600 Audi e-Tron EV vehicles are being recalled after the model&#8217;s parent company, Volkswagen Group of America, learned some of the vehicles may have defective seals that could compromise its battery system, should moisture leak inside. </p>\n\n\n\n<p>In such a scenario, the battery could pose a fire hazard. Although Audi hasn&#8217;t determined when specifically it will inform owners of this issue, it expects to do so before June concludes. The component necessary to resolve the problem will likely arrive in August, which dealers will install for free.</p>\n\n\n\n<h2>The defect</h2>\n\n\n\n<p>Volkswagen Group, which owns Audi, says it&#8217;s <a rel=\"noopener noreferrer\" href=\"https://static.nhtsa.gov/odi/rcl/2019/RCAK-19V434-4025.pdf\" target=\"_blank\">recalling 1,644</a> 2019 Audi e-Trons due to a sealant issue that affects the electric vehicle&#8217;s propulsion system, according to documents filed with the National Highway Traffic Safety Administration. </p>\n\n\n\n<p>It turns out that the seal meant to prevent moisture from coming into contact with the high-voltage battery may be damaged, an issue that likely occurred during the assembly process. </p>\n\n\n\n<p>If rain, snow, or other types of moisture gets in between the battery charging socket and other components of the voltage system, it raises the risk of an engine fire. However, neither Audi nor its parent company are aware of any such events thus far.</p>\n\n\n\n<p>Moisture leaking into the battery would be virtually impossible to detect on its own, but the onboard computer will alert motorists to this problem before it becomes a potential safety issue, with a message on the dashboard panel that warns of an electrical fault or failure. </p>\n\n\n\n<p>Audi says that motorists should stop driving immediately if they receive this warning and to contact roadside assistance.</p>\n\n\n\n<h2>Timeline of events</h2>\n\n\n\n<p>Mechanical issues often come to light from motorists themselves by reaching out to the automaker or NHTSA, but this one was recognized by Audi during quality control testing. </p>\n\n\n\n<p>It found <a rel=\"noopener noreferrer\" href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLRPT-19V434-4891.PDF\" target=\"_blank\">two instances in February 2019,</a> where the charging units failed to function. This led to a follow-up investigation, which determined in mid-March that the problem likely originated from a faulty seal that exposed the charging socket to moisture.</p>\n\n\n\n<p>Analysts&#8217; suspicions were confirmed when customers alerted Audi to instances in which they received &#8220;check engine&#8221; warnings on their display panels above the steering wheel. </p>\n\n\n\n<p>Mechanics for Audi reached out to one of the owners who experienced this issue and found that moisture was the likely culprit. This prompted the dispatching of Audi&#8217;s Product Safety Committee, which began its inquiry in mid-April and concluded the review June 3. </p>\n\n\n\n<p>It confirmed that, although unlikely, a fire could ignite if moisture from the charging socket made its way onto the high-voltage battery. Audi subsequently informed NHTSA of the voluntary recall.</p>\n\n\n\n<h2>The solution</h2>\n\n\n\n<p>Audi says it will make e-Tron owners aware of this issue before the end of June, so they can have their vehicles examined. Dealers will diagnose whether the sealant happens to be compromised and install a corrective grommet to prevent moisture from coming into contact with the battery. </p>\n\n\n\n<p>As per usual, the fix will be provided free of charge.</p>\n\n\n\n<p>Check your car’s recall status using MotorSafety’s <a href=\"https://www.motorsafety.org/\">free vehicle lookup tool</a>.</p>\n<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script>","source":"https://www.motorsafety.org/?p=17046","createdAt":"2019-06-17T23:34:00.000Z","date_gmt":"2019-06-18T13:19:00.000Z","updatedAt":"2020-10-20T03:39:15.000Z","modified_gmt":"2020-10-20T17:24:15.000Z","display_date":"June 18, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V434000","recall_date":"June 10, 2019"},"year":2019,"month":6,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/06/Audi-e-tron-768x512.jpg","alt_text":"Silver Audi e-tron outside building.","cld_public_id":"Audi-e-tron","category":{"id":16,"name":"Audi","slug":"audi-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/audi_RM.png"},"tags":[{"id":1381,"name":"2019 Audi E-tron recall","slug":"2019-audi-e-tron-recall"},{"id":1436,"name":"Audi battery recall","slug":"audi-battery-recall"},{"id":474,"name":"Audi fire risk","slug":"audi-fire-risk"}],"categories":[{"id":16,"name":"Audi","slug":"audi-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/audi_RM.png"}]},{"id":17047,"title":"Certain Recalled F-150s May Need Another Fix, Ford Says","link":"https://www.motorsafety.org/certain-recalled-f-150s-may-need-another-fix-ford-says/","status":"publish","slug":"certain-recalled-f-150s-may-need-another-fix-ford-says","excerpt":"<p>Tens of thousands of F-150s &#8211; consistently the best-selling vehicle in America &#8211; are being recalled by the Ford Motor Company due to flaws within the truck&#8217;s powertrain control module.</p>\n","description":"<p>Laguna Hills, CA &#8211; June 18, 2019 &#8211; Tens of thousands of F-150s &#8211; consistently the best-selling vehicle in America &#8211; are being recalled by the Ford Motor Company due to flaws within the truck&#8217;s powertrain control module, which may cause the vehicle to downshift without warning. The unexpectedness of such a scenario may reduce a driver&#8217;s ability to maintain control of the car, thus increasing the risk of a crash and resulting injury. This latest recall is a follow-up to one that occurred in March over a similar issue.</p>\n<p>Owners are urged to bring their trucks back to the dealer so a free fix can be scheduled, which will likely involve a reprogramming or full-scale replacement of the PCM. Motorists will be notified officially no later than June 24 by first-class mail.</p>\n<h3>The Defect</h3>\n<p>As corroborated by the National Highway Traffic Safety Administration, <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCAK-19V433-5780.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">Ford is recalling</a> 107,857 2013 F-150 trucks due to malfunctions with the powertrain control module, which were first brought to the attention of the automaker in 2016 and have since resulted in a number of follow-up investigations. In fact, certain 2011-2013 F-150s were recalled over PCM issues <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCAK-19V075-6577.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">back in February</a>, only that one involved over 1.2 million vehicles. The concern at the time was the potential for these&nbsp;trucks&nbsp;to suddenly downshift to a lower gear, even though motorists may be traveling at a high speed &#8211; which would, under normal circumstances, prevent that from happening.</p>\n<p>The difference between this latest&nbsp;fault&nbsp;and the one discovered&nbsp;in February is the software used to reprogram the PCM wasn&#8217;t the latest version, so the initial configuration may not have worked. In essence, this latest recall is to correct the original.</p>\n<p>If motorists are operating an adversely affected F-150, they may experience a reduction in speed out of nowhere. This could raise the risk of an accident, particularly on the highway where other motorists are driving at 65 miles per hour and over. Speed is consistently the leading factor in car crashes, according to NHTSA.</p>\n<h3>Timeline of Events</h3>\n<p>On May 16, <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLRPT-19V433-4894.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">a technician alerted</a> Ford&#8217;s Critical Concern Review Group that certain 2013 F-150s&nbsp;whose powertrains were reprogrammed may not have been fixed with the appropriate software updates in place. To determine those involved, Ford launched an investigation and concluded that the corrections weren&#8217;t applied to trucks with 5.0 and 6.2 liter engines. Thus, those that were recalled initially would need to be recalled again, which Ford&#8217;s Field Review Committee authorized on June 3. The company believes potentially as many as 100% of the 107,857 F-150s may still have PCMs that weren&#8217;t appropriately calibrated, assuming motorists brought them to their dealer when they were first informed of the glitch.</p>\n<p>The Ford F-Series commands quite the presence in the automotive world. In 2017, <a href=\"https://www.businessinsider.com/ford-f-series-f150-truck-sales-record-history-2017-1\" target=\"_blank\" rel=\"noopener noreferrer\">more than 896,000 trucks were sold</a> nationwide, according to Business Insider, its best-selling year on record, which dates back to 1977. It&#8217;s consistently the top-seller of all models in the U.S. &#8211; a feat reached for 36 years running. This may explain why this and the original recall affected so many.</p>\n<h3>The Solution</h3>\n<p>Ford says that the recall will get underway officially on June 24, when owners will be notified of the issue by mail. Motorists are urged to bring their truck back to an authorized Ford dealer for a fresh PCM reprogramming. Like the original &#8211; and virtually all safety recalls &#8211; the service is complimentary.</p>\n<p>For more information on this recall, owners have several options. They can contact by phone, dialing 1-866-436-7332, which is Ford&#8217;s toll-free hotline. Alternatively, check <a href=\"https://www.motorsafety.org/\" target=\"_blank\" rel=\"noopener noreferrer\">MotorSafety.org</a> by entering the truck&#8217;s VIN in the designated field.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=17047","createdAt":"2019-06-17T23:32:18.000Z","date_gmt":"2019-06-18T13:17:18.000Z","updatedAt":"2020-09-28T03:07:25.000Z","modified_gmt":"2020-09-28T16:52:25.000Z","display_date":"June 18, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2019,"month":6,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/06/shutterstock_1397756954-1-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_1397756954-1","category":{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"},"tags":[],"categories":[{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"}]},{"id":17041,"title":"Another Air Bag Issue For BMW Owners","link":"https://www.motorsafety.org/another-air-bag-issue-for-bmw-owners/","status":"publish","slug":"another-air-bag-issue-for-bmw-owners","excerpt":"<p>BMW of North America seeks to recall nearly 2,000 X7 xDrive 40i and X7 xDrive50i models after learning that some of these vehicles may have head air bags errantly installed.</p>\n","description":"<p><span id=\"pk-id\" value=\"40047504\"></span></p>\n<p>Laguna Hills, CA &#8211; June 17, 2019 &#8211; BMW of North America seeks to recall nearly 2,000 X7 xDrive 40i and&nbsp;X7 xDrive50i models after learning that some of these vehicles may have head air bags errantly installed As a result, their deployment after a crash may result in injury or exacerbate the resulting effects. The German automaker advises owners of these SUVs to take their vehicles to their local BMW dealer to determine if a repair is necessary. If so, it will be arranged free of charge. The correction may involve entirely removing the air bag system and replacing with a new one or repair the existing air bag.</p>\n<h3>The Defect</h3>\n<p>In <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCAK-19V386-3785.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">official paperwork filed</a> with the National Highway Traffic Safety Administration, which is an arm of the U.S. Department of Transportation, BMW is recalling 1,822 SUVs, specifically 2019 X7 xDrive40i and X7 xDrive50i.</p>\n<p>The German automaker says that the head air bags &#8211; installed within the wheel on the driver&#8217;s side and the dashboard for the passenger &#8211; may be out of alignment with the vehicle trim. The issue is not with the air bag itself but rather improper installation.</p>\n<p>Because they weren&#8217;t loaded according to the manufacturer&#8217;s specified instructions, the air bags may not inflate correctly, thereby increasing the risk of head injury during a crash, the impact of which triggers deployment. BMW says it&#8217;s taking this step out of an abundance of caution, believing that only 1% of the potentially safety compromised&nbsp;SUVs contain the flaw.</p>\n<p>This is the second voluntary recall for BMW in as many weeks, as close to 1,700 2-Series, 3-Series and 4-Series vehicles <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLRPT-19V352-9638.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">are being pulled</a> from the marketplace because of damaged passenger knee air bags.</p>\n<h3>Timeline of Events</h3>\n<p>The air bag failing first came to BMW&#8217;s attention <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLRPT-19V386-4459.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">during a quality control check</a>&nbsp;at the automaker&#8217;s Westwood, New Jersey-based assembly plant. Two SUVs were identified as suspect. This led to a follow-up to see if other model xDrive 2019 models were potentially compromised. Review of the relevant paperwork suggested that if other vehicles contain a similar flaw, the number was minimal. The investigation also helped BMW determine that any subsequent offending models were produced between Nov. 5, 2018 and April 3, 2019. The company says it&#8217;s unaware of any accidents or injuries tracing back to this issue, but nevertheless decided to make the recall notice official on May 16. NHTSA notified BMW of its desire to do so on June 10 and gave the company the go ahead.</p>\n<h3>The Solution</h3>\n<p>Starting on July 15, BMW will reach out to xDrive owners by first-class mail about the possibility their air bag may be impaired and what they can do to address this issue. The simplest solution is taking their car to an authorized dealership, who can diagnose whatever happens to be the problem and fix. The remedy will be free, as is normally the case for safety recalls that are voluntary or mandatory.</p>\n<p>Dial 1-800-525-7417, BMW&#8217;s customer service hotline, for more information on this recall. You can also enter your VIN at <a href=\"https://www.motorsafety.org/\" target=\"_blank\" rel=\"noopener noreferrer\">MotorSafety.org</a> to see if your model is subject to this or any other safety recall.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=17041","createdAt":"2019-06-16T23:40:52.000Z","date_gmt":"2019-06-17T13:25:52.000Z","updatedAt":"2020-09-28T03:12:32.000Z","modified_gmt":"2020-09-28T16:57:32.000Z","display_date":"June 17, 2019","sticky":false,"recall":false,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2019,"month":6,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/06/shutterstock_1604613184-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_1604613184","category":{"id":15,"name":"BMW","slug":"bmw-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/bmw_RM.png"},"tags":[],"categories":[{"id":15,"name":"BMW","slug":"bmw-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/bmw_RM.png"}]},{"id":17039,"title":"Over 17,000 Mazda3s recalled due to flawed indicator lights","link":"https://www.motorsafety.org/over-17000-mazda3s-recalled-due-to-flawed-indicator-lights/","status":"publish","slug":"over-17000-mazda3s-recalled-due-to-flawed-indicator-lights","excerpt":"<p>Mazda North American Operations is recalling certain 2019 Mazda3 units because some of the onboard notification systems may provide incorrect information to drivers. </p>\n","description":"<p>Laguna Hills, CA &#8211; June 14, 2019 &#8211; Mazda North American Operations is recalling certain 2019 Mazda3 units because some of the onboard notification systems &#8211; specifically air bag activation and seat belt use &#8211; may provide incorrect information while motorists are driving their vehicles. An investigation determined that the indicator lights may not illuminate when they&#8217;re supposed to, which could increase the risk of injury by ill informing drivers of the passenger safety situation.</p>\n<p>Mazda has alerted the National Highway Traffic Safety Administration to this issue and plans on officially informing affected drivers starting no later than July 13 by first-class mail. Drivers are urged to take their vehicles to their local Mazda dealer so the proper corrections can be installed as necessary. The repair will be free, as is typically the case for safety recalls.</p>\n<h3>The Defect</h3>\n<p>Approximately 17,000 Mazda3 vehicles &#8211; model year 2019 &#8211; are due for recall because of a programming error that affects the indicator lights on the automobile&#8217;s dashboard, <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCAK-19V363-9723.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">according to paperwork</a> filed with NHTSA. Under normal circumstances, when an airbag is deactivated, the symbol representing this feature illuminates. The seatbelt status also lights up if someone in the automobile is not buckled in. However, some of the affected Mazda3s may erroneously turn off, suggesting that a passenger has his or her seatbelt on when the opposite is true. Similarly, the airbag deactivation signal may not shine when it ought to.</p>\n<p>Accurate information is crucial to driver safety so the false impression of seat belt adherence or air bag deployment could increase the risk of injury. According to NHTSA, <a href=\"https://www.nhtsa.gov/risky-driving/seat-belts\" target=\"_blank\" rel=\"noopener noreferrer\">close to 90% of Americans</a> say they wear their seat belts regularly. In 2017, an estimated 14,955 people avoided a potentially fatal accident thanks to buckling up. During this same year, over 2,500 would likely be alive today had they worn their seat belts in a deadly crash.</p>\n<h3>Timeline of Events</h3>\n<p>Valentine&#8217;s Day proved to be the starting date for when Mazda was alerted to the air bag illumination glitch. Worried that this flaw was more than an isolated incident, the automaker performed follow-up to determine the genesis of the flaw, which Mazda was able to determine on March 1. By March 23, the appropriate fix was applied to all Mazda3 models built thereafter. It nonetheless concluded that 2019 models built between Sept. 25, 2018 and March 23 could be affected, prompting the recall order of 17,016 Mazda3 vehicles.&nbsp; However, in a statement released June 8, Mazda <a href=\"https://insidemazda.mazdausa.com/press-release/statement-on-recall-of-certain-2019-my-mazda3-vehicles/\" target=\"_blank\" rel=\"noopener noreferrer\">says the recall order affects</a> 16,982 Mazda3s.</p>\n<h3>The Solution</h3>\n<p>While Mazda dealers have already been alerted to the situation, the company expects to inform Mazda3 owners by July 13, according to NHTSA documents. Drivers are advised to take their automobile to an authorized Mazda dealer so the indicator assembly system can be repaired or replaced. The fix is free, as are most safety recalls.</p>\n<p>For additional details, you can enter your VIN at <a href=\"https://www.motorsafety.org/\" target=\"_blank\" rel=\"noopener noreferrer\">MotorSafety.org </a>to see if your car is included in the recall, which the company says is exclusive to 2019 Mazda3s.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=17039","createdAt":"2019-06-14T05:08:05.000Z","date_gmt":"2019-06-14T18:53:05.000Z","updatedAt":"2020-09-28T03:17:08.000Z","modified_gmt":"2020-09-28T17:02:08.000Z","display_date":"June 14, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2019,"month":6,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/06/shutterstock_241689901-1-768x513.jpg","alt_text":"","cld_public_id":"shutterstock_241689901-1","category":{"id":18,"name":"Mazda","slug":"mazda-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mazda.png"},"tags":[],"categories":[{"id":18,"name":"Mazda","slug":"mazda-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mazda.png"}]},{"id":17040,"title":"Air Bag Deployment Glitch Triggers Recall of 5,000 BMWs","link":"https://www.motorsafety.org/air-bag-deployment-glitch-triggers-recall-of-5000-bmws/","status":"publish","slug":"air-bag-deployment-glitch-triggers-recall-of-5000-bmws","excerpt":"<p>BMW of North America is recalling thousands of 2019-2020 model years passenger vehicles due to a potential air bag flaw that may alter the manner in which it deploys</p>\n","description":"<p><span id=\"pk-id\" value=\"40047500\"></span></p>\n<p>Laguna Hills, CA &#8211; June 14, 2019 &#8211; BMW of North America is recalling thousands of 2019-2020 model years passenger vehicles due to a potential air bag flaw that may alter the manner in which it deploys. Specifically, the defect affects the knee air bag assemblies, which may have been errantly folded at some point in the manufacturing process. It&#8217;s possible that the air bag may not uncoil completely after a collision, raising the risk of injury.</p>\n<p>The recall is expected to begin on July 2 and owners of the affected models are advised to take their automobiles off the roads so they can be serviced &#8211; for free &#8211; by a licensed BMW dealership.</p>\n<h3>The Defect</h3>\n<p>BMW says its pulling 5,079 automobiles from the marketplace &#8211; of which include coupes, convertibles and sports wagons &#8211; due to improper installation of the knee air bags that are meant to protect the driver as well as the front-seated passenger, <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCAK-19V352-3346.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">according to documents</a> filed with the National Highway Traffic Safety Administration. The models include 230I, 330I, 430I, 440I, M2, M240I and M4. Their model years are 2019 and 2020 (the 330I is for 2019 only). It seems that the knee air bag modules, which were manufactured by Joyson Safety Systems, may have been loaded into the vehicles&#8217; housing systems incorrectly. This could prevent the air bag from inflating properly upon impact in a crash that triggers them. Injury may result in such a scenario to the driver, passenger or both.</p>\n<h3>Timeline of Events</h3>\n<p>The problem first <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLRPT-19V352-9638.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">came to the attention </a>of BMW in mid April. At the time, components manufacturer Joyson Safety Systems alerted the automaker that some of the air bags in several 2019-2020 may have been damaged during compliance testing. JSS came to this conclusion after performing additional examinations to see if the flaw was isolated or potentially widespread. Ultimately, the air bag manufacturer determined that at least several of the knee air bags were not adequately packed in the housing unit.</p>\n<p>BMW concluded that it was best to err on the side of caution and initiated a voluntary recall on May 2, which entailed alerting NHTSA to the issue. There are no known injuries that trace back to this flaw.</p>\n<h3>The Solution</h3>\n<p>BMW says that it plans on notifying owners by July 2&nbsp;about the potential problem and will encourage them to have the issue looked at the same place they bought their automobile. If not there, at a licensed BMW dealership. As per usual, the fix will come at no cost to drivers. It may be that a repair is unnecessary, as only about 13% of the recalled models are believed to have the defect. In paperwork filed with NHTSA, BMW suspects that the 4 series coupe models are most likely to be the ones affected, as 2,357 of these vehicles were equipped with knee airbag modules, compared to just 154 for the BMW 3 series sports wagon.</p>\n<p>The NHTSA campaign number relating to this recall is 19V-352. Find out more at <a href=\"https://www.motorsafety.org/\" target=\"_blank\" rel=\"noopener noreferrer\">MotorSafety.org</a>.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=17040","createdAt":"2019-06-14T05:08:00.000Z","date_gmt":"2019-06-14T18:53:00.000Z","updatedAt":"2020-09-28T03:21:23.000Z","modified_gmt":"2020-09-28T17:06:23.000Z","display_date":"June 14, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2019,"month":6,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/06/shutterstock_524996422-1-768x510.jpg","alt_text":"","cld_public_id":"shutterstock_524996422-1","category":{"id":15,"name":"BMW","slug":"bmw-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/bmw_RM.png"},"tags":[],"categories":[{"id":15,"name":"BMW","slug":"bmw-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/bmw_RM.png"}]},{"id":17021,"title":"2011-2013 Mazda6 Under Recall Due to Corrosion","link":"https://www.motorsafety.org/2011-2013-mazda6-under-recall-due-to-corrosion/","status":"publish","slug":"2011-2013-mazda6-under-recall-due-to-corrosion","excerpt":"<p>Mazda says its recalling over 49,339 Mazda6 sedans due to the potential of a steering failure caused by corrosion.</p>\n","description":"<p>Laguna Hills, CA &#8211; June 12, 2019 &#8211; Mazda says its recalling over 49,300 Mazda6 sedans due to the potential of a steering failure caused by corrosion developed over time due to the damaging effects of road salt, frequently spread on highways and streets to improve traction during the winter months. The model years for the affected vehicles are 2011 through 2013 and involve sedans sold or registered in 22 states as well as the District of Columbia. The concern is that excessive jostling of the impacted automobiles may adversely affect power-steering function and front crossbar, thus increasing the risk of an accident.</p>\n<p>2011-2013 Mazda6 owners are urged to bring their vehicles to their nearest Mazda dealership so a repair can be arranged free of charge. The fix will likely involve the restoration or replacement of a drain hose and front cross member.</p>\n<h2>The Defect</h2>\n<p>According to <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLRPT-19V323-6043.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">documents filed</a> with the National Highway Traffic Safety Administration, Mazda is recalling certain Mazda6 sedans from the aforementioned model years due to concerns that the front cross member of the vehicle, which is found on the underside and involved in a car&#8217;s transmission functionality, may be vulnerable to depredation caused by road salt. The flaw may also adversely impact the sedan&#8217;s power steering, thus increasing the risk of a crash and/or injury to occupants. NHTSA investigators believe that the front cross member may not be applied with the proper amount of seal coating designed to protect the underbelly from the corrosive effects of road salt.</p>\n<p>Since the source of the safety issue is known &#8211; road salt &#8211; NHTSA is confining the recall to so-called &#8220;salt belt&#8221; states,&#8221; which include Connecticut, Delaware, Illinois, Indiana, Iowa, Kentucky, Maine, Maryland, Massachusetts, Michigan, Minnesota, Missouri, New Hampshire, New Jersey, New York, Ohio, Pennsylvania, Rhode Island, Vermont, Virginia West Virginia and Wisconsin. 2011-2013 Mazda6&#8217;s sold or registered in the District of Columbia are also included in the recall order. The automobiles in question were likely manufactured between Feb. 4, 2008 and Aug. 24, 2012.</p>\n<h2>Timeline of Events</h2>\n<p>The latest recall is actually an expansion of one that involved 2009-2010 Mazda6 autos. But on Sept. 14, 2018, the company decided to include sedans with model years 2011 through 2013 after dozens of complaints from drivers describing the same problems that led to the original recall. By Jan. 11, 2019, Transport Canada had reached out to Mazda as well, citing corrosion affecting the steering components of Mazda6 sedans. An audit committee meeting, held April 22, determined that the best course of action was to recall all Mazda6 registered or sold in the salt belt states between early February 2008 and late August 2012.</p>\n<h2>The Solution</h2>\n<p>Mazda says that no later than June 24, the company &#8211; in consultation with NHTSA &#8211; will reach out to owners of the affected vehicles by first-class mail to inform them of the potential safety issue and recommend they take their sedans back to the dealership to be properly examined. If it&#8217;s determined that their vehicle is vulnerable to corrosion &#8211; or if the adverse effects of such damage are already apparent &#8211; mechanics will swap out the appropriate parts: most likely the front cross member. This repair will be complimentary, as is often standard with recall actions.</p>\n<p>For more information on the recall order, <a href=\"https://www.motorsafety.org/\" target=\"_blank\" rel=\"noopener noreferrer\">visit MotorSafety.org</a> and enter your VIN in the appropriate field.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=17021","createdAt":"2019-06-11T23:49:40.000Z","date_gmt":"2019-06-12T13:34:40.000Z","updatedAt":"2020-10-20T03:56:02.000Z","modified_gmt":"2020-10-20T17:41:02.000Z","display_date":"June 12, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V323000","recall_date":"April 25, 2019"},"year":2019,"month":6,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/06/shutterstock_308973830-1-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_308973830-1","category":{"id":18,"name":"Mazda","slug":"mazda-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mazda.png"},"tags":[{"id":1437,"name":"2011-2013 Mazda 6 recall","slug":"2011-2013-mazda-6-recall"},{"id":1438,"name":"Mazda steering failure","slug":"mazda-steering-failure"}],"categories":[{"id":18,"name":"Mazda","slug":"mazda-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mazda.png"}]},{"id":17016,"title":"Chrysler Recalls Ram 1500s Due To Restraint System Errors","link":"https://www.motorsafety.org/chrysler-recalls-ram-1500s-due-to-restraint-system-errors/","status":"publish","slug":"chrysler-recalls-ram-1500s-due-to-restraint-system-errors","excerpt":"<p>Ram 1500 trucks are under recall notice due to an onboard software flaw that may prevent the vehicle&#8217;s airbag from deploying in the aftermath of a crash.</p>\n","description":"<p>Laguna Hills, CA &#8211; June 10, 2019 &#8211; Fiat Chrysler Automobiles LLC (FCA) is pulling nearly 300,000 Ram 1500 trucks &#8211; model years 2019 and 2020 &#8211; from the marketplace due to an onboard software flaw that may prevent the vehicle&#8217;s air bag from deploying in the aftermath of a crash, thus increasing the risk of injury. The automobile&#8217;s seat belt pretensioners may also fail to function due to the tech defect. The company says it will reach out to Ram 1500 owners by mail later this summer, advising them to take their trucks to their nearest Chrysler dealership so repair work can be arranged. The fix will come at no cost to drivers.</p>\n<h2>The Defect</h2>\n<p>According to documents submitted to and produced by the National Highway Traffic Safety Administration, approximately 295,981 2019-2020 Ram 1500s <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCAK-19V407-2127.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">are due for recall</a> because the truck&#8217;s occupant restraint controller (ORC) system may not work properly in the event of a traffic accident. Specifically, the issue seems to affect the ORC&#8217;s flash memory, in which the computer module doesn&#8217;t reset as it&#8217;s supposed to when powering down the vehicle. This reset failure could then prevent the airbags and/or seat-belt pretensioners from operating correctly in a collision-related event.</p>\n<p>In a statement acknowledging that the company is aware of the problem, FCA said that while they are making this move out of an abundance of caution, the chances that such a scenario occurs for motorists is highly unlikely.</p>\n<p>&#8220;Data collected by FCA US indicate the potential for such an event is highly remote,&#8221; the Auburn Hills, Michigan-based manufacturer said in a press release. &#8220;Further, the Company is unaware of any related injuries or accidents.&#8221;</p>\n<h2>Timeline of Events</h2>\n<p>The issue came to FCA&#8217;s attention April 8, when an engineer on the manufacturer&#8217;s Vehicle Safety and Regulatory Compliance team <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLRPT-19V407-5385.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">observed a corrupted software notification</a> that occurred when turning off the truck. A formal investigation by Fiat Chrysler occurred in the immediate aftermath, which extended to May 3. The inquiry determined that the flaw had the potential to prevent the seatbelt pretensioner or airbags from serving their purpose during an accident. However, through May 20, the company wasn&#8217;t aware of any operator complaints or injuries that occurred &#8211; in the U.S. or elsewhere &#8211; related to the software glitch. This may be due to the fact that many of the affected automobiles &#8211; up to 33% &#8211; are still at dealerships, yet to be purchased by would-be operators. Those impacted were likely assembled at some point between Oct. 31, 2018 and April 29, 2019.</p>\n<p>FCA deemed it appropriate that a voluntary recall be ordered for the Ram 1500s, which is what prompted the safety notification to NHTSA.</p>\n<h2>The Solution</h2>\n<p>On June 1, FCA sent out letters to dealerships, informing them of the problem and that 2019-2020 Ram 1500s should be set aside for the time being. Current operators will also be made aware of the glitch, which is slated to begin on July 20. Owners are urged to bring their trucks to their nearest FCA dealer so the ORC can either be reprogrammed or replaced, whichever fix is deemed appropriate by the attending mechanics. This repair will be free of charge.</p>\n<p>To learn more, dial 1-888-327-4236, which is NHTSA&#8217;s vehicle safety hotline. You can also enter your VIN at <a href=\"https://www.motorsafety.org/\" target=\"_blank\" rel=\"noopener noreferrer\">MotorSafety.org</a> to see if your make and model is under recall.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=17016","createdAt":"2019-06-10T07:33:49.000Z","date_gmt":"2019-06-10T21:18:49.000Z","updatedAt":"2020-10-20T04:44:32.000Z","modified_gmt":"2020-10-20T18:29:32.000Z","display_date":"June 10, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V407000","recall_date":"May 31, 2019"},"year":2019,"month":6,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/06/shutterstock_1508176928-1-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_1508176928-1","category":{"id":9,"name":"RAM","slug":"ram-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/11/RAM.png"},"tags":[{"id":891,"name":"2019 - 2020 Ram 1500 recall","slug":"2019-2020-ram-1500-recall"},{"id":1440,"name":"RAM airbag","slug":"ram-airbag"},{"id":1439,"name":"RAM software issue","slug":"ram-software-issue"}],"categories":[{"id":9,"name":"RAM","slug":"ram-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/11/RAM.png"}]},{"id":17003,"title":"Glass Mix–Up Prompts Recall of GM Vans","link":"https://www.motorsafety.org/glass-mix-up-prompts-recall-of-gm-vans/","status":"publish","slug":"glass-mix-up-prompts-recall-of-gm-vans","excerpt":"<p>Over a thousand Chevrolet Express and GMC Savana vehicles are due to be recalled as a result of the possible wrong installation of tempered glass in the automobiles&#8217; rear windows.</p>\n","description":"\n<p><em>Laguna Hills, CA &#8211; June 7, 2019</em> &#8211; Over a thousand Chevrolet Express and GMC Savana vehicles with model years 2016&nbsp;to 2019&nbsp;produced by General Motors LLC, are due to be recalled as a result of the possible wrong installation of tempered glass in the automobiles&#8217; rear windows. </p>\n\n\n\n<p>The vans were meant to be installed with laminated glass, which tend to be more resistant to shattering, but instead feature tempered glass. In the event of a serious accident &#8211; such as a rollover &#8211; the&nbsp;tendency&nbsp;of tempered glass to explode&nbsp;increases the risk of injury. </p>\n\n\n\n<p>GM intends to send out advisories to owners of these vehicles, urging them to take the automobiles to their nearest GM dealer for a free repair. It&#8217;s unclear as of yet when those notifications will begin.</p>\n\n\n\n<h2>The defect</h2>\n\n\n\n<p>According to <a rel=\"noopener noreferrer\" href=\"https://static.nhtsa.gov/odi/rcl/2019/RCAK-19V387-3063.pdf\" target=\"_blank\">documentation filed with</a> the National Highway Traffic Safety Administration, General Motors is recalling an estimated 1,159 Chevrolet Express and GMC Savana vans, whose model years range between 2016 and 2019. </p>\n\n\n\n<p>An internal investigation determined that some of these automobiles may have been installed with tempered glass, described as such because they&#8217;re reinforced with heat to strengthen their resilience. </p>\n\n\n\n<p>While tempered glass has more safety properties than standard glass, laminated glass &#8211; the type the vehicles are meant to have &#8211; has an extra layer of vinyl, which enables the glass to hold its shape more effectively in the event of a crash. </p>\n\n\n\n<p>This also helps prevent the potential of ejection from the vehicle should motorists not have their seat belts on during an accident.</p>\n\n\n\n<p>Because the vehicles in question do not comply with <a href=\"https://www.nhtsa.gov/sites/nhtsa.dot.gov/files/tp-226_ejection_v00_march_2011.pdf\">Number 226 of the government&#8217;s Federal Motor Vehicle Safety Standard</a>, which relates to ejection mitigation, GM has decided to pull the 1,150+ vans from the marketplace so that tempered glass can be swapped out with laminated where necessary.</p>\n\n\n\n<h2>Timeline of events</h2>\n\n\n\n<p>The flaw in question <a rel=\"noopener noreferrer\" href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLRPT-19V387-5079.PDF\" target=\"_blank\">came to the attention</a> of General Motors March 18 of this year, when an engineer for the company happened to notice that both a Chevrolet Express and GMC Savana had rear-quarter windows installed with tempered glass instead of the correct&nbsp;laminated&nbsp;type. </p>\n\n\n\n<p>The engineer made the company aware of the flaw through its S<a href=\"https://thenewswheel.com/gms-speak-up-for-safety-program-proves-effective/\" target=\"_blank\" rel=\"noreferrer noopener nofolow\" aria-label=\" (opens in a new tab)\">peak Up For Safety</a>, which was formally launched in 2014 and serves as a &#8220;see something say something&#8221; outlet for GM employees when something is amiss.</p>\n\n\n\n<p>A formal investigation was launched roughly a week after the engineer first spotted the flaw,&nbsp;and&nbsp;concluded May 13. </p>\n\n\n\n<p>GM&#8217;s Field Action Decision Authority determined that, as a result of the findings, some of the cars in question may indeed fail to comply with the ejection mitigation rule established by NHTSA and recommended a recall.</p>\n\n\n\n<h2>The solution</h2>\n\n\n\n<p>Although GM has not yet determined when notifications will be distributed, it intends to inform owners of 2016 &#8211; 2019 Chevrolet Express and GMC Savana to bring their automobiles back to any GM dealer so the proper glass can be installed. The fix will come at no charge to owners. </p>\n\n\n\n<p>To find out if your vehicle is part of this recall, use MotorSafety.org&#8217;s <a href=\"https://www.motorsafety.org/\">free look-up tool</a>.</p>\n\n\n\n<p>The recall number is N192218960.</p>\n<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script>","source":"https://www.motorsafety.org/?p=17003","createdAt":"2019-06-07T07:27:58.000Z","date_gmt":"2019-06-07T21:12:58.000Z","updatedAt":"2020-10-20T04:50:29.000Z","modified_gmt":"2020-10-20T18:35:29.000Z","display_date":"June 07, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V387000","recall_date":"May 23, 2019"},"year":2019,"month":6,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/06/shutterstock_717777751-1-768x514.jpg","alt_text":"","cld_public_id":"shutterstock_717777751-1","category":{"id":12,"name":"Chevrolet","slug":"chevrolet-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/chevy_ms.png"},"tags":[{"id":880,"name":"2016 - 2019 Chevrolet Express","slug":"2016-2019-chevrolet-express"},{"id":881,"name":"2016 - 2019 GMC Savana","slug":"2016-2019-gmc-savana"},{"id":1443,"name":"Chevrolet tempered glass issue","slug":"chevrolet-tempered-glass-issue"},{"id":1441,"name":"GM van recall","slug":"gm-van-recall"},{"id":1442,"name":"GMC tempered glass issue","slug":"gmc-tempered-glass-issue"}],"categories":[{"id":12,"name":"Chevrolet","slug":"chevrolet-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/chevy_ms.png"},{"id":72,"name":"GMC","slug":"gmc-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/gmc_RM.png"}]},{"id":17004,"title":"Ram 1500 Trucks Up For Recall Due To Flawed Driveshafts","link":"https://www.motorsafety.org/ram-1500-trucks-up-for-recall-due-to-flawed-driveshafts/","status":"publish","slug":"ram-1500-trucks-up-for-recall-due-to-flawed-driveshafts","excerpt":"<p>Thousands of Ram 1500 pickup trucks, model years 2018 and 2019, are under recall notice by vehicle manufacturer Fiat Chrysler because the installed rear driveshaft may be compromised.</p>\n","description":"<p>Laguna Hills, CA &#8211; June 7, 2019 &#8211; Thousands of Ram 1500 pickup trucks, model years 2018 and 2019, are under recall notice by Fiat Chrysler because the installed rear driveshaft may be compromised and at risk of fracturing. This could cause the component to physically fall from the vehicle, which trailing motorists could hit, potentially resulting in a crash or injury. The detachment of the driveshaft would also cause the vehicle to lose power, increasing the operator and passengers&#8217; risk for injury as well due to an accident.</p>\n<p>FCA says it will notify owners, starting on June 15, of the potential component failure. Motorists can get their driveshaft replaced free of charge by taking their automobile to any authorized Chrysler dealership.</p>\n<h2>The Defect</h2>\n<p>According to <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLRPT-19V324-5868.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">paperwork filed</a> with the National Highway Traffic Safety Administration, an arm of the Department of Transportation, Fiat Chrysler is recalling 10,160 Ram 1500 pickup trucks, whose model years range between 2018 and 2019. An investigation determined that the vehicle&#8217;s rear driveshaft, a component whose main responsibility is to power the engine through the transmission of torque, may be vulnerable to fracturing due to an improper weld fusion that connects the driveshaft&#8217;s tube and its tube yoke.</p>\n<p>The progressive nature of this cracking could cause the component to break away from the vehicle and fall into the road, becoming a hazard and potential source of an accident for other motorists. It could also cause Ram 1500 operators to lose control of their automobile due to a sudden loss in power, which may also raise the risk of a crash.</p>\n<p>Because the component is underneath the vehicle, it&#8217;s virtually impossible to know whether the part is compromised. However, Fiat Chrysler says that unusual noise or vibrations emanating from beneath the vehicle may presage the fracturing.</p>\n<h2>Timeline of Events</h2>\n<p>The issue came to the attention of Fiat Chrysler&#8217;s vehicle safety and regulatory compliance office in August 2018 when the company received six warranty claims &#8211; all submitted within a month of one another &#8211; each of which complained of broken driveshafts. Days later when the driveshafts were examined, they all had the same issue &#8211; an incomplete weld fusion. No other flaws were found in follow-up inquiries, which concluded in January. Later than month and into February, however, FCA was informed of additional driveshaft failures, which, unlike the original six, occurred at mileages greater than 5,000. A more thorough investigation that transpired in March and April determined that the failures were isolated incidents but that the similar nature of the driveshaft flaws warranted a voluntary recall. FCA says it&#8217;s unaware of any actual accidents or injuries stemming from these incidents.</p>\n<h2>The Solution</h2>\n<p>Although the recall is not mandatory, FCA recommends that operators and owners of 2018-2019 Ram 1500s err on the side of caution and take their vehicles to their nearest Chrysler dealer so a fix can be scheduled. If necessary, the driveshaft will be replaced at no expense for neither parts nor labor. For additional specifics on this recall, contact FCA&#8217;s customer service department at 1-800-853-1403. The recall order is classified as V48. Entering your VIN at <a href=\"https://www.motorsafety.org/\" target=\"_blank\" rel=\"noopener noreferrer\">MotorSafety.org</a> can help as well.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=17004","createdAt":"2019-06-07T07:27:23.000Z","date_gmt":"2019-06-07T21:12:23.000Z","updatedAt":"2020-10-20T04:55:03.000Z","modified_gmt":"2020-10-20T18:40:03.000Z","display_date":"June 07, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V324000","recall_date":"April 25, 2019"},"year":2019,"month":6,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/06/2020-RAM-1500-Rebel-red-768x512.jpg","alt_text":"","cld_public_id":"2020-RAM-1500-Rebel-red","category":{"id":9,"name":"RAM","slug":"ram-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/11/RAM.png"},"tags":[{"id":1444,"name":"2018-2019 RAM 1500 recall","slug":"2018-2019-ram-1500-recall"},{"id":1445,"name":"RAM driveshaft recall","slug":"ram-driveshaft-recall"}],"categories":[{"id":9,"name":"RAM","slug":"ram-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/11/RAM.png"}]},{"id":17017,"title":"Foldaway Seat Recall Expands","link":"https://www.motorsafety.org/foldaway-seat-recall-expands/","status":"publish","slug":"foldaway-seat-recall-expands","excerpt":"<p>New England Wheels is reaching out to owners of certain Ford Transit and Ram Promaster vehicles, informing them of a safety issue for seats that won&#8217;t lock in place.</p>\n","description":"<p>Laguna Hills, CA &#8211; June 6, 2019 &#8211; As part of an ever-expanding recall that centers on rear seat defect in multi-passenger vehicles, New England Wheels is reaching out to owners of certain Ford Transit and Ram Promaster vehicles, due to a foldaway seat that won&#8217;t lock in place. Under normal circumstances, the units allow for greater functionality and freedom of movement for passengers. The problem is that when the flawed ones are under pressure, they seemingly refuse to remain upright. This movement could greatly increase the risk of an injury for the person seated. New England Wheels and the National Highway Traffic Safety Administration urge Ford Transit and Ram Promaster to reach out to the foldaways&#8217;&nbsp;manufacturer, Freedman Seating, so the repairs can be&nbsp;completed&nbsp;for free.</p>\n<h3>The Defect</h3>\n<p>Per&nbsp;<a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCAK-19V333-9806.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">documents filed</a> with the National Highway Traffic Safety Administration, Billerica, Massachusetts-based New England Wheels, a vehicle retrofitting company, seeks to recall a combined 544 Ford Transits (model years 2014-2018) and Ram Promasters (2014-2019), which the company installed with Freedman Go-ES Foldaway Seats. New England Wheels was able to determine the precise total by matching the identification numbers of the affected seats with the same digits found on the units of the vehicles they were installed in.</p>\n<p>The flaw in question is a back frame weldment, which New England Wheels says may be too narrow and subject to malfunction because it can&#8217;t withstand the weight of a person seated or leading on the foldaway seats. The rotating action of the back cushion may exacerbate the deformation of the weldment and fail to fully engage the mechanism that locks when the seat back is repositioned. Evidence of a flawed component is if the locking mechanism doesn&#8217;t make a &#8220;click&#8221; sound when moving the back cushion from folded to upright.</p>\n<p>This is only the latest recall notice involving Freedman Go-ES Foldaway Seats. In May, Waldoch Crafts, Inc. informed NHTSA that&nbsp;<a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCAK-19V252-1423.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">it was recalling 15</a> Ford Transit shuttle vans for the same reason. At the time, though, a remedy had not yet been finalized.</p>\n<h3>Timeline of Events</h3>\n<p>Although the two recalls involving the problematic folding passenger seats were both in 2019, the issue traces back to at least 2018,&nbsp;when&nbsp;NHTSA first&nbsp;issued an <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCRIT-19V313-5347.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">awareness notice</a> at its website. Vehicle customization firms may have been unaware of the recall prior to installing them or purchased the models before the announcement.</p>\n<h3>The Solution</h3>\n<p>The Freedman Seating Company, in conjunction with NHTSA, has agreed to facilitate the inspection and completion of the repairs on flawed GO-ES Foldaway units. If owners decide to take their vehicles elsewhere, the company says it will reimburse them the cost of repairs and labor ($50 value). However, the best move is to go through Freedman directly, as the company says it knows what replacement parts to install to fix the flawed mechanism. The recall began in earnest on May 27. For more information, contact Freedman at 1-800-443-4540, New England Wheels at 1-800-886-9247 or visit <a href=\"https://www.motorsafety.org/\" target=\"_blank\" rel=\"noopener noreferrer\">MotorSafety.org</a>, using the campaign number 19V-333.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=17017","createdAt":"2019-06-06T16:48:58.000Z","date_gmt":"2019-06-07T06:33:58.000Z","updatedAt":"2020-09-28T03:41:45.000Z","modified_gmt":"2020-09-28T17:26:45.000Z","display_date":"June 06, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2019,"month":6,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/06/shutterstock_1613840998-1-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_1613840998-1","category":{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"},"tags":[],"categories":[{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"},{"id":9,"name":"RAM","slug":"ram-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/11/RAM.png"}]},{"id":16998,"title":"Some Volvo S60 owners to receive recall notice in June","link":"https://www.motorsafety.org/some-volvo-s60-owners-to-receive-recall-notice-in-june/","status":"publish","slug":"some-volvo-s60-owners-to-receive-recall-notice-in-june","excerpt":"<p>Volvo is recalling thousands of S60 vehicles due to a rear suspension issue that may cause a crash. </p>\n","description":"<p>Laguna Hills, CA &#8211; June 3, 2019 &#8211; Volvo Car USA is recalling thousands of S60 vehicles due to a rear suspension issue that may present a safety hazard to affected owners while driving, potentially resulting in a crash. The flaw, first recognized in late April and brought to the attention of the National Highway Traffic Safety Administration, is for 2019 model year sedans. Owners will be informed of the issue by direct mail. Those contacted are urged to take their automobiles off the roads for the time being so&nbsp;the vehicles&nbsp;can be serviced by their nearest Volvo dealer. Motorists will not be charged for the fix.</p>\n<h2>The Defect</h2>\n<p>As detailed by the National Highway Traffic Safety Administration, approximately 8,300 S60 Volvos <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCAK-19V327-6891.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">are being recalled</a> due to the revelation that certain bolts and lock nuts, which attach to the rear toe link flange &#8211; a constituent of the suspension system &#8211;&nbsp; may be not be screwed on tightly enough. As a result, the components of the vehicle that assist with steering may malfunction or detach should the bolts be further loosened, increasing the risk of a crash.</p>\n<h2>Timeline of Events</h2>\n<p>The luxury model has been a hot seller for Volvo since it was originally introduced in 2000 and has been through several iterations ever since, now in its third generation as of 2018. S60s are predominantly manufactured at a recently opened assembly plant near Charlestown, South Carolina, which is where the flaw appears to have derived, opening around the same time as the S60&#8217;s redesign.</p>\n<p>Brought to the attention of Volvo, the luxury automaker relayed the assembly oversight to the NHTSA, wherein an investigation launched April 25 on models built at the Berkeley County plant. Investigators determined that 8,266 S60 sedans were likely affected, or <a href=\"https://www.thecarconnection.com/news/1123307_2019-volvo-s60-recalled-over-incorrectly-tightened-suspension-part\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">what amounts to 1%</a> of the total volume either on the roads or dealers&#8217; showroom floors, The Car Connection reported. Most of the S60 Volvos involved in the recall are believed to have originated from the luxury automaker&#8217;s newly opened plant in the Palmetto State.</p>\n<h2>The Solution</h2>\n<p>Starting June 21, owners of the affected S60s can expect to receive a notification either from Volvo or NHTSA pertaining to the flawed suspension system. Drivers can continue to check back at <a href=\"https://www.motorsafety.org/\">MotorSafety.org</a> to see if their vehicle is affected and if the repair is available. This repair will be free of charge.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16998","createdAt":"2019-06-03T05:56:50.000Z","date_gmt":"2019-06-03T19:41:50.000Z","updatedAt":"2020-10-20T04:58:59.000Z","modified_gmt":"2020-10-20T18:43:59.000Z","display_date":"June 03, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V327000","recall_date":"April 25, 2019"},"year":2019,"month":6,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/06/Silver-Volvo-S60-768x512.jpg","alt_text":"Silver Volvo S60","cld_public_id":"Silver-Volvo-S60","category":{"id":19,"name":"Volvo","slug":"volvo-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2021/08/Volvo-logo-2012-2048x2048-1.png"},"tags":[{"id":1446,"name":"2019 Volvo S60 recall","slug":"2019-volvo-s60-recall"},{"id":772,"name":"Volvo suspension recall","slug":"volvo-suspension-recall"}],"categories":[{"id":19,"name":"Volvo","slug":"volvo-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2021/08/Volvo-logo-2012-2048x2048-1.png"}]}]