[{"id":17620,"title":"Three Hybrid Vehicles Listed in Recent BMW Recall","link":"https://www.motorsafety.org/three-hybrid-vehicles-listed-in-recent-bmw-recall/","status":"publish","slug":"three-hybrid-vehicles-listed-in-recent-bmw-recall","excerpt":"<p>Field incidents demonstrating the failure of a specific part on three different BMW hybrid electric vehicles has led to a small but very significant recall from the manufacturer.</p>\n","description":"\n<p><em>Laguna Hills, CA – September 29, 2019</em> – Field incidents demonstrating the failure of a specific part on three different BMW hybrid electric vehicles has led to <a rel=\"noopener noreferrer nofollow\" href=\"https://static.nhtsa.gov/odi/rcl/2019/RCAK-19V599-2104.pdf\">a small but very significant recall from the manufacturer</a>. </p>\n\n\n\n<p>As part of the action, BMW has recalled 139 vehicles due to potentially faulty Electric Motor Electronics (EME) modules, across three different models.</p>\n\n\n\n<p>BMW estimates that roughly 10 percent of those 139 vehicles contain the defect, which has the potential to cause a complete shut-down of high-voltage electric power &#8211; increasing the risk of a crash should the error occur while the vehicle is in motion. </p>\n\n\n\n<p>Owners of the vehicles containing the defect should be notified within the coming weeks, with repairs conducted by dealers afterward.</p>\n\n\n\n<h2><strong>The defect</strong></h2>\n\n\n\n<p>The exact part causing the defect on the vehicles is the EME&#8217;s&nbsp;printed circuit board (PCB), which BMW reported was not produced to proper specifications. </p>\n\n\n\n<p>According to paperwork the manufacturer filed with the National Highway Traffic Safety Administration, &#8220;this [defect] could lead to an increase in transition resistance at certain PCB contact points and cause a loss of electrical contact.&#8221;</p>\n\n\n\n<p>Following this loss of electrical contact, the EME module would shut down high-voltage electrical power on the vehicle, resulting in a loss of propulsion and increasing the risk of a crash.&nbsp;</p>\n\n\n\n<p>The vehicles involved in the recall are the:</p>\n\n\n\n<ul><li>2019 BMW i3 BEV</li><li>2019 BMW i3 REx</li><li>2019 BMW i8</li></ul>\n\n\n\n<p>While there is unfortunately no &#8220;warning&#8221; or other indication presaging the errors caused by the defect, BMW did report that in the event of a shut down of high-voltage electrical power, the affected vehicle would still retain power steering and braking via its 12-volt power.&nbsp;</p>\n\n\n\n<h2><strong>Timeline of events</strong></h2>\n\n\n\n<p>According to the safety recall report that BMW filed with the NHTSA, the manufacturer first became aware of the possibility for the defect via field incident reports from non-U.S. markets involving high-voltage electrical power loss on the&nbsp;i3 and i8&nbsp;vehicles.</p>\n\n\n\n<p>&#8220;Further reviews were conducted, which also involved the EME supplier and sub-supplier,&#8221; the safety recall report stated. </p>\n\n\n\n<p>&#8220;The Tier-1 supplier informed BMW that certain EME modules may not have produced to specifications. The supplier indicated that the EME&#8217;s PCB may not have been produced to specifications on a specific assembly line by the Tier-2 supplier.&#8221;</p>\n\n\n\n<p>By reviewing production records held by the &#8220;Tier-2 supplier&#8221;, BMW identified the production dates of the PCBs which potentially contained the defect. </p>\n\n\n\n<p>Following that, other records were cross-referenced in order to determine the exact vehicles which contain those PCBs (and potentially, the defect along with them).</p>\n\n\n\n<p>BMW <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLRPT-19V599-1806.PDF\" rel=\"noopener noreferrer nofollow\">decided to conduct the recall on August 7, 2019</a>.&nbsp;</p>\n\n\n\n<h2><strong>The solution</strong></h2>\n\n\n\n<p>BMW has indicated that owners of the vehicles involved in the recall will be notified by first class mail no later than October 7, 2019. Owners will be instructed to bring their vehicle to an authorized BMW center to have the EME replaced free.&nbsp;</p>\n\n\n\n<p>For more information on other recalls involving BMW and additional major auto manufacturers, visit <a rel=\"noopener noreferrer\" href=\"http://MotorSafety.org\">MotorSafety.org</a>.&nbsp;</p>\n<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script>","source":"https://www.motorsafety.org/?p=17620","createdAt":"2019-09-30T04:57:22.000Z","date_gmt":"2019-09-30T18:42:22.000Z","updatedAt":"2020-09-16T21:18:12.000Z","modified_gmt":"2020-09-17T11:03:12.000Z","display_date":"September 30, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":"September 29, 2019"},"year":2019,"month":9,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/09/BMW-i8-768x512.jpg","alt_text":"BMW i8 plug-in hybrid sports car.","cld_public_id":"BMW-i8","category":{"id":15,"name":"BMW","slug":"bmw-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/bmw_RM.png"},"tags":[{"id":730,"name":"2019 BMW i3 BEV","slug":"2019-bmw-i3-bev"},{"id":731,"name":"2019 BMW i3 REx","slug":"2019-bmw-i3-rex"},{"id":732,"name":"2019 BMW i8","slug":"2019-bmw-i8"},{"id":729,"name":"BMW Hybrid","slug":"bmw-hybrid"},{"id":669,"name":"BMW recall","slug":"bmw-recall"},{"id":408,"name":"Crash Risk","slug":"crash-risk"},{"id":199,"name":"electric motor","slug":"electric-motor"}],"categories":[{"id":15,"name":"BMW","slug":"bmw-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/bmw_RM.png"}]},{"id":17623,"title":"2020 Legacy and Outback Vehicles Recalled For Brake Pedal Mounting Bracket","link":"https://www.motorsafety.org/2020-legacy-and-outback-vehicles-recalled-for-brake-pedal-mounting-bracket/","status":"publish","slug":"2020-legacy-and-outback-vehicles-recalled-for-brake-pedal-mounting-bracket","excerpt":"<p>Subaru of America has recalled certain 2020 Legacy and Outbacks to inspect and potentially repair brake pedal mounting bracket that may impact brake performance. </p>\n","description":"<p>Laguna Hills, CA – Sep. 29, 2019 – Subaru of America has <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCAK-19V664-5852.pdf\">announced the recall of certain 2020 Legacy and Outback vehicles</a> in order to inspect and potentially repair the brake pedal mounting bracket.</p>\n<p>The brake pedal mounting bracket in the affected vehicles, most of which were produced in August 2019, may not contain all the bolts required to function properly, or may feature a bolt that was insufficiently tightened. As a result, the mounting area for the brake pedal may deform, which could reduce braking performance and thus increase the risk of a crash.</p>\n<h2>The Defect</h2>\n<p>In the Legacy and Outback vehicles involved in the recall, the brake pedal mounting bracket may include an insufficiently tightened or outright missing bolt.</p>\n<p>&#8220;Over time, if a brake pedal mounting bracket has an insufficiently tightened or missing bolt/nit, the brake pedal mounting area may deform,&#8221; stated the safety recall report that Subaru filed with the National Highway Traffic Safety Administration to make a formal note of the issue. &#8220;Deformation of the brake pedal mounting area could reduce braking performance, increasing the risk of the crash.&#8221;</p>\n<p>The recall population includes 2,862 Outback vehicles, and 605 Legacy vehicles, according to the same report. Subaru estimates that one percent of those vehicles contain the defect.</p>\n<h2>Timeline of Events</h2>\n<p>According to the chronology included in Subaru&#8217;s safety recall report, knowledge of the potential for the defect came to light on Aug. 29, 2019, when an associate discovered an insufficiently tightened bolt on a vehicle in the midst of assembly.</p>\n<p>&#8220;Upon closer review, it was observed that certain hardware located on the brake pedal mounting bracket may have been insufficiently tightened or missing,&#8221; according to the report.</p>\n<p>An investigation was opened shortly thereafter, and the condition was quickly traced to a defective bolt feeder, which was removed from the assembly line on Sept. 4. Further investigation allowed Subaru to determine that the flagged hardware may have serviced a number of vehicles that were produced between July 30 and Aug. 29.</p>\n<p>Subaru <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLRPT-19V664-6082.PDF\">decided to conduct the recall on September 11, and informed dealers on September 18</a>.</p>\n<h2>The Solution</h2>\n<p>Dealers have been informed of the defect and a stop order has been placed on all vehicles potentially containing it that have not yet sold. All of those vehicles will be inspected &#8211; and repaired if necessary &#8211; before being made available for sale once again.</p>\n<p>Owners of vehicles involved in the recall will be notified by Subaru no later than Oct. 1, according to the report filed by the automaker with the NHTSA. These customers will be instructed to bring their vehicle to an authorized dealer, who will inspect the brake pedal mounting bracket hardware, and then replace the hardware of the brake pedal assembly if necessary.</p>\n<p>If you own one of the listed vehicles and have further questions, you may contact Subaru&#8217;s customer service line at (844) 373-6614. For information on additional Subaru recalls and other news from the automotive industry, visit <a href=\"http://MotorSafety.org\">MotorSafety.org</a>.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=17623","createdAt":"2019-09-29T10:18:00.000Z","date_gmt":"2019-09-30T00:03:00.000Z","updatedAt":"2020-10-16T01:15:03.000Z","modified_gmt":"2020-10-16T15:00:03.000Z","display_date":"September 29, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V664000","recall_date":"September 18, 2019"},"year":2019,"month":9,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/09/shutterstock_176405168-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_176405168","category":{"id":24,"name":"Subaru","slug":"subaru-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/subaru_ms.png"},"tags":[{"id":1331,"name":"2020 Subaru Legacy recall","slug":"2020-subaru-legacy-recall"},{"id":1332,"name":"2020 Subaru Outback recall","slug":"2020-subaru-outback-recall"},{"id":1333,"name":"Subaru break pedal issue","slug":"subaru-break-pedal-issue"}],"categories":[{"id":24,"name":"Subaru","slug":"subaru-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/subaru_ms.png"}]},{"id":17613,"title":"BMW Recalls Two M340i Vehicles Due to Rear Center Headrest Defect","link":"https://www.motorsafety.org/bmw-recalls-two-m340i-vehicles-due-to-rear-center-headrest-defect/","status":"publish","slug":"bmw-recalls-two-m340i-vehicles-due-to-rear-center-headrest-defect","excerpt":"<p>BMW has announced the recall of two vehicles, one 2020 M340i and one M340i xDrive, due to a rear center headrest which may fold improperly in the event of a rear impact crash.</p>\n","description":"\n<p><em>Laguna Hills, CA – September 26, 2019</em> – BMW has <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCAK-19V600-3256.pdf\">announced the recall of two vehicles</a>, one 2020 M340i and one M340i xDrive, due to a rear center headrest that may fold improperly in the event of a rear-impact crash. </p>\n\n\n\n<p>If the headrest were to fold down in such a setting, the risk of injury to the occupant would dramatically increase.</p>\n\n\n\n<h2><strong>The defect</strong></h2>\n\n\n\n<p>During production of both vehicles listed for the recall, the head restraint interlock was not welded sufficiently to the head restraint support rod bracket, according to paperwork filed by BMW with the National Highway Traffic Safety Administration.</p>\n\n\n\n<p>As of September 26, manufacturer has not received any reports, nor is it otherwise aware, of any accidents or injuries caused by the defect. </p>\n\n\n\n<p>However, the improper production could lead to a break of the weld in the event of a collision, which in turn increases the risk of injury for the occupant in the rear center seat.</p>\n\n\n\n<h2><strong>Timeline of events</strong></h2>\n\n\n\n<p>On July 29, BMW first became aware of an instance where a foldable rear center head restraint did not function as intended via an internal rear crash validation test. Further analysis ascribed the defect in that case to a broken weld of the interlock on the head restraint frame.&nbsp;</p>\n\n\n\n<p>&#8220;A check of other parts was initiated,&#8221; <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLRPT-19V600-6727.PDF\">according to the chronology that BMW filed with the NHTSA</a>, &#8220;and two additional suspect head restraints were found.&#8221;</p>\n\n\n\n<p>The vehicles included in the recall were produced between July 4 and July 31. BMW reviewed vehicle assembly information and supplier production records in order to determine the specific vehicles that carry the defect. </p>\n\n\n\n<p>Their investigation resulted in the identification of two specific vehicles in which the head restraint interlock was not properly welded.</p>\n\n\n\n<p>On August 7, BMW decided to conduct a voluntary recall on the two vehicles suspected to carry the defect. The manufacturer&#8217;s paperwork notes that dealers were notified August 14, and that notification to owners &#8220;is expected to begin and end on October 7, 2019.&#8221;</p>\n\n\n\n<h2><strong>The solution</strong></h2>\n\n\n\n<p>BMW plans to notify the owners or dealers currently in possession of the two automobiles, at which point local dealers will replace the rear center headrests of the vehicles on the manufacturer&#8217;s behalf.</p>\n\n\n\n<p>For more information on other BMW recalls, be sure to visit <a href=\"http://MotorSafety.org\">MotorSafety.org</a>.</p>\n<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script>","source":"https://www.motorsafety.org/?p=17613","createdAt":"2019-09-27T01:56:11.000Z","date_gmt":"2019-09-27T15:41:11.000Z","updatedAt":"2020-09-16T21:31:24.000Z","modified_gmt":"2020-09-17T11:16:24.000Z","display_date":"September 27, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":"September 26, 2019"},"year":2019,"month":9,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/09/BMW-M340i-768x512.jpg","alt_text":"Blue BMW M340i xDrive.","cld_public_id":"BMW-M340i","category":{"id":15,"name":"BMW","slug":"bmw-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/bmw_RM.png"},"tags":[{"id":733,"name":"2020 BMW M340i","slug":"2020-bmw-m340i"},{"id":734,"name":"2020 BMW M340i xDrive","slug":"2020-bmw-m340i-xdrive"},{"id":669,"name":"BMW recall","slug":"bmw-recall"},{"id":197,"name":"headrest","slug":"headrest"},{"id":735,"name":"rear impact crash","slug":"rear-impact-crash"}],"categories":[{"id":15,"name":"BMW","slug":"bmw-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/bmw_RM.png"}]},{"id":17614,"title":"Some 2020 Jeep Gladiator Trucks Recalled For Rear Driveshafts","link":"https://www.motorsafety.org/some-2020-jeep-gladiator-trucks-recalled-for-rear-driveshafts/","status":"publish","slug":"some-2020-jeep-gladiator-trucks-recalled-for-rear-driveshafts","excerpt":"<p>Chrysler has announced the recall of more than 3,400 2020 Jeep Gladiator vehicles outfitted with rear driveshafts that may have been incorrectly assembled.</p>\n","description":"<p>Laguna Hills, CA – Sept. 26, 2019 – Fiat Chrysler Automobiles has announced the recall of certain 2020 Jeep Gladiator vehicles that were outfitted with rear driveshafts that may have been incorrectly assembled. The manufacturer estimates that 3,427 vehicles will be affected by the recall, and that roughly 5 percent among that number contain the defect.</p>\n<h2>The Defect</h2>\n<p>The defect relates to the monoblock joint, which is a constant velocity joint within the center of the driveshaft.</p>\n<p>Chrysler&#8217;s depiction of the defect, which they included with paperwork filed to the National Highway Traffic Safety Administration, stated: &#8220;Certain 2020 MY Jeep Gladiator vehicles built from December 15, 2018 through June 25, 2019 may have a rear driveshaft that was assembled without grease in the monoblock joint portion of the driveshaft.&#8221;</p>\n<p>Due to the lack of grease, the driveshaft may fracture, which could cause a sudden loss of driving power if the vehicle is in rear-wheel drive mode. Additionally, the driveshaft itself could separate completely from the vehicle and then become a road hazard. To rectify both safety risks, as well as others that may come as a result of the faulty driveshaft, Chrysler has enacted a recall on vehicles that may contain the defect.</p>\n<p>Chrysler notes that in vehicles which contain the defect, if the part were to fail as a result, occupants may experience a noise or vibration prior to the driveshaft fracturing.</p>\n<h2>Timeline of Events</h2>\n<p><a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLRPT-19V636-4318.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">According to the paperwork filed with the NHTSA</a>, Chrysler first became aware of the potential for the defect in June 2019, when it received four rear driveshafts from warranty repairs that had initially been assembled without grease in the monoblock joint. It was determined that the cause of the defect was that the grease bypass button had been activated at the assembly line station while the given parts were being manufactured.</p>\n<p>Based on those cases, Chrysler opened an investigation into the matter, and eventually identified additional examples of the defect, including four additional warranty claims (although the company found no field reports, accidents, or injuries relating to the defect). On Aug. 22, 2019, Chrysler determined, in collaboration with the Vehicle Regulations Committee, to conduct a recall of the Jeep Gladiator vehicles that may potentially lack grease in the monoblock joint portion of the rear driveshaft.</p>\n<p>&#8220;The suspect population was determined by reviewing the supplier&#8217;s driveshaft production records from the beginning of production of this driveshaft to identify which driveshafts may have been assembled without grease,&#8221; according to Chrysler&#8217;s records. &#8220;Driveshaft traceability records were then linked to vehicle production records to determine the suspect vehicle population.&#8221;</p>\n<h2>The Solution</h2>\n<p>Chrysler will begin notifying both dealers and owners of vehicles which may contain the defect on Oct. 18. Dealers will inspect the vehicles, and verify that the driveshaft contains grease in the monoblock joint. If not, the driveshaft will be replaced free of charge. Sales of vehicles which may contain the defect <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCMN-19V636-3021.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">have been stopped until this repair has been made</a>.</p>\n<p>For more information on Chrysler recalls, and other news involving major automobile manufacturers, visit <a href=\"http://MotorSafety.org\">MotorSafety.org</a>.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=17614","createdAt":"2019-09-27T01:53:42.000Z","date_gmt":"2019-09-27T15:38:42.000Z","updatedAt":"2020-10-16T01:19:53.000Z","modified_gmt":"2020-10-16T15:04:53.000Z","display_date":"September 27, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V636000","recall_date":"August 29, 2019"},"year":2019,"month":9,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/09/shutterstock_1608454939-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_1608454939","category":{"id":33,"name":"Jeep","slug":"jeep-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/jeep_ms.png"},"tags":[{"id":982,"name":"2020 Jeep Gladiator recall","slug":"2020-jeep-gladiator-recall"},{"id":1334,"name":"Jeep driveshaft recall","slug":"jeep-driveshaft-recall"}],"categories":[{"id":33,"name":"Jeep","slug":"jeep-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/jeep_ms.png"}]},{"id":17612,"title":"Chrysler Recalls Ram Trucks with Faulty Tailgate Locks","link":"https://www.motorsafety.org/chrysler-recalls-ram-trucks-with-faulty-tailgate-locks/","status":"publish","slug":"chrysler-recalls-ram-trucks-with-faulty-tailgate-locks","excerpt":"<p>Fiat Chrysler Automobiles has announced the recall of a wide range of Ram trucks equipped with an 8 foot bed and a power locking tailgate.</p>\n","description":"<p>Laguna Hills, CA – Sept. 25, 2019 – Fiat Chrysler Automobiles has announced the recall of a wide range of Ram trucks equipped with an 8-foot bed and a power-locking tailgate, due to the possibility that the tailgate actuator limiter tab may fracture and cause the tailgate to unlock and open while the vehicle is in motion.</p>\n<p>While the defect is contained in certain Ram trucks made across roughly five years, <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLRPT-19V347-4741.PDF\">not all vehicles manufactured during that period of time have been included in the recall</a>, so vehicle owners should be sure to check whether or not their truck requires the remedy.</p>\n<h2>The Defect</h2>\n<p>Chrysler&#8217;s description of the defect explains that the tailgate actuator limiter tab located within the power-lock actuator control assembly &#8220;may fracture, allowing the lock rod control bracket to over-travel which may pull the lock rods and release the latches, potentially resulting in the tailgate inadvertently falling open at any time.&#8221;</p>\n<p>The list of vehicles that may contain the defect has been expanded multiple times since the recall was first announced. As of Sept. 25, the makes and models of vehicles that could be affected are as follows:</p>\n<ul>\n<li>2013-2018 Ram 1500</li>\n<li>2013-2018 Ram 2500</li>\n<li>2013-2018 Ram 3500</li>\n</ul>\n<p>&#8220;An unintended opening of the tailgate while driving may result in a loss of unrestrained cargo from the truck bed while driving,&#8221; stated Chrysler&#8217;s safety recall report, which describes the safety risk caused by the defect. &#8220;Lost cargo may create a road hazard to operators and occupants of other vehicles, and can cause such vehicles to crash without prior warning.&#8221;</p>\n<h2>Timeline of Events</h2>\n<p>On July 19, 2018, the manufacturer first announced that it would conduct a voluntary safety recall on Ram pickup trucks. At that point ,the recall applied to &#8220;certain 2015-2017 MY Ram pickup trucks equipped with a power-locking tailgate, excluding vehicles with an 8-foot truck bed.&#8221; On May 2, 2019, the recall was expanded to include 2015-2017 Ram trucks with an 8 foot truck bed, as well as 2018 Ram trucks equipped with a power locking tailgate that were built prior to April 1 of that year.</p>\n<p>In August 2019, Chrysler identified 54 warranty claims and repair orders that were potentially related to the defect despite having been generated in relation to vehicles not included in the ongoing recall. Following that discovery, on August 22, <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RMISC-19V347-7699.pdf\">Chrysler expanded the recall to include the full list of vehicles seen above</a>.</p>\n<h2>The Solution</h2>\n<p>Owners of vehicles listed in the initial recall should have already been notified of the defect by Chrysler earlier this year. However, that was before the range of the recall had been expanded. Owners of Ram vehicles that are now being recalled under the expanded action, as well as dealers, will be notified sometime around Oct. 18, 2019. Those with further questions, or who are looking to find out whether or not their Ram vehicle has been included in the recall, may contact the manufacturer&#8217;s customer service line at 800-853-1403.</p>\n<p>Once truck owners have been notified that their vehicle has been included in the recall, they are instructed to bring their vehicle to a dealer, who will limit the locking actuator travel. The manufacturer is covering all costs incurred by the repair.</p>\n<p>For more information on Chrysler recalls and other news from the automotive industry, visit <a href=\"http://MotorSafety.org\">MotorSafety.org</a>.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=17612","createdAt":"2019-09-27T01:33:19.000Z","date_gmt":"2019-09-27T15:18:19.000Z","updatedAt":"2020-10-16T01:28:06.000Z","modified_gmt":"2020-10-16T15:13:06.000Z","display_date":"September 27, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V347000","recall_date":"May 9, 2019"},"year":2019,"month":9,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/09/shutterstock_1342184327-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_1342184327","category":{"id":9,"name":"RAM","slug":"ram-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/11/RAM.png"},"tags":[{"id":1335,"name":"2013-2018 RAM 1500 recall","slug":"2013-2018-ram-1500-recall"},{"id":1337,"name":"2013-2018 RAM 3500 recall","slug":"2013-2018-ram-3500-recall"},{"id":1336,"name":"2103-2018 RSM 2500 recall","slug":"2103-2018-rsm-2500-recall"},{"id":1339,"name":"RAM power tailgate recall","slug":"ram-power-tailgate-recall"},{"id":1338,"name":"RAM tailgate","slug":"ram-tailgate"}],"categories":[{"id":9,"name":"RAM","slug":"ram-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/11/RAM.png"}]},{"id":17606,"title":"Improper Programming on Rear Camera Necessitates Large Nissan Recall","link":"https://www.motorsafety.org/improper-programming-on-rear-camera-necessitates-large-nissan-recall/","status":"publish","slug":"improper-programming-on-rear-camera-necessitates-large-nissan-recall","excerpt":"<p>Improper programming which potentially affects the back-up camera display included with various 2018-2019 Nissan vehicles has led the manufacturer to announce a recall applying to more than 1,200,000 automobiles.</p>\n","description":"<p>Laguna Hills, CA – Sep. 25, 2019 – Improper programming that potentially affects the back-up camera display included with various 2018-2019 Nissan vehicles has caused the manufacturer <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLRPT-19V654-5587.PDF\">to announce a recall applying to more than 1,200,000 automobiles</a>.</p>\n<p>On the vehicles being recalled, adjustments made by the driver to the rear camera display settings will be retained at the start of the next backing event—meaning the image seen on the vehicle&#8217;s display while backing up will not necessarily represent the default camera perspective. This is not compliant with current federal regulations, necessitating the Nissan recall.</p>\n<h2>The Defect</h2>\n<p>The cause for this recall is perhaps better described as a matter of &#8220;non-compliance&#8221; than as a defect. According to Federal Motor Vehicle Safety Standard No. 111, the rear visibility system of vehicles manufactured on or after May 1, 2018 must return to a default image at the beginning of each backing event, regardless of whatever modifications were selected during prior trips. If the camera is not in the default position at the beginning of each new backing event, then the possibility of collision or accident increases.</p>\n<p>On a large number of 2018-2019 Nissan vehicles, the rear camera image does not return to the default position at the start of each backing event, but instead retains any modifications previously selected by the driver. This vehicles are not in compliance with the FMVSS standard, and as a result have to be recalled. The full list of automobiles that are subject to the recall are as follows:</p>\n<ul>\n<li>2018-2019 Infiniti Q50</li>\n<li>2018-2019 Infiniti Q60</li>\n<li>2018-2019 Infiniti Q70</li>\n<li>2018-2019 Infiniti QX30</li>\n<li>2018-2019 Infiniti QX50</li>\n<li>2018-2019 Infiniti QX60</li>\n<li>2018-2019 Infiniti QX80</li>\n<li>2018-2019 Nissan Altima</li>\n<li>2018-2019 Nissan Armada</li>\n<li>2018-2019 Nissan Frontier</li>\n<li>2018-2019 Nissan GT-R</li>\n<li>2018-2019 Nissan Kicks</li>\n<li>2018-2019 Nissan LEAF</li>\n<li>2018-2019 Nissan Maxima</li>\n<li>2018-2019 Nissan Murano</li>\n<li>2018-2019 Nissan NV</li>\n<li>2018-2019 Nissan NV200</li>\n<li>2018-2019 Nissan Pathfinder</li>\n<li>2018-2019 Nissan Rogue</li>\n<li>2018-2019 Nissan Rogue Sport</li>\n<li>2018-2019 Nissan Sentra</li>\n<li>2018-2019 Nissan Taxi</li>\n<li>2018-2019 Nissan Titan</li>\n<li>2018-2019 Nissan Titan Diesel</li>\n<li>2018-2019 Nissan Versa Note</li>\n<li>2018-2019 Nissan Versa Sedan</li>\n</ul>\n<p>Documents filed to the National Highway Traffic Safety Administration by Nissan explain: &#8220;The original adjustment settings that were applied to the rear visibility system and are subject to the non-compliance are not used on any other Nissan or Infiniti vehicles [other than those listed above] &#8230; Therefore, no other Nissan or Infiniti vehicles are affected by this condition.&#8221;</p>\n<h2>Timeline of Events</h2>\n<p>Nissan transmitted a non-compliance information report describing the error on September 12, 2019. They estimate that the mistake applies to a total of 1.23 million model year 2018-2019 Nissan and Infiniti vehicles in total, and that all of those vehicles without exception &#8220;contain the noncompliance.&#8221;</p>\n<p>On September 20, 2019, Nissan submitted a safety recall report pertaining to the issue, and clarified the schedule by which vehicle owners will be notified of the defect: Depending on the make and model of their vehicles, <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RMISC-19V654-4027.pdf\">customers will be notified either on the week of October 21 or the week of November 4</a>. All Vehicle Identification Numbers on the affected automobiles will be active at the time of the phased dealer notification, according to Nissan, which is scheduled to begin on October 7 and to conclude either on or before November 11.</p>\n<h2>Solution</h2>\n<p>Owners of the vehicles containing the noncompliance will be notified sometime in the range of the dates listed above. At that point, they may bring their vehicle to a local dealer, who will reprogram the rear visibility system software at no cost.</p>\n<p>The reprogramming will bring the vehicle into compliance by limiting the adjustments that can be made to the camera display to an extent that ensures the view always remains within the range dictated dictated by FMVSS No. 111.</p>\n<p>For more information on recalls announced by Nissan or other major automobile manufacturers, continue visiting <a href=\"http://MotorSafety.org\">MotorSafety.org</a>.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=17606","createdAt":"2019-09-25T01:32:27.000Z","date_gmt":"2019-09-25T15:17:27.000Z","updatedAt":"2020-10-16T02:05:08.000Z","modified_gmt":"2020-10-16T15:50:08.000Z","display_date":"September 25, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V654000","recall_date":"September 12, 2019"},"year":2019,"month":9,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/09/shutterstock_597656990-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_597656990","category":{"id":40,"name":"Infiniti","slug":"infiniti","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/infiniti_RM.png"},"tags":[{"id":1340,"name":"2018-2019 Infiniti Q50 recall","slug":"2018-2019-infiniti-q50-recall"},{"id":1341,"name":"2018-2019 Infiniti Q60 recall","slug":"2018-2019-infiniti-q60-recall"},{"id":1342,"name":"2018-2019 Infiniti Q70 recall","slug":"2018-2019-infiniti-q70-recall"},{"id":1343,"name":"2018-2019 Infiniti QX30 recall","slug":"2018-2019-infiniti-qx30-recall"},{"id":1344,"name":"2018-2019 Infiniti QX50 recall","slug":"2018-2019-infiniti-qx50-recall"},{"id":1345,"name":"2018-2019 Infiniti QX60 recall","slug":"2018-2019-infiniti-qx60-recall"},{"id":1346,"name":"2018-2019 Infiniti QX80 recall","slug":"2018-2019-infiniti-qx80-recall"},{"id":1347,"name":"2018-2019 Nissan Altima recall","slug":"2018-2019-nissan-altima-recall"},{"id":1348,"name":"2018-2019 Nissan Armada recall","slug":"2018-2019-nissan-armada-recall"},{"id":1349,"name":"2018-2019 Nissan Frontier recall","slug":"2018-2019-nissan-frontier-recall"}],"categories":[{"id":40,"name":"Infiniti","slug":"infiniti","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/infiniti_RM.png"},{"id":14,"name":"Nissan","slug":"nissan-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/nissan_RM.png"}]},{"id":17604,"title":"GM Expands Prior Recall on Chevrolet Trax Vehicles","link":"https://www.motorsafety.org/gm-expands-prior-recall-on-chevrolet-trax-vehicles/","status":"publish","slug":"gm-expands-prior-recall-on-chevrolet-trax-vehicles","excerpt":"<p>Upon further review, GM has decided to expand the scope of a prior control arm recall, which now applies to include even more Chevrolet Trax vehicles.</p>\n","description":"\n<p><em>Laguna Hills, CA – September 23, 2019</em> – In April of this year, <a href=\"https://www.cnet.com/roadshow/news/chevy-trax-recall-lower-control-arm-separation/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\" aria-label=\" (opens in a new tab)\">General Motors announced a recall on certain 2017 &#8211; 2019 Chevrolet Trax vehicles</a>, due to the possibility that a joint in one or both of the front lower-control arms had been welded in an improper position. </p>\n\n\n\n<p>GM recently decided to expand the scope of that recall, as a result of further investigations, so that it now applies to include other&nbsp;Chevrolet&nbsp;Trax vehicles that were built in the period between July 1, 2015 and June 30, 2017.</p>\n\n\n\n<p>At the request of the National Highway Traffic Safety Administration, GM is handling the recall as a new field action. However, in practical terms, it counts as a &#8220;population extension&#8221;— the <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLRPT-19V652-4781.PDF\">defect remains the same as the one listed in the prior recall</a>, with no significant differences.</p>\n\n\n\n<h2>The defect</h2>\n\n\n\n<p>The defect is now known to exist in certain 2015 &#8211; 2018 model year Chevrolet Trax vehicles. GM estimates that 93,639 such vehicles have the potential to contain the defect, and that roughly 50 percent among that number do indeed contain it. </p>\n\n\n\n<p>&#8220;In some of these vehicles, a joint in one or both front lower-control arms may have been improperly welded,&#8221; state details in documents filed by GM with the NHTSA. </p>\n\n\n\n<p>&#8220;Over time and in rare cases, an improperly welded joint can fatigue and break, causing the lower-control arm to partially separate from the vehicle&#8221;.</p>\n\n\n\n<p>If the lower-control arm does separate&nbsp;from the vehicle, then the front wheel attached to the arm will toe outward, adversely affecting steering and increasing the possibility of a crash.</p>\n\n\n\n<p>According to the GM documents, the defect was caused because &#8220;the component surfacer that is welded to the bushing housing did not conform to applicable design specifications, and as a consequence, was not properly welded to the bushing housing.&#8221;</p>\n\n\n\n<p>The manufacturer is not yet aware of any vehicle crashes that are attributable to the defect, but notes that if the lower-control arm were to partially separate, the driver may hear a loud noise, and feel the tire begin to rub against the wheel well.</p>\n\n\n\n<h2>Timeline of events</h2>\n\n\n\n<p>The initial recall, which applied to certain 2017 &#8211; 2019 model year Chevrolet Trax vehicles, <a href=\"https://www.motorsafety.org/gm-recalls-2017-19-chevrolet-trax-vehicles-for-steering-issues/\">was announced in April 2019</a>. At the time of that recall, GM was not aware of any claims relating to the defect in question within vehicles built prior to July 2017.</p>\n\n\n\n<p>However, in September 2019, GM&#8217;s Safety and Field Action Decision Authority reviewed an analysis of field claims generated following the April recall, which found instances of the defect (some confirmed and some unconfirmed) in vehicles built as early as July 2015. </p>\n\n\n\n<p>Based on that data, the decision was made to create a new recall that applies to a larger range of Chevrolet Trax vehicles.&nbsp;</p>\n\n\n\n<h2>The solution</h2>\n\n\n\n<p>The repair for the defect is currently available, and will be done at no cost to the customer. Customers who own a vehicle potentially containing the defect will be notified by mail by GM. Dealers will inspect the left and right front lower-control arms, and, if necessary, replace them free of charge.</p>\n\n\n\n<p>GM notes that they corrected the potential for the defect by implementing new actions at their supplier in April 2019, such as amending the specifications for the welding, and introducing standardized inspections before and after the weld operation.</p>\n\n\n\n<p>To find out if your vehicle is part of this recall, MotorSafety.org&#8217;s <a href=\"https://www.motorsafety.org/\">free look-up tool</a>.</p>\n<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script>","source":"https://www.motorsafety.org/?p=17604","createdAt":"2019-09-23T09:08:13.000Z","date_gmt":"2019-09-23T22:53:13.000Z","updatedAt":"2020-10-16T02:09:38.000Z","modified_gmt":"2020-10-16T15:54:38.000Z","display_date":"September 23, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V652000","recall_date":"September 12, 2019"},"year":2019,"month":9,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/09/Blue-2017-Chezy-Trax-768x512.jpg","alt_text":"Blue 2017 Chevy Trax blue on","cld_public_id":"Blue-2017-Chezy-Trax","category":{"id":12,"name":"Chevrolet","slug":"chevrolet-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/chevy_ms.png"},"tags":[{"id":869,"name":"2015 - 2018 Chevrolet Trax Recall","slug":"2015-2018-chevrolet-trax-recall"},{"id":1366,"name":"Chevrolet lower control arms","slug":"chevrolet-lower-control-arms"},{"id":1367,"name":"Chevrolet steering issue","slug":"chevrolet-steering-issue"}],"categories":[{"id":12,"name":"Chevrolet","slug":"chevrolet-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/chevy_ms.png"}]},{"id":17598,"title":"Possibility of Fuel Leak Causes Volkswagen to Recall Six 2019 Atlas Vehicles","link":"https://www.motorsafety.org/possibility-of-fuel-leak-causes-volkswagen-to-recall-six-2019-atlas-vehicles/","status":"publish","slug":"possibility-of-fuel-leak-causes-volkswagen-to-recall-six-2019-atlas-vehicles","excerpt":"<p>An error regarding the fuel jet has caused Volkswagen to announce a recall on six 2019 Atlas vehicles, a small but consequential task.</p>\n","description":"<p>Laguna Hills, CA – Sep. 20, 2019 – Volkswagen has announced that there may have been a defect in the construction of the fuel tank on five or six 2019 Atlas vehicles, leading to a small but extremely consequential vehicle recall. On these particular automobiles, it&#8217;s possible that the suction jet in the fuel tank may have been welded in an incorrect position, which could potentially allow fuel to leak from the tank.</p>\n<p>On a vehicle containing the defect, this is likely to cause momentum to stall as a result of uneven fuel distribution, which creates the possibility for collision. However, there are of course even more dangerous risks that come along with the defect, including the possibility of an ignition source reaching the leaked fuel and causing a fire.</p>\n<h2>The Defect</h2>\n<p>According to <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLRPT-19V614-7925.PDF\">paperwork filed with the National Highway Traffic Safety Administration by Volkswagen</a>, fuel tanks manufactured for the Atlas during a limited time frame may have been incorrectly welded, causing the suction jet bracket to border against the fuel tank internal wall. This error was caused during initial production of the part by the supplier, YAPP, due to &#8220;Incorrectly performed maintenance [of] the supplier&#8217;s tooling,&#8221; and was rectified shortly thereafter.</p>\n<p>As a result of this defect, the suction jet in the fuel tank may not be located where it should be, which has the potential to cause a fuel tank leak. This significantly increases the possibility of the vehicle being involved in a crash or catching fire. Drivers of the 2019 Atlas vehicle will want to keep watch for the odor of fuel, and the sight of fuel puddles underneath the automobile.</p>\n<h2>Timeline of Events</h2>\n<p>The supplier first noted the potential for the defect in late July 2019, according to the report filed by Volkswagen. Following an investigation to determine how many fuel tanks were affected, every tank that potentially contained the defect was quarantined by both YAPP and Volkswagen. Using video of the production of the tanks, YAPP and Volkswagen are able to pinpoint exactly which objects were affected, at which point the manufacturer was able to issue a stop order for shipment and sales of all Atlas vehicles that might contain the defect.</p>\n<p>However on July 31, Volkswagen was able to determine that five Atlas vehicles which potentially contain the defect had been sent to dealers, although at that point all five remained unsold. Following further video review on August 1, YAPP determines that at least one of the five vehicles contains the defect, with the others potentially containing it as well. At that point, Volkswagen&#8217;s Product Safety Committee was presented with the topic, and determined that a recall was necessary.</p>\n<h2>The Solution</h2>\n<p>Volkswagen plans to notify both dealers and owners of the affected Atlas vehicles of the recall either on or before Oct. 11, 2019. At that point, the fuel tank on the affected vehicles will be replaced by the manufacturer at no cost to owners. Additionally, measures have been taken by YAPP to ensure that any fuel tanks with improper welding will not make it past the factory.</p>\n<p>For more information on automobile recalls, whether large or small in number, be sure to continue visiting <a href=\"https://www.motorsafety.org\">MotorSafety.org</a>.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=17598","createdAt":"2019-09-20T10:46:31.000Z","date_gmt":"2019-09-21T00:31:31.000Z","updatedAt":"2020-10-16T02:13:10.000Z","modified_gmt":"2020-10-16T15:58:10.000Z","display_date":"September 20, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V614000","recall_date":"August 21, 2019"},"year":2019,"month":9,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/09/shutterstock_1571002027-768x513.jpg","alt_text":"","cld_public_id":"shutterstock_1571002027","category":{"id":6,"name":"Volkswagen","slug":"volkswagen-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/volkswagen.png"},"tags":[{"id":1368,"name":"2019 Volkswagen Atlas recall","slug":"2019-volkswagen-atlas-recall"},{"id":1369,"name":"Volkswagen Atlas fuel leak","slug":"volkswagen-atlas-fuel-leak"}],"categories":[{"id":6,"name":"Volkswagen","slug":"volkswagen-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/volkswagen.png"}]},{"id":17597,"title":"Issues with Engine Control Modules Leads GM to Announce Malibu Recall","link":"https://www.motorsafety.org/issues-with-engine-control-modules-leads-gm-to-announce-malibu-recall/","status":"publish","slug":"issues-with-engine-control-modules-leads-gm-to-announce-malibu-recall","excerpt":"<p>Complications with some 1.5L turbo engines has caused the fuel injectors on some 2018 Chevrolet Malibu vehicles to become disabled, leading the car manufacturer to announce a recall for that particular make and model.</p>\n","description":"\n<p><em>Laguna Hills, CA – September 19, 2019</em> – Complications with 1.5L turbo engines has caused the fuel injectors on some 2018 Chevrolet Malibu vehicles to become disabled, leading the car manufacturer to announce a recall for that particular make and model. </p>\n\n\n\n<p>Because of the issues, the car engine may be prevented from starting, or drivers could experience stalls, therefore increasing the possibility of collision. </p>\n\n\n\n<p>Unfortunately, the updated software designed to fix the defect has not yet been completed—but once it is available, dealers will reprogram the engine control module (ECM) on affected vehicles to prevent the error from occurring. </p>\n\n\n\n<h2>The defect</h2>\n\n\n\n<p>According to documents filed by General Motors, the <a href=\"https://www.cnet.com/roadshow/news/2018-chevy-malibu-recall-software-ecm-fuel-injector/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\" aria-label=\" (opens in a new tab)\">defect applying to the 1.5L turbo engines could potentially affect more than 175,000 vehicles</a>, with the manufacturer estimating that roughly 1 percent of those automobiles contain the defect.</p>\n\n\n\n<p>&#8220;Under certain conditions, an error in the vehicles&#8217; ECM&nbsp;software can cause data used by the ECM to become corrupted,&#8221; stated the description of the defect in GM&#8217;s safety recall paperwork, &#8220;When this occurs, the ECM may send a signal disabling the engine&#8217;s fuel injectors. </p>\n\n\n\n<p>If the fuel injectors are disabled, the engine may not start and, in rare cases, the engine may stall after it is started.&#8221; This means the vehicle may stall at speed, which would significantly increase the possibility of collision. </p>\n\n\n\n<p>However, other makes and models of the Malibu should not contain the defect, as they run off different ECM software.</p>\n\n\n\n<p>Finally, to aid drivers in taking necessary precautions, GM has advised that vehicles with this defect may see their check-engine light illuminate if the error arises.</p>\n\n\n\n<h2>Timeline of events</h2>\n\n\n\n<p>GM informed the National Highway Traffic Safety Administration of the vehicle recall in a <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCAK-19V642-6437.pdf\">letter dated September 10, 2019</a>. </p>\n\n\n\n<p>According to that letter and other documents regarding the defect, GM first became aware of the error in May 2019, when it came to the company&#8217;s attention as a result of higher-than-usual warranty rates for ECM replacements in 2018 Malibu vehicles. </p>\n\n\n\n<p>The warranty claims illustrated to GM the risks associated with the defect —that engines may fail to start in the first place, or, more dangerously, may stall while the vehicle is moving at speed.</p>\n\n\n\n<p>In collaboration with the supplier of the ECMs, Continental Automotive Systems, the manufacturer discovered notable differences between the software used in 2018 and 2019 models of the vehicle, and soon afterwards discovered a defect in the 2018 software which has the potential to disable the engine&#8217;s fuel injectors.&nbsp;</p>\n\n\n\n<h2>The solution</h2>\n\n\n\n<p>The software update that corrects the ECM issue will be done by dealers at no charge to owners of the automobile. However, that software update is not yet complete, meaning the recall notices will have to wait until the fix is completely prepared. </p>\n\n\n\n<p>The bulletin will only be posted once the software update has been completed, at which point drivers who own the vehicle will be able to bring it to their local dealership for the aforementioned fix.</p>\n\n\n\n<p>Also, vehicle owners directly affected by the recall will be notified by mail. Dealers themselves were notified of the problem in early September, and more information is sure to follow in the coming weeks and months. </p>\n\n\n\n<p>To find out if your vehicle is part of this recall, use MotorSafety.org&#8217;s <a href=\"https://www.motorsafety.org/\">free look-up tool</a>.</p>\n<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script>","source":"https://www.motorsafety.org/?p=17597","createdAt":"2019-09-19T10:41:59.000Z","date_gmt":"2019-09-20T00:26:59.000Z","updatedAt":"2020-10-16T02:17:22.000Z","modified_gmt":"2020-10-16T16:02:22.000Z","display_date":"September 19, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V642000","recall_date":"September 6, 2019"},"year":2019,"month":9,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/09/shutterstock_1096350842-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_1096350842","category":{"id":12,"name":"Chevrolet","slug":"chevrolet-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/chevy_ms.png"},"tags":[{"id":1370,"name":"2018 Chevrolet recall","slug":"2018-chevrolet-recall"},{"id":1372,"name":"Chevrolet ECM","slug":"chevrolet-ecm"},{"id":1371,"name":"Chevrolet stall","slug":"chevrolet-stall"}],"categories":[{"id":12,"name":"Chevrolet","slug":"chevrolet-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/chevy_ms.png"}]},{"id":17595,"title":"General Motors Recalls Various Vehicles Due to Vacuum Pump","link":"https://www.motorsafety.org/general-motors-recalls-various-vehicles-due-to-vacuum-pump/","status":"publish","slug":"general-motors-recalls-various-vehicles-due-to-vacuum-pump","excerpt":"<p>The possibility that vacuum pumps on various General Motors vehicles may fluctuate in performance has caused the company to recall a large amount of its automobiles from Cadillac, Chevrolet and GMC.</p>\n","description":"\n<p><em>December 2, 2021 Update </em>– GM has remedied 2,588,566 vehicles with the issue of vacuum pump issues in the 2018 GMC Yukon among others.&nbsp; GM has deemed 21,474 vehicles including the 2018 Chevrolet Silverado unreachable with an additional 207 vehicles being removed from the vacuum pump recall.</p>\n\n\n\n<p><em>Laguna Hills, CA – September 17, 2019 </em>– The possibility that <a href=\"https://www.motorsafety.org/general-motors-issues-another-round-of-recalls-for-brake-assist-system/\">vacuum pumps in various General Motors vehicles may vary in performance</a> has caused the company to conduct a <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCAK-19V645-5441.pdf\">recall of General Motors vehicles due to vacuum pump issues</a>.</p>\n\n\n\n<p>According to the &#8220;Frequently Asked Questions&#8221; document provided by the manufacturer, General Motors has decided that a defect, which relates to motor vehicle safety exists in the following vehicles:</p>\n\n\n\n<ul><li>2014 &#8211; 2018 Cadillac Escalade</li><li>2014 &#8211; 2018 Chevrolet Silverado</li><li>2014 &#8211; 2018 Chevrolet Suburban</li><li>2014 &#8211; 2018 Chevrolet Tahoe</li><li>2014 &#8211; 2018 GMC Sierra</li><li>2014 &#8211; 2018 GMC Yukon</li></ul>\n\n\n\n<h2><strong>The defect</strong></h2>\n\n\n\n<p>Within the <a href=\"https://www.reuters.com/article/us-gm-recall-idUSKCN1VW1JT\">GM vehicles that contain the mechanical vacuum pump defect</a>, the engine-mounted output may decrease over time, diminishing the power brake assist and therefore increasing the distance required to stop the vehicle.</p>\n\n\n\n<p>Ultimately, this leads to a greater chance of an accident and adds to other <a href=\"https://www.motorsafety.org/gm-recalls-multiple-models-for-faulty-airbag-warning-light/\">risks that Chevrolet vehicles have presented during collision events</a>.</p>\n\n\n\n<p>According to documents filed with the National Highway Traffic Safety Administration, the number of vehicles that potentially contain the defect is greater than 3,450,000, with GM estimating that 2 percent of the autos in that total are almost certainly affected by this issue.</p>\n\n\n\n<p>The following vehicles make up the group possibly saddled with the vacuum pump problem:</p>\n\n\n\n<ul><li>Cadillac Escalade 2015 &#8211; 2017</li><li>Chevrolet Silverado 1500 2014 &#8211; 2018</li><li>Chevrolet Suburban 2015 &#8211; 2018</li><li>Chevrolet Tahoe 2015 &#8211; 2018</li><li>GMC Sierra 1500 2014 &#8211; 2018</li><li>GMC Yukon 2015 &#8211; 2018</li></ul>\n\n\n\n<p>There are certain symptoms that drivers may experience if their car is among those affected by the vacuum pump defect. For instance, they may feel a vibration in the brake pedal or experience a change in the amount of pressure required to depress the brake.</p>\n\n\n\n<p>Other possible signs of the problem include a ticking noise coming from within the engine compartment and unintentional activation of the secondary hydraulic brake assist system, according to GM.</p>\n\n\n\n<p>Finally, the manufacturer noted that if the vacuum level drops to a level below 10 kPA, a &#8220;Service Brake Assist&#8221; message will appear in the Driver Information Center within five minutes.</p>\n\n\n\n<p>GM has determined that while the defect may potentially increase the possibility of collision, all of these vehicles are otherwise safe to drive before undergoing repair of the vacuum pump.</p>\n\n\n\n<h2><strong>Timeline of events</strong></h2>\n\n\n\n<p>According to a chronology provided by GM, the NHTSA opened a preliminary investigation into the subject in November 2018, at which point the manufacturer also began an internal investigation of the same issue.</p>\n\n\n\n<p>In December, after reviewing the results of both investigations, GM&#8217;s Safety &amp; Field Action Decision Authority decided to extend the warranty on vacuum pumps for all the vehicles listed above.</p>\n\n\n\n<p>Then, in July 2019, GM received results of the additional investigation into the subject by the NHTSA, which prompted yet another internal inquiry on the part of the manufacturer.</p>\n\n\n\n<p>This final study concluded on August 29, 2019, when GM decided to conduct an official recall on the automobiles to provide them with new software calibration.</p>\n\n\n\n<p>Dealers were notified of the recall in early September 2019, with GM planning to send direct notifications to affected drivers in the near future.</p>\n\n\n\n<h2><strong>The solution</strong></h2>\n\n\n\n<p>Vehicles that contain the defect can be brought to a local dealership, where the dealer will reprogram the electronic brake control module with a new calibration that corrects the problem, should the vacuum assist become depleted.</p>\n\n\n\n<p>As with the potentially dangerous Takata airbag issue reported in early 2021, drivers with a vehicle involved in the recall will be notified by mail. There will be no cost to vehicle owners for repair or repair. Check your car’s recall status using MotorSafety’s<a href=\"https://www.motorsafety.org/\"> free vehicle recall lookup tool</a>.</p>\n\n\n<p><script src=\"\" type=\"text/javascript\"></script><script src=\"\" type=\"text/javascript\"></script><script src=\"\" type=\"text/javascript\"></script></p>","source":"https://www.motorsafety.org/?p=17595","createdAt":"2019-09-17T03:57:47.000Z","date_gmt":"2019-09-17T17:42:47.000Z","updatedAt":"2021-12-27T08:01:42.000Z","modified_gmt":"2021-12-27T21:46:42.000Z","display_date":"September 17, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V645000","recall_date":"September 6, 2019","meta_title":"Chevrolet Recalls - 2018 Chevrolet Silverado, 2018 GMC Yukon","meta_description":"Chevrolet fixed issues with vacuum pump for 2018 GMC Yukon models but recalled several models of 2018 Chevrolet Silverado vehicles built with vacuum pump issues.","meta_keywords":"Chevrolet recalls, vacuum pump issues, 2018 GMC Yukon, 2018 Chevrolet Silverado ","custom_schema":""},"year":2019,"month":9,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/09/GMC-Yukon-768x512.jpg","alt_text":"Maroon GMC Yukon XL.","cld_public_id":"GMC-Yukon","category":{"id":36,"name":"Cadillac","slug":"cadillac-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/cadillac.png"},"tags":[{"id":787,"name":"2014 - 2018 Cadillac Escalade","slug":"2014-2018-cadillac-escalade"},{"id":788,"name":"2014 - 2018 Chevrolet Silverado","slug":"2014-2018-chevrolet-silverado"},{"id":1378,"name":"Cadillac vacuum pump","slug":"cadillac-vacuum-pump"},{"id":1377,"name":"Chevrolet Vacuum Pump","slug":"chevrolet-vacuum-pump"},{"id":1380,"name":"GM vacuum pump","slug":"gm-vacuum-pump"},{"id":1379,"name":"GMC vacuum pump","slug":"gmc-vacuum-pump"}],"categories":[{"id":36,"name":"Cadillac","slug":"cadillac-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/cadillac.png"},{"id":12,"name":"Chevrolet","slug":"chevrolet-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/chevy_ms.png"},{"id":72,"name":"GMC","slug":"gmc-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/gmc_RM.png"}]},{"id":17596,"title":"Spat of Hand Injuries Sparks Massive Ford Explorer Recall","link":"https://www.motorsafety.org/spat-of-hand-injuries-sparks-massive-ford-explorer-recall/","status":"publish","slug":"spat-of-hand-injuries-sparks-massive-ford-explorer-recall","excerpt":"<p>Ford Motor Company is pulling hundreds of thousands of 2017 Explorer sport utility vehicles from the marketplace due to a seating flaw that likely  occurred during manufacturing</p>\n","description":"<p><span id=\"pk-id\" value=\"40047800\"></span></p>\n<p>Laguna Hills, CA &#8211; Sept. 16, 2019 &#8211; Ford Motor Company is pulling hundreds of thousands of 2017 Explorer sport utility vehicles from the marketplace due to a seating flaw that likely occurred during manufacturing. When passengers reach for the power front seat lever, sharp edges along the seat frame may cause injury. Dozens of people have claimed as much to authorities.</p>\n<p>The 2017 Ford Explorer seat recall will officially begin Oct. 14. Owners who receive a notification are urged to take their vehicle to an area dealership. The SUV will be inspected and a replacement seat will be installed free of charge if it&#8217;s necessary.</p>\n<h3>The Defect</h3>\n<p>According to filings with the National Highway Traffic Safety Administration, Ford is recalling 311,228 2017 Ford Explorer SUVs from the supply chain <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCAK-19V651-7741.pdf\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">over concerns that some</a> of the passengers seats may have sharp components jutting out of the framing. If someone were to brush the problematic portions of the seat, or reach for something in proximity to what&#8217;s protruding, they may be hurt. Thus far, there have been 31 reports of individuals whose hands were scratched or scarred as a result of this flaw.</p>\n<h3>Timeline of Events</h3>\n<p>This 2017 Ford Explorer seat recall was <a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLRPT-19V651-1316.PDF\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">precipitated by three reports</a> submitted to Ford&#8217;s Critical Concern Review Group. The automaker learned at least 30 people had been injured when reaching between the console and power seat. A month later, Ford determined that these injuries were likely due to the sharp edge of the metal seat frame, which apparently escaped the attention of quality control. The automaker determined a recall was the best path forward and contacted NHTSA this summer to make the action official.</p>\n<h3>The Solution</h3>\n<p>Ford intends to begin notifying owners in mid-October. Those that receive a mailer should take their vehicle to a dealership. A new seat will replace the problematic at no cost.</p>\n<p>For more information on the 2017 Ford Explorer seat recall or other recent <a href=\"https://www.motorsafety.org/category/ford-recalls/\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">Ford recall actions</a>, visit MotorSafety.org.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=17596","createdAt":"2019-09-16T03:52:25.000Z","date_gmt":"2019-09-16T17:37:25.000Z","updatedAt":"2020-09-25T07:37:01.000Z","modified_gmt":"2020-09-25T21:22:01.000Z","display_date":"September 16, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2019,"month":9,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/09/shutterstock_559583068-768x502.jpg","alt_text":"","cld_public_id":"shutterstock_559583068","category":{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"},"tags":[{"id":165,"name":"ford","slug":"ford"},{"id":183,"name":"front seat lever","slug":"front-seat-lever"},{"id":163,"name":"investigation","slug":"investigation"}],"categories":[{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"}]}]