[{"id":16546,"title":"BMW recalls 2016 M3 and M4 over drive shaft issue","link":"https://www.motorsafety.org/bmw-recalls-2016-m3-and-m4-over-drive-shaft-issue/","status":"publish","slug":"bmw-recalls-2016-m3-and-m4-over-drive-shaft-issue","excerpt":"<p>There may be a durability problem in BMW M3 and M4 drive shafts.</p>\n","description":"<p>&nbsp;</p>\n<p>Munich &#8211; Jan. 31, 2019 &#8211; BMW has issued a recall for its M3 and M4 models, to counter a potentially dangerous fault within the vehicles&#8217; drive shafts. According to <a href=\"https://www.caradvice.com.au/721778/2016-bmw-m3-m4-m4-convertible-recall/\" target=\"_blank\" rel=\"noopener noreferrer\">a company statement</a> reported by Car Advice, the vehicles requiring inspection and repair were sold in Australia and noted by that country&#8217;s product safety monitor. The organization with recall authority in the U.S., the National Highway Traffic Safety Administration, has been inactive for much of January due to the government&#8217;s funding shutdown, thus making it unclear if a similar recall will affect U.S. BMW owners.</p>\n<p>The vehicles involved are all sedans from the 2016 model year. The M3, M4 and M4 convertible are all affected by the recall and according to the announcement, these vehicles exist in very small quantities in Australia. With 97 vehicles affected, the M3&nbsp;is the most popular of the three types. There are 71 of the hardtop M4, with only 10 of the convertible M4&nbsp;recorded.</p>\n<p>The process of recalling the vehicles shows that automakers follow procedure even when the number of cars in question is relatively small in a particular territory. Recent actions by specialist carmakers such as Maserati show attention being paid to models that were not made or exported in mass quantities.</p>\n<h3>The Defect</h3>\n<p>According to the company&#8217;s announcement, the potentially dangerous problem leading to the recent action is located within the affected vehicles&#8217; drive shafts. The shafts on these cars are made of carbon fiber and contain two internal components &#8211; the three-hole flange and the pushing piece. The company questioned whether the pieces within the drive shaft will hold up over time and usage over the lifespan of the cars. If these parts were not made with &#8220;sufficient long-term durability&#8221;, the pushing piece could end up pulled out of the drive shaft, limiting the vehicle&#8217;s torque to the rear wheels. Such a lack of torque may may increase the risk of a collision, leading to the necessity of a recall.</p>\n<h3>Timeline of Events</h3>\n<p>The announcement from BMW did not clarify several pieces of information about the recall underway, such as how it was discovered or when. The vehicles involved all originate from the 2016 model years, but the notice was not issued until late January 2019. The press materials did not mention whether the fault was discovered as part of an inspection, due to an actual incident on the road or in a laboratory test. Furthermore, no connection to cars from outside of the Australian market was discussed.</p>\n<h3>The Solution</h3>\n<p>The statement announcing the recall was similarly quiet about what exactly the fix to the problem will entail. Drivers were urged by Car Advice to get in touch with their respective BMW dealers and receive repairs for the drive shaft free of charge. Due to the nature of the problem, with parts potentially not tough enough to stand up to long-term use, it appears likely those component will be replaced with stronger replacement parts, thus making the drive shaft safe for continued use, no matter how long the sedans are on the road.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16546","createdAt":"2019-01-31T04:31:21.000Z","date_gmt":"2019-01-31T18:16:21.000Z","updatedAt":"2020-09-29T05:22:23.000Z","modified_gmt":"2020-09-29T19:07:23.000Z","display_date":"January 31, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2019,"month":1,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/01/shutterstock_522534748-1-768x513.jpg","alt_text":"","cld_public_id":"shutterstock_522534748-1","category":{"id":15,"name":"BMW","slug":"bmw-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/bmw_RM.png"},"tags":[],"categories":[{"id":15,"name":"BMW","slug":"bmw-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/bmw_RM.png"}]},{"id":16544,"title":"Subaru ponders 14,000-car recall amid production shutdown","link":"https://www.motorsafety.org/subaru-ponders-14000-car-recall-amid-production-shutdown/","status":"publish","slug":"subaru-ponders-14000-car-recall-amid-production-shutdown","excerpt":"<p>Approximately 14,000 Subaru vehicles bound for retailers around the world may be recalled to deal with a potential power steering fault.</p>\n","description":"<p>&nbsp;</p>\n<p>Tokyo &#8211; Jan. 31, 2019 &#8211; Subaru has paused production of multiple vehicle types at its factory in Japan due to the possibility of a defect in the cars&#8217; power steering systems. The automaker is deciding how to proceed with the 14,000 affected cars, some of which were sold in Japan and others of which are destined for export to other territories. Most of the cars impacted are likely bound for the U.S. The Forester, XV and Impreza are the three models that may include the defective component.</p>\n<p>A <a href=\"https://asia.nikkei.com/Business/Companies/Subaru-ponders-recall-after-Japan-production-halted\" target=\"_blank\" rel=\"noopener noreferrer\">report from Nikkei</a> noted that recent years have seen over 500,000 cars recalled by Subaru. While past recalls have been caused by potential faults in components such as valve springs, as well as actions such as regulatory compliance failures. The most recent plant shutdown has not turned into a fully declared recall, but it has impacted cars even beyond those that may have the defective part, as the factory equipment is employed to produce multiple vehicle types.</p>\n<h3>The Defect</h3>\n<p>The problem that has caused the concern involves part of the electrical assembly used in power steering. The component in question is a third-party item produced by Hitachi Automotive systems and used in the three Subaru models. The Nikkei report explained that when the part fails, a warning light activates on the dashboard, and steering the car becomes harder for the driver. <a href=\"http://www.china.org.cn/world/Off_the_Wire/2019-01/31/content_74430433.htm\" target=\"_blank\" rel=\"noopener noreferrer\">Xinhua</a> noted there have been two instances of such a failure happening, though no one has been reported injured yet.</p>\n<p>The fact that Subaru cars use a unique engine configuration known as the &#8220;boxer&#8221; layout may have exacerbated the challenges of the situation. The components for these engines are not compatible with generic hardware that work in more standardized engines. Subaru technicians searched for a solution to the current issue that did not require manufacturing and ordering a &#8220;made from scratch&#8221; replacement part. That meant isolating the exact issue causing the fault and correcting it.</p>\n<p>To remove the defective parts from the supply chain, Subaru shut down its main production facility in Gunma Prefecture, Japan, which produces 2,600 cars a day when operational. Most of the vehicles produced in the plant &#8211; 80 percent &#8211; are exported, and Nikkei added that 60 percent of those cars go to U.S. dealerships. After ascertaining which part would have to be replaced to resume production, Subaru reopened its plant on schedule, according to Xinhua.</p>\n<p>As the component is produced by an outside supplier, Hitachi has also been contacted for input. Hitachi stated that problems during car assembly are unlikely, which may mean the electronics within the steering components are faulty.</p>\n<h3>Timeline of Events</h3>\n<p>The potential recall at Subaru has developed over a relatively short time frame. All the affected vehicles that contain the potentially defective part were produced between late December 2018 and the Jan. 16 shutdown of the Gumna plant. Upon discovery of the fault, Subaru declared a week-long shutdown and sent out recall notices for roughly 780 vehicles that were made at the facility in question and sent to be sold on the Japanese market instead of overseas, according to the Xinhua report.</p>\n<p>Nikkei added that the quality control division within Subaru, which has been the subject of some of the automaker&#8217;s recent scandals in the Japanese market, did not catch the potential power steering problem. Instead, two reports of problems with steering were used to determine the part responsible. Fortunately, there were no collisions or injuries of any kind reported due to the power steering issues. While the vehicles may have become hard to control, they didn&#8217;t crash.</p>\n<p>The automaker&#8217;s recent series of scandals, as described by Nikkei, began in late 2017. At that time, Subaru revealed that some of its inspections were performed by staff without the proper certifications. After that, more troubling details emerged. In November 2018, a valve spring problem caused the recall of 101,000 vehicles, with 100,000 more added because of legal compliance issues.</p>\n<p>These recalls have taken a toll on the company&#8217;s finances. In the immediate aftermath of the plant closure notice, Subaru&#8217;s stock price fell 6 percent on the Tokyo exchange. The announcement that the stoppage would only last a week provided some relief, but the impact was still a net negative, demonstrating the lasting financial impact of repeated recall events and quality-control problems.</p>\n<h3>The Solution</h3>\n<p>Due to several complicating factors, the exact course of action Subaru will take is unclear. The roughly 14,000 exported cars that may contain faulty Hitachi steering components have not been officially recalled. Since the vehicles have all been produced over the past few months, many of them are likely still in the custody of dealers rather than customers.</p>\n<p>The automaker is pondering sending replacement parts overseas to replace the faulty components, according to Xinhua, rather than recalling the vehicles to Japan to be refitted. The domestic recall has been the most straightforward part of the process, with the under-1,000 vehicles produced for the Japan market already recalled.</p>\n<p>Since the production facility impacted is primarily used to produce export vehicles, and most of those cars are bound for the U.S., there is a chance American regulators may soon be involved in the recall process. Recent weeks have seen no new announcements from the National Highway Traffic Safety Administration, as it shut down operations along with other Federal agencies during the budget impasse. During that silence, some automakers have still issued their own recall notices for U.S. vehicles, including the latest wave of Takata air bag inflator repairs.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16544","createdAt":"2019-01-31T04:25:08.000Z","date_gmt":"2019-01-31T18:10:08.000Z","updatedAt":"2020-09-29T05:34:43.000Z","modified_gmt":"2020-09-29T19:19:43.000Z","display_date":"January 31, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2019,"month":1,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/01/shutterstock_1178710990-2-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_1178710990-2","category":{"id":24,"name":"Subaru","slug":"subaru-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/subaru_ms.png"},"tags":[],"categories":[{"id":24,"name":"Subaru","slug":"subaru-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/subaru_ms.png"}]},{"id":16537,"title":"Honda Recalls More Than 1,000 Leased Clarity Fuel Cell Vehicles","link":"https://www.motorsafety.org/honda-recalls-more-than-1000-leased-clarity-fuel-cell-vehicles/","status":"publish","slug":"honda-recalls-more-than-1000-leased-clarity-fuel-cell-vehicles","excerpt":"<p>Laguna Hills, Calif. – January 31, 2019 –&nbsp; Honda is recalling 1,082 model-year 2017-2018 Clarity Fuel Cell vehicles, all located in California, and all part of a leasing program. The action affects some vehicles already listed under a previous recall. The Defect According to&nbsp;Consumer Affairs, the Fuel Cell Electronic Control Unit (ECU) responsible for monitoring</p>\n","description":"<p>Laguna Hills, Calif. – January 31, 2019 –&nbsp; Honda is recalling 1,082 model-year 2017-2018 Clarity Fuel Cell vehicles, all located in California, and all part of a leasing program. The action affects some vehicles already listed under a previous recall.</p>\n<h3>The Defect</h3>\n<p>According to&nbsp;<a href=\"https://www.consumeraffairs.com/news/honda-recalls-clarity-fuel-cell-vehicles-011119.html\" target=\"_blank\" rel=\"noopener noreferrer\" data-auth=\"NotApplicable\">Consumer Affairs</a>, the Fuel Cell Electronic Control Unit (ECU) responsible for monitoring voltage in the fuel cell stack can possibly misinterpret a minor voltage variance. In such cases, the ECO may erroneously shut down the fuel cell stack in response to the misinterpreted data. The shutdown of the fuel stack could result in an unexpected loss of motive power. Such a power loss, especially at high speeds, can significantly increase the risk of a crash and potentially cause harm to the vehicle&#8217;s driver or passengers.</p>\n<h3>Timeline of Events</h3>\n<p>According to&nbsp;<a href=\"https://tiremeetsroad.com/2018/12/27/1000-honda-clarity-fuel-cell-vehicles-recalled-total-loss-of-motor-power-possible/\" target=\"_blank\" rel=\"noopener noreferrer\" data-auth=\"NotApplicable\">Tire Meets Road,</a>&nbsp;the Honda Clarity has been marketed as a &#8220;lease-only option&#8221; for drivers. Unlike a standard electric car which uses a battery to store electricity, the hydrogen fuel cell Clarity requires compressed hydrogen running constantly through a fuel cell, which produces electricity that powers the car&#8217;s electric motor. There have been online comments about loss of power and other issues with high parts costs and A1 service bills.</p>\n<p>In 2017, a similar recall was issued for 2017 Honda Clarity models. Approximately 470 model-year 2017 Honda Clarity Fuel Cell electric vehicles were recalled to service dealerships for a reset of ECO software to rectify power system problems, but lack of available parts has delayed resolving this issue for 2017 cars until mid-February 2019. The current recall for 2018 vehicles is expected to be similarly delayed.</p>\n<h3>The Solution</h3>\n<p>Honda will begin notifying owners in mid-February 2019. A dealership will update the ECU software for free. Owners can call the automaker at 888-234-2138. Owners may also contact the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153), or go to www.safercar.gov.</p>\n<p><strong>CATEGORIES</strong><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16537","createdAt":"2019-01-31T04:09:36.000Z","date_gmt":"2019-01-31T17:54:36.000Z","updatedAt":"2020-09-29T05:39:41.000Z","modified_gmt":"2020-09-29T19:24:41.000Z","display_date":"January 31, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2019,"month":1,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/01/shutterstock_1132338050-1-768x577.jpg","alt_text":"","cld_public_id":"shutterstock_1132338050-1","category":{"id":4,"name":"Honda","slug":"honda-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/honda_ms.png"},"tags":[],"categories":[{"id":4,"name":"Honda","slug":"honda-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/honda_ms.png"}]},{"id":16737,"title":"GM Recalls More Than 1,000 Chevy Malibus for Air Bag Defects","link":"https://www.motorsafety.org/gm-recalls-more-than-1000-chevy-malibus-for-air-bag-defects/","status":"publish","slug":"gm-recalls-more-than-1000-chevy-malibus-for-air-bag-defects","excerpt":"<p>General Motors LLC (GM) is recalling certain 2010-2011 Chevrolet Malibu vehicles, due to a potentially dangerous airbag defect.</p>\n","description":"\n<p><em>Detroit – January 31, 2022 – </em>General Motors (NYSE:GM) has remedied issues with 459 2010-2011 Chevy Malibu vehicles for a potential defect that may cause the driver&#8217;s frontal airbag inflator to explode. Additionally, 52 of these vehicles have been categorized as unreachable, and 53 have been removed from the recall. These 2010-2011 Chevrolet Malibu models were remedied in 2 different years, four groups in 2019 and three groups were remedied in 2020 by having these driver airbag issues.</p>\n\n\n\n<p><em>Detroit – January 31, 2019 </em>– <a href=\"https://www.motorsafety.org/gm-recalls-more-than-1000-chevy-malibus-for-air-bag-defects/\">General Motors is recalling certain 2010-2011 Chevrolet Malibu vehicles, due to a potentially dangerous airbag defect</a>. Up to 1,145 units may be affected by this issue.</p>\n\n\n\n<h2><strong>The defect</strong></h2>\n\n\n\n<p>According to the<a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCLRPT-19V019-6173.PDF\"> National Highway Traffic Safety Administration Safety Report</a>, in the event of a crash necessitating deployment of the driver&#8217;s frontal airbag, the airbag inflator in these cars may explode due to being over-pressurized.</p>\n\n\n\n<p>If the inflator explodes, sharp metal fragments may strike the driver or other occupants, resulting in serious injury or death.</p>\n\n\n\n<h2><strong>Timeline of events</strong></h2>\n\n\n\n<p>On November 30, 2017, an attorney contacted GM and claimed that on September 22, 2017, the <a href=\"https://www.consumerreports.org/cars/chevrolet/malibu/2011/reliability/\">front-driver airbag inflator in a 2011 Chevrolet Malibu ruptured during a crash-related deployment</a> and injured his client.</p>\n\n\n\n<p>GM reported the allegation to NHTSA on December 6 of the same year in accordance with Standing General Orders 2015-01 and 2015-02.</p>\n\n\n\n<p>Between November 30, 2017, and December 13, 2018, GM made multiple attempts to locate and inspect the vehicle to confirm whether or not a rupture had occurred.</p>\n\n\n\n<p>A GM engineer was permitted to inspect the vehicle and components. Based on that examination, GM determined that the front-driver airbag inflator in the subject vehicle likely over-pressurized and ruptured during deployment.’’</p>\n\n\n\n<p>On December 19, 2018, GM presented the inspection photos and the other findings of its preliminary analysis to the NHTSA. On December 20, 2018, GM&#8217;s Safety Field Action Decision Authority (SFADA) decided to conduct a safety recall on the ARC inflators built in the suspect manufacturing lot.</p>\n\n\n\n<p>At the time of the initial filing, GM was not aware of other rupture allegations involving this ARC inflator in GM vehicles.</p>\n\n\n\n<p>On December 29, 2016, <a href=\"https://www.motorsafety.org/additional-chevy-malibus-recalled-takata-air-bag-defect-2/\">GM recalled certain 2017 Chevrolet Malibu vehicles due to airbag inflator defects</a>. This recall is part of the larger <a href=\"https://www.consumerreports.org/car-recalls-defects/takata-airbag-recall-everything-you-need-to-know-a1060713669/#:~:text=To%20date%2C%20there%20have%20been,been%20at%20least%2027%20deaths.\">Takata airbag inflators recall</a>. These problems were similar to the reasons that led to a recent recall of 2016 Malibu vehicles.</p>\n\n\n\n<h2><strong>The solution</strong></h2>\n\n\n\n<p>GM has notified owners of these potentially problematic vehicles, and dealers will replace the front driver airbag module for free. Interim notices informing owners of the safety risk were mailed on February 8, 2019.</p>\n\n\n\n<p>Owners will receive a second notice when the remedy becomes available, which is expected to be in late March 2019. GM&#8217;s number for this recall is N182206630.</p>\n\n\n\n<p><a href=\"https://static.nhtsa.gov/odi/rcl/2019/RCSB-19V019-0609.pdf\">The NHTSA Campaign Number for this recall is 19V-019000</a>.</p>\n\n\n\n<p>To find out if your vehicle is part of this recall, use MotorSafety.org&#8217;s<a href=\"https://www.motorsafety.org/\"> free vehicle recall lookup tool</a>.</p>\n","source":"https://www.motorsafety.org/?p=16737","createdAt":"2019-01-31T03:04:03.000Z","date_gmt":"2019-01-31T16:49:03.000Z","updatedAt":"2022-03-03T09:35:06.000Z","modified_gmt":"2022-03-03T23:20:06.000Z","display_date":"January 31, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V-019000","recall_date":"January 31, 2019","meta_title":"GM Recalls - 2010-2011 Chevy Malibu - Driver Airbag Explode","meta_description":"GM recalls several 2010-2011 Chevy Malibu for a potential defect that may cause the driver's frontal airbag inflator to explode due to being over-pressurized.","meta_keywords":"GM recalls, 2010 Chevy Malibu Recall, 2011 Chevy Malibu Recall, 2010 Chevy Malibu issues, 2011 Chevy Malibu issues","custom_schema":""},"year":2019,"month":1,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/01/shutterstock_398597389-1-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_398597389-1","category":{"id":12,"name":"Chevrolet","slug":"chevrolet-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/chevy_ms.png"},"tags":[{"id":887,"name":"2010 - 2011 Chevrolet Malibu","slug":"2010-2011-chevrolet-malibu"},{"id":888,"name":"Air bag","slug":"air-bag"},{"id":598,"name":"air bag inflator","slug":"air-bag-inflator"},{"id":429,"name":"serious injury","slug":"serious-injury"}],"categories":[{"id":12,"name":"Chevrolet","slug":"chevrolet-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/chevy_ms.png"},{"id":37,"name":"GM","slug":"gm-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/gm.png"}]},{"id":16578,"title":"Toyota Recalls Nearly 4,400 Corolla Hatchbacks Due to Major Transmission Issue","link":"https://www.motorsafety.org/toyota-recalls-nearly-4400-corolla-hatchbacks-due-to-major-transmission-issue/","status":"publish","slug":"toyota-recalls-nearly-4400-corolla-hatchbacks-due-to-major-transmission-issue","excerpt":"<p>Toyota is recalling close to 3,400 2019 Toyota Corolla Hatchbacks in the USA and a further nearly 1,000 vehicles in Canada due to a faulty component in the transmission.</p>\n","description":"<p><i><span style=\"font-weight: 400;\">Plano, Texas – January 30, 2019</span></i><span style=\"font-weight: 400;\"> –  Toyota is </span><a href=\"https://www.motorsafety.org/toyota-recalls-nearly-4400-corolla-hatchbacks-due-to-major-transmission-issue/\"><span style=\"font-weight: 400;\">recalling close to 3,400 2019 Toyota Corolla hatchbacks</span></a><span style=\"font-weight: 400;\"> in the USA and a further nearly 1,000 vehicles in Canada due to a faulty component in the transmission. Only Corolla Ha</span><span style=\"font-weight: 400;\">tchbacks</span><span style=\"font-weight: 400;\"> with a continuously variable transmission (CVT) are included in this recall. The Corolla sedan is excluded, as are any hatchbacks with manual transmissions.</span></p>\n<h3><b>The Defect</b></h3>\n<p><span style=\"font-weight: 400;\">According to Toyota’s press release, in the involved vehicles, there is a possibility the that due to a manufacturing error, the blades of the pump impeller in the torque converter may detach, causing the converter in </span><a href=\"https://www.toyota.ca/toyota/en/connect/2784/cvt-transmission\"><span style=\"font-weight: 400;\">Toyota’s Continuously Variable Transmission (CVT)</span></a><span style=\"font-weight: 400;\"> to possibly fail. This may lead to a loss of vehicle power. If the part fails while the car is in motion, the vehicle&#8217;s loss of power could increase the risk of a crash, especially if the failure happens when the vehicle is traveling at a high speed, which could lead to a crash or possible vehicle rollover or even an explosion due to catastrophic transmission failure.</span></p>\n<h3><b>Timeline of Events</b></h3>\n<p><span style=\"font-weight: 400;\">In July of 2019, more than </span><a href=\"https://www.motorsafety.org/over-1000-toyota-models-require-recalls-due-to-labeling-error/\"><span style=\"font-weight: 400;\">1000 Toyota Models were recalled due to a labeling error</span></a><span style=\"font-weight: 400;\">. </span><span style=\"font-weight: 400;\">A subsidiary of Toyota Motor Company recalled certain Corolla, Sienna, Yaris iA, and Camry models due to a labeling flaw that may misinform users of how much weight their automobiles can safely carry. </span><span style=\"font-weight: 400;\">Motorists should check the label on their factory-installed floor mats to see if they’re affected and contact their nearest Toyota dealership so the clerical issue can be corrected. The replacement will come at no charge.</span></p>\n<p><span style=\"font-weight: 400;\">Late in 2018 a previous Toyota recall revealed that over 130,000 of its trucks and SUVs had faulty sensors, affecting seat belt tension and air bag functionality. At the time no plan was in place to resolve that issue, although Toyota announced in a</span> <span style=\"font-weight: 400;\">press release</span><span style=\"font-weight: 400;\"> that it was developing a solution and would notify owners by mid-February.</span></p>\n<p><span style=\"font-weight: 400;\">The news of the pending recall came in late December. It has not yet been released what prompted the investigation that led to the recall, although at this time no accidents or injuries related to the vehicles being recalled are known as yet. Toyota introduced its new &#8220;Direct Shift-CVT&#8221; in 2018 and implemented it in the 2019 Corolla Hatchback. The Direct Shift-CVT uses a launch gear to improve off-the-line performance. The expectation was that the addition would lead to faster shifts and a 6 percent increase in fuel economy.</span></p>\n<h3><b>The Solution</b></h3>\n<p><span style=\"font-weight: 400;\">Toyota dealers will replace the Direct Shift-CVT with a new one containing a new torque converter not affected by this issue at no cost to customers, starting as soon as the company has sufficient parts to make those repairs.</span></p>\n<p><span style=\"font-weight: 400;\">Owners can contact Toyota at 800-331-4331. Owners may also contact the </span><a href=\"https://www.nhtsa.gov/about-nhtsa/contact-us\"><span style=\"font-weight: 400;\">National Highway Traffic Safety Administration Vehicle Safety Hotline</span></a><span style=\"font-weight: 400;\"> at 1-888-327-4236 (TTY 1-800-424-9153), or go to </span><a href=\"http://www.safercar.gov\"><span style=\"font-weight: 400;\">www.safercar.gov</span></a><span style=\"font-weight: 400;\">.</span></p>\n","source":"https://www.motorsafety.org/?p=16578","createdAt":"2019-01-30T05:30:52.000Z","date_gmt":"2019-01-30T19:15:52.000Z","updatedAt":"2022-03-03T09:36:02.000Z","modified_gmt":"2022-03-03T23:21:02.000Z","display_date":"January 30, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":"","meta_title":"Toyota Recalls - 2019 Toyota Corolla - Transmission Defects","meta_description":"Toyota is recalling several 2019 Toyota Corolla Hatchbacks due to a manufacturing error in the continuously variable transmission found only on these models.","meta_keywords":"Toyota Recalls, 2019 Toyota Corolla Hatchbacks, 2019 Toyota Corolla Transmission, 2019 Toyota Corolla Recalls","custom_schema":""},"year":2019,"month":1,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/01/shutterstock_1555897604-1-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_1555897604-1","category":{"id":17,"name":"Toyota","slug":"toyota-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/toyota_ms.png"},"tags":[],"categories":[{"id":17,"name":"Toyota","slug":"toyota-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/toyota_ms.png"}]},{"id":16539,"title":"Fiat Chrysler Recalls 1.4 Million Vehicles Due to Takata Air Bags","link":"https://www.motorsafety.org/fiat-chrysler-recalls-1-4-million-vehicles-due-to-takata-air-bags/","status":"publish","slug":"fiat-chrysler-recalls-1-4-million-vehicles-due-to-takata-air-bags","excerpt":"<p>Laguna Hills, Calif. – January 29, 2019 – Fiat Chrysler Automobiles (FCA) is recalling 1.4 million vehicles in the U.S. to have their Takata air bag inflators replaced. The action includes 2010-2015 Chrysler 300 sedans, 2010-2011 Dodge Dakota trucks, 2010-2014 Dodge Challenger coupes, 2011-2015 Dodge Charger sedans, 2010-2016 Jeep Wrangler SUVs, and 2010 Ram 3500,</p>\n","description":"<p>Laguna Hills, Calif. – January 29, 2019 – Fiat Chrysler Automobiles (FCA) is recalling 1.4 million vehicles in the U.S. to have their Takata air bag inflators replaced. The action includes 2010-2015 Chrysler 300 sedans, 2010-2011 Dodge Dakota trucks, 2010-2014 Dodge Challenger coupes, 2011-2015 Dodge Charger sedans, 2010-2016 Jeep Wrangler SUVs, and 2010 Ram 3500, 4500 and 5500 trucks.</p>\n<h2>The Defect</h2>\n<p>According to <a href=\"https://www.consumerreports.org/car-recalls-defects/fiat-chrysler-adds-vehicles-to-takata-airbag-recall/\" target=\"_blank\" rel=\"noopener noreferrer\" data-auth=\"NotApplicable\">Consumer Reports</a>, the Takata air bag inflators use ammonium nitrate to inflate the air bag in the event of a crash. That compound has been found to become unstable over time, especially after exposure to temperature fluctuations and periods of constant high humidity. The instability can cause inflators to explode with violent force during an impact.</p>\n<p>If a defective air bag ruptures, it can cause sharp metal fragments to fly outwards directly into the faces of the driver and passengers. This loose debris can significantly increase the risk of serious injury or death for all occupants of the vehicle.</p>\n<h2>Timeline of Events</h2>\n<p>According to the <a href=\"https://www.nhtsa.gov/equipment/takata-recall-spotlight\" target=\"_blank\" rel=\"noopener noreferrer\" data-auth=\"NotApplicable\">National Highway Traffic Safety Administration</a>, the Takata recall is the largest and most complex automotive recall in U.S. history. It covers 50 million air bag inflators in 37 million cars, SUVs, and pickup trucks from 19 manufacturers. At least 15 drivers&#8217; and passengers&#8217; deaths &#8211; and more than 250 injuries &#8211; have been attributed to the devices.</p>\n<p>The recall has been spaced out to allow manufacturers time to acquire and stock replacement parts. Since the degradation of the inflator material occurs over time, the recall addressed the oldest affected cars first as well as those located in areas of temperature fluctuation and high humidity. The recall notices have been since rolled out in phases on a predetermined schedule. The latest rollout includes the Fiat Chrysler vehicles, and these recalls will continue into 2020.</p>\n<h2>The Solution</h2>\n<p>FCA says it will let owners of affected vehicles know when they can schedule service. Dealers will replace the passenger-side front air bag inflator free of charge. Owners can contact FCA&#8217;s recall information center at 800-853-1403. Owners may also contact the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153), or go to www.safercar.gov.<script src=\"\" type=\"text/javascript\"></script><script src=\"\" type=\"text/javascript\"></script><script src=\"\" type=\"text/javascript\"></script></p>\n<h2><strong>Is your vehicle part of the recall?</strong></h2>\n<p>Over 1.4 million vehicles were originally part of this recall. <span data-sheets-value=\"{&quot;1&quot;:2,&quot;2&quot;:&quot;As of April 9, 2021, 958,175 airbags had been replaced, with 400,346 remaining.&quot;}\" data-sheets-userformat=\"{&quot;2&quot;:769,&quot;3&quot;:{&quot;1&quot;:0},&quot;11&quot;:4,&quot;12&quot;:0}\">As of April 9, 2021 – the last date for which information was available – 958,175 airbags had been replaced. </span>To see if your car still needs to be repaired, use MotorSafety’s<a href=\"https://www.motorsafety.org/\"> free lookup tool</a>.</p>\n","source":"https://www.motorsafety.org/?p=16539","createdAt":"2019-01-29T04:12:04.000Z","date_gmt":"2019-01-29T17:57:04.000Z","updatedAt":"2021-06-18T11:08:23.000Z","modified_gmt":"2021-06-19T00:53:23.000Z","display_date":"January 29, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V018000","recall_date":"January 15, 2019","meta_title":"","meta_description":"","meta_keywords":"","custom_schema":""},"year":2019,"month":1,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/01/shutterstock_312841649-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_312841649","category":null,"tags":[],"categories":[]},{"id":16508,"title":"Subaru Impreza, BRZ and XV Crosstek valve spring recall update","link":"https://www.motorsafety.org/subaru-impreza-brz-and-xv-crosstek-valve-spring-recall-update/","status":"publish","slug":"subaru-impreza-brz-and-xv-crosstek-valve-spring-recall-update","excerpt":"<p>The process of replacing engine valve springs in Subaru vehicles may take longer than expected.</p>\n","description":"<p>&nbsp;</p>\n<p>Camden, New Jersey, Jan. 28, 2019 &#8211; In November 2018, Subaru of America <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V772-5413.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">issued a recall</a> for 165,534 vehicles across the Impreza, BRZ and XV Crosstek models. The recall was brought on by engine springs&nbsp;that&nbsp;are prone to fracturing. In the&nbsp;event&nbsp;that these components break, the cars may make unnatural noises, or the engines may malfunction or stall. Recently, the Burlington Free Press revealed <a href=\"https://www.burlingtonfreepress.com/story/news/2019/01/28/subaru-recall-impreza-crosstrek-repair-wait-time-vermont-stretches-into-2020/2699019002/\" target=\"_blank\" rel=\"noopener noreferrer\">additional details of the recall</a>, including the fact that some dealers may not be able to replace the part until late 2020.</p>\n<p>The vehicles that potentially contain compromised value screws include the 2013 Subaru BRZ, the 2013 Subaru XV Crosstek&nbsp;and the 2012-2014 Subaru Impreza. Owners of these vehicles should have already received letters regarding the recall, which is how the Free Press determined how long the repair timeline will be in high-demand areas such as Vermont.</p>\n<h3>The Defect</h3>\n<p>Reacting to reports of compromised valve springs within vehicle engines, Subaru issued its recall for the cars in question. In addition to strange noises and other unspecified malfunctions, engine stalling may make it impossible for drivers to start their cars again. Subaru recommended in its letter to vehicle owners that if they experience noise or vibrations while driving, they pull over as soon as it is safely possible, to ensure they do not suffer the heightened collision risk that would come with stalling out.</p>\n<h3>Timeline of Events</h3>\n<p>The report from the Free Press brings more clarity to how long the recall will take to carry out. The National Highway Traffic Safety Administration named the defect Nov. 1, 2018. When the first notice went out, there had been 11 reports of cars suffering from operational problems due to insufficiently strong springs in their engines. Letters went out to Subaru owners shortly thereafter instructing them to bring their vehicles into a dealership for repairs as soon as possible. When the Free Press&#8217;s reporter set a date to have her own Subaru repaired, the local dealership explained the earliest slot it has available is in November 2020.</p>\n<p>Representatives from the dealership explained that due to the large number of Subarus on the roads of Vermont, as well as the time-consuming nature of the repairs and the need for specialized training, the timeline of repairs will stretch well into next year. Dealership personnel need to be briefed on the spring replacement operation. At the dealership in question, this tutorial&nbsp;is scheduled for February.</p>\n<h3>The Solution</h3>\n<p>In a 7-to-13-hour procedure, mechanics will replace the affected parts in affected vehicles. The procedure uses specialized tools. In addition to the relatively time-consuming nature of the work, as well as the limited number of tools present at each dealership, only one vehicle is serviced each day. This procedure explains the long wait time in areas such as Burlington.</p>\n<p>In its recall notice, Subaru noted that if a vehicle stalls and cannot start again due to spring problems, owners should make arrangements to have the car towed to the nearest Subaru dealer. For vehicle owner reference, the recall&#8217;s number is 18V-772&nbsp;in Subaru&#8217;s system and WTY-84 according to the NHTSA&#8217;s records.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16508","createdAt":"2019-01-28T04:03:19.000Z","date_gmt":"2019-01-28T17:48:19.000Z","updatedAt":"2020-09-29T06:10:10.000Z","modified_gmt":"2020-09-29T19:55:10.000Z","display_date":"January 28, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2019,"month":1,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/01/shutterstock_1119318602-1-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_1119318602-1","category":{"id":24,"name":"Subaru","slug":"subaru-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/subaru_ms.png"},"tags":[],"categories":[{"id":24,"name":"Subaru","slug":"subaru-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/subaru_ms.png"}]},{"id":16574,"title":"Tesla Recalls Certain Model S Vehicles as Part of Takata Air Bag Recall","link":"https://www.motorsafety.org/tesla-recalls-certain-model-s-vehicles-as-part-of-takata-air-bag-recall/","status":"publish","slug":"tesla-recalls-certain-model-s-vehicles-as-part-of-takata-air-bag-recall","excerpt":"<p>Tesla is recalling close to 14,000 Model S vehicles as part of the global Takata airbag recall.</p>\n","description":"<p>&nbsp;</p>\n<p>Laguna Hills, Calif. – January 27, 2019 – Tesla is recalling close to 14,000 Model S vehicles as part of the global Takata air bag recall. Affected vehicles are part of a worldwide recall that impacted millions of vehicles from different manufacturers. The recall involves Model S cars manufactured between February 2014 and December 2016, according to <a href=\"https://techcrunch.com/2019/01/17/tesla-to-recall-14000-model-s-cars-in-china-over-faulty-takata-airbags/\">TechCrunch</a>, but does not affect the Roadster, Model X, Model 3, or later Model S vehicles.</p>\n<h3>The Defect</h3>\n<p>The Takata air bag inflators in question contain a propellant material that can decompose over time, leading to risk of explosion on impact and flying shards of debris. The explosion of an air bag and resulting impact of debris could cause serious injury or death to a driver or passenger. The recall has been ongoing and is taking place worldwide.</p>\n<h3>Timeline of Events</h3>\n<p>According to <a href=\"https://www.tesla.com/support/model-s-safety-update\">Tesla</a>, the company has been adhering to a schedule previously determined by the National Highway Traffic Safety Administration (NHTSA). The recall of the front passenger air bags in 2012 Model S vehicles, which began in January 2017, has now been extended to 2013 Model S vehicles in January 2018, and is also being extended to 2014-2016 Model S vehicles in January 2019.</p>\n<p>Tesla remedied nearly 90 percent of all affected 2012 and 2013 Model S vehicles within one year after announcing its recall, and is now moving on to address the 2014-2016 models. Tesla has stated that owners do not need to be concerned if they have not been contacted yet: There is a schedule set in place for notifications to keep repairs moving smoothly, and most vehicles are not in the range of danger yet, as the air bags only become dangerous after a certain amount of time has passed since their manufacture.</p>\n<h3>The Solution</h3>\n<p>Tesla is currently continuing to contact customers to complete their air bag replacements. Owners of 2012-2013 Model S vehicles who have not yet received this replacement should schedule a service appointment. For 2014-2016 Model S, replacement parts are expected to be available by the spring of 2019, and Tesla will contact owners when the parts are ready.</p>\n<p>Tesla is encouraging the use of their Mobile Service for customers to have the airbag replaced in the convenience of their home, office or other location. Owners may also contact the NHTSA Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153), or go to www.safercar.gov.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16574","createdAt":"2019-01-27T05:31:06.000Z","date_gmt":"2019-01-27T19:16:06.000Z","updatedAt":"2020-09-29T06:24:17.000Z","modified_gmt":"2020-09-29T20:09:17.000Z","display_date":"January 27, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2019,"month":1,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/01/shutterstock_1495295081-1-768x508.jpg","alt_text":"","cld_public_id":"shutterstock_1495295081-1","category":{"id":21,"name":"Tesla","slug":"tesla-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/tesla-5-202912.png"},"tags":[],"categories":[{"id":21,"name":"Tesla","slug":"tesla-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/tesla-5-202912.png"}]},{"id":16576,"title":"Maserati recall covers 4,300 sports cars","link":"https://www.motorsafety.org/maserati-recall-covers-4300-sports-cars/","status":"publish","slug":"maserati-recall-covers-4300-sports-cars","excerpt":"<p>Maserati supercars from the Ghibli and Quattroporte lines have been recalled due to potentially leaking fuel lines.</p>\n","description":"<p>Modena, Italy, Jan. 27, 2019 &#8211; Manufacturers of high-specification sports cars are susceptible to the same recall cycles that afflict general-audience carmakers, and for the same types of problems. The <a href=\"https://static.nhtsa.gov/odi/rcl/2018/RCLRPT-18V831-6239.PDF\" target=\"_blank\" rel=\"noopener noreferrer\">recent recall</a> of over 4,000 Maserati&nbsp;vehicles for potentially defective fuel lines demonstrates this issue. While the number of vehicles is smaller than in recent recalls by Ford, Toyota and other large automakers, there are still thousands of cars on the roads with this potentially dangerous defect.</p>\n<p>According to a <a href=\"http://en.brinkwire.com/news/maserati-recalls-over-4300-vehicles-in-china/\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">wire news report</a> from market regulators in China, the models involved in the recall are the&nbsp;Quattroporte and Ghibli sports cars. The vehicles were manufactured between March 2013 and June 2015. The exact number of vehicles involved in the action comprises 3,282 Quattroporte models and 1,054 of the Ghibli. The cars were manufactured in Italy and imported for sale in China, where the defect was discovered.</p>\n<h2>The Defect</h2>\n<p>The potential problem in the recalled Maseratis comes from fuel line installation. Regulators have discovered that when fuel lines are installed incorrectly, as may have happened with the cars in question, there is an increased chance of gas leaking into the vehicle.</p>\n<p>Fuel line leaks pose a risk to drivers because they increase the chance of fires catching in the car. While the recall coming from the state administration in China warns of the dangers of incorrectly installed fuel lines, there was no clarification as to whether there have been leaks discovered in real-world situations, or whether the fault was discovered in a laboratory setting.</p>\n<h2>Timeline of Events</h2>\n<p>The Maserati vehicles involved in the current recall were manufactured concurrently between 2013 and 2015. The 3282 Quattroporte cars were made between March 22, 2013 and June 17, 2015. The Ghibli models impacted were produced between Sept. 27, 2013 and June 11, 2015. It is unclear from the recall announcement which model years were attached to these cars when they were sold.</p>\n<p>On January 27, the recall announcement was made by the State Administration for Market Regulation in China. The organization, part of the Chinese government, targeted only cars imported from Italy to China. It is therefore unknown whether Maserati&nbsp;cars made during the same period and exported elsewhere in the world will be recalled for a similar defect. In a note that may be relevant to this case, the National Highway Traffic Security Administration, the U.S. body that publicizes recalls, was just reopening from a federal government shutdown when China made its announcement.</p>\n<h2>The Solution</h2>\n<p>Drivers of the affected vehicles are asked to work with the automaker to have the hoses replaced. Dealerships will replace the affected parts at no cost to drivers. According to the news release, only the fuel lines have to be replaced, as there was no mention of related parts also needing to be switched out. This recall demonstrates that even a niche vehicle, imported into an overseas market, can encounter a recall for thousands of units. Due to the potentially fatal consequences of a vehicle fire, it&#8217;s clear that drivers of the affected cars should opt to have their dealers perform the necessary repairs.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16576","createdAt":"2019-01-27T05:30:56.000Z","date_gmt":"2019-01-27T19:15:56.000Z","updatedAt":"2020-10-21T23:28:22.000Z","modified_gmt":"2020-10-22T13:13:22.000Z","display_date":"January 27, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"18V831000","recall_date":"November 26, 2018"},"year":2019,"month":1,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/01/Black-2015-Maseratti-Quottroporte-768x512.jpg","alt_text":"","cld_public_id":"Black-2015-Maseratti-Quottroporte","category":{"id":13,"name":"Maserati","slug":"maserati","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/maserati_RM.png"},"tags":[{"id":1570,"name":"2014-2015 Maserati Ghibli recall","slug":"2014-2015-maserati-ghibli-recall"},{"id":1571,"name":"2014-2015 Maserati Quattroporte recall","slug":"2014-2015-maserati-quattroporte-recall"},{"id":1572,"name":"Maserati fuel line issue","slug":"maserati-fuel-line-issue"}],"categories":[{"id":13,"name":"Maserati","slug":"maserati","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/maserati_RM.png"}]},{"id":16622,"title":"Hyundai and Kia Recall Nearly 168,000 Vehicles for Potential Fuel Leaks and Fire Risk","link":"https://www.motorsafety.org/hyundai-and-kia-recall-nearly-168000-vehicles-for-potential-fuel-leaks-and-fire-risk/","status":"publish","slug":"hyundai-and-kia-recall-nearly-168000-vehicles-for-potential-fuel-leaks-and-fire-risk","excerpt":"<p>Hyundai Motor Co and affiliate Kia Motors Corp are recalling close to 168,000 U.S. vehicles at risk of fuel leaks.</p>\n","description":"<p>Laguna Hills, Calif. – Jan. 26, 2019 – Hyundai Motor Co and affiliate Kia Motors Corp are recalling close to 168,000 U.S. vehicles at risk of fuel leaks. This recall comes after a previous recall in 2017 for engine fire risks. The companies will also offer software upgrades for 3.7 million vehicles. The new recall covers 68,000 various Kia Optima, Sorento and Sportage vehicles from the 2011 through 2014 model years, and also affects 100,000 2011-2014 Hyundai Sonata and 2013-2014 Hyundai Santa Fe Sport vehicles.</p>\n<h2>The Defect</h2>\n<p>According to <a href=\"https://www.reuters.com/article/us-kia-motors-recall/hyundai-kia-issue-new-us-recall-of-168000-vehicles-for-fire-risks-idUSKCN1PA2HT\" target=\"_blank\" rel=\"noopener noreferrer\">Reuters</a>, engine replacements during the prior recall could have involved a high-pressure fuel pipe that may have been damaged or improperly installed. The faulty installation could increase the risk of fire. Hyundai and Kia now also state that the high-pressure fuel line may have been damaged, misaligned, or improperly adjusted during the engine replacement procedure. That could allow fuel to leak and increase the risk of fire.</p>\n<h2>Timeline of Events</h2>\n<p>According to Reuters, in 2015, Hyundai recalled 470,000 U.S. Sonata sedans. The reason for the recall was given as a possibility of engine failure that could result in a vehicle stall, increasing the risk of a crash. Kia did not recall its vehicles, which share the same &#8220;Theta II&#8221; engines, at that time.</p>\n<p>In 2016, a South Korean whistleblower reported concerns regarding this design flaw to NHTSA. The U.S. agency had been investigating the timeliness of three U.S. recalls, and the number of vehicles recalled.  In March 2017, Hyundai expanded the recall to include an additional 572,000 Sonata and Santa Fe Sport vehicles with &#8220;Theta II&#8221; engines, claiming a small amount of manufacturing debris was responsible for potential engine stall, and Kia recalled 618,000 Optima, Sorento and Sportage vehicles with the same engine at the same time.</p>\n<p>According to <a href=\"https://www.consumerreports.org/car-recalls-defects/hyundai-kia-recall-sedans-suvs-for-fire-risk/\" target=\"_blank\" rel=\"noopener noreferrer\">Consumer Reports</a>, in May 2017, the National Highway Traffic Safety Administration (NHTSA) opened a formal investigation into the recalls. The Center for Auto Safety (CAS), a consumer watchdog group, filed a formal petition with the NHTSA in June 2018 to investigate multiple fire complaints.</p>\n<h2>The Solution</h2>\n<p>Authorized dealers will inspect the connection between the high-pressure fuel pipe and the fuel pump outlet. If leaking fuel is detected, the dealer will replace the fuel pipe and properly install a new one, at no charge to owners.</p>\n<p>In addition to the recall, both automakers have announced a software update and warranty extension. This announcement affects approximately 2 million 2011-2018 Hyundai Sonata sedans and 2013-2018 Hyundai Santa Fe Sport SUVs, and about 1.6 million 2011-2018 Kia Optima sedans, 2012-2018 Kia Sorento SUVs, and 2011-2018 Kia Sportage SUVs. The software update is reported to protect the engine from damage that could lead to vibrations or stalling. Kia and Hyundai will also extend engine warranties to 10 years and 120,000 miles for owners of affected vehicles who contact their dealer for a free software update.</p>\n<p>Hyundai and Kia will notify owners of the recall details via first-class mail. Owners of affected vehicles may call Hyundai at 800-633-5151 or Kia at 800-333-4542. Owners may also contact the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153), or go to www.safercar.gov.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16622","createdAt":"2019-01-26T05:17:22.000Z","date_gmt":"2019-01-26T19:02:22.000Z","updatedAt":"2020-10-21T23:46:59.000Z","modified_gmt":"2020-10-22T13:31:59.000Z","display_date":"January 26, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"18V934000","recall_date":"December 28, 2018"},"year":2019,"month":1,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/01/White-Kia-Optima-768x512.jpg","alt_text":"","cld_public_id":"White-Kia-Optima","category":{"id":10,"name":"Hyundai","slug":"hyundai-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/hyundai_RM.png"},"tags":[{"id":1573,"name":"2013-2014 Hyundai Santa Fe Sport recall","slug":"2013-2014-hyundai-santa-fe-sport-recall"},{"id":1036,"name":"2013-2014 Hyundai Sonata recall","slug":"2013-2014-hyundai-sonata-recall"},{"id":498,"name":"Hyundai fire risk","slug":"hyundai-fire-risk"},{"id":1037,"name":"Hyundai fuel house recall","slug":"hyundai-fuel-house-recall"}],"categories":[{"id":10,"name":"Hyundai","slug":"hyundai-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/hyundai_RM.png"},{"id":32,"name":"Kia","slug":"kia-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/kia_RM.png"}]},{"id":16607,"title":"Ford recalls 182,000 2019 Ram 1500 trucks","link":"https://www.motorsafety.org/ford-recalls-182000-2019-ram-1500-trucks/","status":"publish","slug":"ford-recalls-182000-2019-ram-1500-trucks","excerpt":"","description":"<div class=\"video-wrapper feature-video\"><iframe src=\"https://player.vimeo.com/video/316848421?app_id=122963\" width=\"1170\" height=\"658\" frameborder=\"0\" title=\"FCA recalls 182,000 2019 Ram 1500 trucks\" allow=\"autoplay; fullscreen\" allowfullscreen></iframe></div>\n<p><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16607","createdAt":"2019-01-25T08:48:24.000Z","date_gmt":"2019-01-25T22:33:24.000Z","updatedAt":"2020-10-27T23:17:52.000Z","modified_gmt":"2020-10-28T13:02:52.000Z","display_date":"January 25, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2019,"month":1,"featured_image":null,"alt_text":"","cld_public_id":null,"category":null,"tags":[{"id":175,"name":"fasteners","slug":"fasteners"},{"id":170,"name":"steering","slug":"steering"}],"categories":[]},{"id":16512,"title":"Fiat Chrysler recalls 182,000 2019 Ram 1500 trucks","link":"https://www.motorsafety.org/fiat-chrysler-recalls-182000-2019-ram-1500-trucks-2/","status":"publish","slug":"fiat-chrysler-recalls-182000-2019-ram-1500-trucks-2","excerpt":"<p>Ram 1500 trucks may have problems with power steering caused by faulty electronics.</p>\n","description":"<p>&nbsp;</p>\n<p>January 25, 2019 &#8211; Auburn Hills, Mich. &#8211; Fiat Chrysler (FCA) has recalled approximately 182,000 Ram 1500 trucks from the 2019 model year. The problem is due to potential faults in the power steering system, as&nbsp;<a href=\"https://www.carcomplaints.com/news/2019/2019-ram-1500-recall-182000-trucks.shtml\" target=\"_blank\" rel=\"noopener noreferrer\">FCA announced</a> in a bulletin <a href=\"https://www.cbsnews.com/news/fiat-chrysler-recalls-182000-ram-trucks-over-power-steering-failures/\" target=\"_blank\" rel=\"noopener noreferrer\">picked up</a> by outlets such as Car Complaints and CBS. Many of the trucks are still on dealers&#8217; lots, limiting the scope of the action.</p>\n<p>The large-scale recall involves vehicles that have been produced in recent months. The potential problems won&#8217;t completely eliminate a driver&#8217;s ability to direct an affected truck, but steering will become much&nbsp;harder, potentially raising the risk of a collision. The recall is one of two issued by Fiat-Chrysler so far this year.</p>\n<h2>The Defect</h2>\n<p>In impacted Ram 1500 vehicles, fasteners within the battery circuit may have been secured incorrectly. When the connection loosens, power steering becomes inconsistent and the truck may have problems in over- or under-steer conditions. Due to the danger of driving with compromised steering, the 182,000 vehicles that may have the defect are all included in the recall.</p>\n<h2>Timeline of Events</h2>\n<p>The entire recall has occurred on a highly compressed timeline. All the vehicles involved were produced&nbsp;Oct.&nbsp;25, 2018 or later, according to FCA. The defect was discovered by internal testers rather than inspectors with a regulatory agency. Fortunately, there have been no accidents or injuries reported due to the problem thus far.</p>\n<p>Since all the vehicles included in the recall are so new, FCA&nbsp;explained that nearly one-third of the over 182,000 trucks affected have not left dealership lots yet and can simply be repaired before sale. The start date of the recall period has not yet been announced, but it will most likely&nbsp;come within 60 days of its announcement on Jan.&nbsp;25, 2019.</p>\n<h2>The Solution</h2>\n<p>Drivers with one of the over 100,000 affected Ram 1500 trucks should bring their vehicles in to Ram dealerships once the official recall period begins to have the battery fasteners repaired. The process will be provided by the dealerships, with Ram paying the bill. FCA&#8217;s phone number for owners of affected vehicles is 800-853-1403 and the automaker is readily available to answer further questions from drivers.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16512","createdAt":"2019-01-25T04:26:56.000Z","date_gmt":"2019-01-25T18:11:56.000Z","updatedAt":"2020-10-27T23:18:18.000Z","modified_gmt":"2020-10-28T13:03:18.000Z","display_date":"January 25, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2019,"month":1,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/01/shutterstock_1776186026-1-768x511.jpg","alt_text":"","cld_public_id":"shutterstock_1776186026-1","category":{"id":9,"name":"RAM","slug":"ram-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/11/RAM.png"},"tags":[],"categories":[{"id":9,"name":"RAM","slug":"ram-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/11/RAM.png"}]},{"id":16541,"title":"Ford Recalls Nearly 2,700 2019 Lincoln Vehicles for ADAS Issues","link":"https://www.motorsafety.org/ford-recalls-nearly-2700-2019-lincoln-vehicles-for-adas-issues/","status":"publish","slug":"ford-recalls-nearly-2700-2019-lincoln-vehicles-for-adas-issues","excerpt":"<p>Ford Motor Company recall nearly 3,000 Lincoln Nautilus SUVs with faulty software that manages the advanced drivers assist system. The system my fail to give important warnings to the driver. </p>\n","description":"<p>Laguna Hills, Calif. – January 25, 2018 – Ford Motor Company is recalling close to 2,700 2019 Lincoln Nautilus luxury SUVs due to issues with advance driver assist systems that govern the vehicles&#8217; steering control technology. The 2019 Nautilus has been presented by Ford as a refreshed version of the MKX SUV, with a choice between a 2.7-liter V6 turbo or a 2.0-liter four-cylinder turbo engine. The 2019 model also replaced the six-speed automatic transmission with an eight-speed one, turning the vehicle into a more powerful choice for drivers.</p>\n<h2>The Defect</h2>\n<p>According to&nbsp;<a href=\"https://www.cnet.com/roadshow/news/2019-lincoln-nautilus-recall-hands-off-warnings/\" target=\"_blank\" rel=\"noopener noreferrer nofollow\" data-auth=\"NotApplicable\">CNET</a>, the problem is related to software responsible for regulating the vehicle&#8217;s advanced driver assist systems. The vehicle may not detect if the driver is touching the steering wheel during time periods when the lane-centering system is activated. If there is a need for the driver to return their hands to the wheel, the system may fail to notify the driver to do so, which could increase the risk of a crash.</p>\n<h2>Timeline of Events</h2>\n<p>All the recalled vehicles were built at Ford&#8217;s Oakville Assembly Plant between Sept. 5 and Nov. 19, 2018. Most of the vehicles affected are located in the U.S., though a few hundred are in Canada. Ford is thus far unaware of any accidents or injuries related to this defect.</p>\n<p>This is the second recall to affect the 2019 Lincoln Nautilus. According to&nbsp;<a href=\"https://www.consumerreports.org/cars/lincoln/nautilus/2019/reliability#\" target=\"_blank\" rel=\"noopener noreferrer nofollow\" data-auth=\"NotApplicable\">Consumer Reports</a>, last December Ford recalled certain 2019 Nautilus vehicles that were not equipped with Adaptive Front Steering due to a plastic cover on the driver frontal air bag module which had the potential to detach during air bag deployment.</p>\n<h2>The Solution</h2>\n<p>Fixing the problem will not require any replacement hardware. Owners will be notified and instructed to take their vehicle to an approved dealer, where technicians will reflash the software in the power steering control module. This will reset the ADAS system to provide the correct level of hands-off detection when in use. Owners may contact the National Highway Traffic Safety Administration Vehicle Safety Hotline at 1-888-327-4236 (TTY 1-800-424-9153), or go to www.safercar.gov.&nbsp;The reference number for this recall is 19S02.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16541","createdAt":"2019-01-25T04:17:01.000Z","date_gmt":"2019-01-25T18:02:01.000Z","updatedAt":"2020-10-21T23:57:51.000Z","modified_gmt":"2020-10-22T13:42:51.000Z","display_date":"January 25, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V031000","recall_date":"January 14, 2019"},"year":2019,"month":1,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/01/2018-Gray-Lincoln-Nautilus-768x512.jpg","alt_text":"","cld_public_id":"2018-Gray-Lincoln-Nautilus","category":{"id":26,"name":"Lincoln","slug":"lincoln-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/lincoln_RM.png"},"tags":[{"id":1229,"name":"2019 Lincoln Nautilus recall","slug":"2019-lincoln-nautilus-recall"},{"id":1574,"name":"Lincoln steering control","slug":"lincoln-steering-control"}],"categories":[{"id":26,"name":"Lincoln","slug":"lincoln-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/lincoln_RM.png"}]},{"id":16528,"title":"Fiat Chrysler recalls 182,000 2019 Ram 1500 trucks","link":"https://www.motorsafety.org/fiat-chrysler-recalls-182000-2019-ram-1500-trucks/","status":"publish","slug":"fiat-chrysler-recalls-182000-2019-ram-1500-trucks","excerpt":"<p>January 25, 2019 &#8211; Auburn Hills, Mich. &#8211; Fiat Chrysler (FCA) has recalled approximately 182,000 Ram 1500 trucks from the 2019 model year. The problem is due to potential faults in the power steering system, as&nbsp;FCA announced&nbsp;in a bulletin&nbsp;picked up&nbsp;by outlets such as Car Complaints and CBS. Many of the trucks are still on dealers&#8217;</p>\n","description":"<p>January 25, 2019 &#8211; Auburn Hills, Mich. &#8211; Fiat Chrysler (FCA) has recalled approximately 182,000 Ram 1500 trucks from the 2019 model year. The problem is due to potential faults in the power steering system, as&nbsp;<a href=\"https://www.carcomplaints.com/news/2019/2019-ram-1500-recall-182000-trucks.shtml\" target=\"_blank\" rel=\"noopener noreferrer\" data-auth=\"NotApplicable\">FCA announced</a>&nbsp;in a bulletin&nbsp;<a href=\"https://www.cbsnews.com/news/fiat-chrysler-recalls-182000-ram-trucks-over-power-steering-failures/\" target=\"_blank\" rel=\"noopener noreferrer\" data-auth=\"NotApplicable\">picked up</a>&nbsp;by outlets such as Car Complaints and CBS. Many of the trucks are still on dealers&#8217; lots, limiting the scope of the action.</p>\n<p>The large-scale recall involves vehicles that have been produced in recent months. The potential problems won&#8217;t completely eliminate a driver&#8217;s ability to direct an affected truck, but steering will become much&nbsp;harder, potentially raising the risk of a collision. The recall is one of two issued by Fiat-Chrysler so far this year.</p>\n<h2>The Defect</h2>\n<p>In impacted Ram 1500 vehicles, fasteners within the battery circuit may have been secured incorrectly. When the connection loosens, power steering becomes inconsistent and the truck may have problems in over- or under-steer conditions. Due to the danger of driving with compromised steering, the 182,000 vehicles that may have the defect are all included in the recall.</p>\n<h2>Timeline of Events</h2>\n<p>The entire recall has occurred on a highly compressed timeline. All the vehicles involved were produced&nbsp;Oct.&nbsp;25, 2018 or later, according to FCA. The defect was discovered by internal testers rather than inspectors with a regulatory agency. Fortunately, there have been no accidents or injuries reported due to the problem thus far.</p>\n<p>Since all the vehicles included in the recall are so new, FCA&nbsp;explained that nearly one-third of the over 182,000 trucks affected have not left dealership lots yet and can simply be repaired before sale. The start date of the recall period has not yet been announced, but it will most likely&nbsp;come within 60 days of its announcement on Jan.&nbsp;25, 2019.</p>\n<h2>The Solution</h2>\n<p>Drivers with one of the over 100,000 affected Ram 1500 trucks should bring their vehicles in to Ram dealerships once the official recall period begins to have the battery fasteners repaired. The process will be provided by the dealerships, with Ram paying the bill. FCA&#8217;s phone number for owners of affected vehicles is 800-853-1403 and the automaker is readily available to answer further questions from drivers.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16528","createdAt":"2019-01-25T03:51:06.000Z","date_gmt":"2019-01-25T17:36:06.000Z","updatedAt":"2020-10-27T23:18:41.000Z","modified_gmt":"2020-10-28T13:03:41.000Z","display_date":"January 25, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2019,"month":1,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2017/06/ram_ms.png","alt_text":"","cld_public_id":"ram_ms","category":{"id":9,"name":"RAM","slug":"ram-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/11/RAM.png"},"tags":[],"categories":[{"id":9,"name":"RAM","slug":"ram-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/11/RAM.png"}]},{"id":16626,"title":"Ford recalls 2,200 SUVs with defective adaptive steering","link":"https://www.motorsafety.org/ford-recalls-2200-suvs-with-defective-adaptive-steering/","status":"publish","slug":"ford-recalls-2200-suvs-with-defective-adaptive-steering","excerpt":"","description":"<div class=\"video-wrapper feature-video\"><iframe src=\"https://player.vimeo.com/video/317582592?app_id=122963\" width=\"1170\" height=\"658\" frameborder=\"0\" title=\"Ford recalls 2,200 SUVs with defective adaptive steering\" allow=\"autoplay; fullscreen\" allowfullscreen></iframe></div>\n<p><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16626","createdAt":"2019-01-16T09:40:46.000Z","date_gmt":"2019-01-16T23:25:46.000Z","updatedAt":"2019-02-15T09:49:10.000Z","modified_gmt":"2019-02-15T23:34:10.000Z","display_date":"January 16, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":null,"nhtsa_campaign_number":null,"recall_date":null,"meta_title":null,"meta_description":null,"meta_keywords":null,"custom_schema":null},"year":2019,"month":1,"featured_image":null,"alt_text":"","cld_public_id":null,"category":{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"},"tags":[{"id":176,"name":"software","slug":"software"}],"categories":[{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"}]},{"id":16548,"title":"Infiniti recall update: Some cars with defect not included","link":"https://www.motorsafety.org/infiniti-recall-update-some-cars-with-defect-not-included/","status":"publish","slug":"infiniti-recall-update-some-cars-with-defect-not-included","excerpt":"<p>Nissan recalls several Nissan and Infiniti vehicles that may have defective air bag sensors.</p>\n","description":"<p> </p>\n<p>Nashville, Tenn., Jan. 15, 2019 &#8211; Infiniti&#8217;s recall of its EX35 sedan affected 200,000 vehicles that may have a faulty passenger-side air bag sensor.</p>\n<p>According to a <a href=\"https://www.nbcmiami.com/news/local/Womans-Car-Outside-Recall-Despite-Same-Defect-504397371.html\" target=\"_blank\" rel=\"noopener noreferrer\">recent NBC report</a>, this action did not target every car with the defect, despite its relatively large scale. Owners of vehicles from models outside the year range covered by the recall may find the same issue in their vehicles, but with those cars not covered by the complimentary replacement offer, the drivers have to pay out of pocket to safeguard their air bags.</p>\n<p>Looking back at the initial National Highway Traffic Safety Administration recall of Infiniti vehicles, <a href=\"https://cars.usnews.com/cars-trucks/daily-news/081016-urgent-recall-alert-nissan-infiniti-recalling-200-000-vehicles-for-airbag-defect\" target=\"_blank\" rel=\"noopener noreferrer\">reported back in 2008</a> by U.S. News &amp; World Report, the cars that did receive official notices for faulty passenger-side air bag sensors were:</p>\n<p>2007 &#8211; 2008</p>\n<ul>\n<li>Infiniti G35</li>\n<li>Infiniti G37</li>\n<li>Infiniti EX35</li>\n<li>Nissan Altima</li>\n<li>Nissan 350Z</li>\n<li>Nissan Rogue</li>\n<li>Nissan Murano.</li>\n</ul>\n<p>The vehicle still on the road that may contain the same part is a later model, the 2009 Infiniti G35. In total, more than 200,000 cars and sport utility vehicles were involved across the Infiniti and Nissan nameplates.</p>\n<h3>The Defect</h3>\n<p>The cars in question use an occupant classification system to determine whether to deploy an air bag on the passenger side in the case of a collision. The sensor involved in the recall is the part that tells a vehicle if there is someone in the right-side seat. When the component is defective, the air bag system may overlook the presence of a passenger, with the circuit becoming interrupted. In such a case, the airbag may fail to deploy and the occupants of the car would not be adequately protected.</p>\n<p>U.S. News noted at the time of the initial recall that many automakers had problems with passenger-side sensors in 2008. BMW and Hyundai recalled an combined 600,000 for similar issues. The newspaper recommended that even cars that haven&#8217;t officially been recalled should likely receive inspections. This proved to be relevant, as a similar defect appeared more than 10 years later.</p>\n<p>NBC explained the 2009 Infiniti found to have the defect was purchased new, and is now out of warranty. Several owners of vehicles made by Nissan and Infiniti have complained of similar defects to the NHTSA but been unable to receive free-of-charge service because their cars were produced after the 2007-2008 window included in the recall. A Center of Auto Safety representative replied that making complaints is important, as it helps set the recall process in motion.</p>\n<h3><strong>Timeline of Events</strong></h3>\n<p>All the cars involved in the recall come from the 2007 and 2008 model years, and they received an &#8220;urgent recall alert&#8221; in October 2008. The timeline becomes more complicated, however, when considering the possibility that the defect may occur on vehicles that haven&#8217;t yet received an official recall notice, more than 10 years after the fact. NBC published its report about this potential scenario in January 2019.</p>\n<h3>The Solution</h3>\n<p>Fixing the sensor problem involves using a detector to determine whether the part is defective, then replacing the entire seat cushion if there is a problem with the component. NBC reported that this process, when carried out on a car not covered by the recall, could cost over $4,000. Infiniti did offer to take on the majority of the cost in the case covered by the news organization, bringing the bill to $1,000. For recalled vehicles, the dealer does not charge to make the change.</p>\n\n\n<p></p>\n<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script>","source":"https://www.motorsafety.org/?p=16548","createdAt":"2019-01-15T04:31:11.000Z","date_gmt":"2019-01-15T18:16:11.000Z","updatedAt":"2020-10-12T04:15:05.000Z","modified_gmt":"2020-10-12T18:00:05.000Z","display_date":"January 15, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"08V521000","recall_date":"October 7, 2008"},"year":2019,"month":1,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/01/Red-2008-Infiniti-G35-768x512.jpg","alt_text":"","cld_public_id":"Red-2008-Infiniti-G35","category":{"id":40,"name":"Infiniti","slug":"infiniti","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/infiniti_RM.png"},"tags":[{"id":1024,"name":"2007 - 2008 Infiniti G35 recall","slug":"2007-2008-infiniti-g35-recall"},{"id":1025,"name":"2007 - 2008 Infiniti G37 recall","slug":"2007-2008-infiniti-g37-recall"},{"id":1028,"name":"2007 - 2008 Nissan 350Z recall","slug":"2007-2008-nissan-350z-recall"},{"id":1027,"name":"2007 - 2008 Nissan Altima recall","slug":"2007-2008-nissan-altima-recall"},{"id":1030,"name":"2007 - 2008 Nissan Murano recall","slug":"2007-2008-nissan-murano-recall"},{"id":1029,"name":"2007 - 2008 Nissan Rouge recall","slug":"2007-2008-nissan-rouge-recall"},{"id":1026,"name":"2007 2008 Infiniti EX35 recall","slug":"2007-2008-infiniti-ex35-recall"},{"id":1032,"name":"Infiniti airbag sensor recall","slug":"infiniti-airbag-sensor-recall"},{"id":1031,"name":"Nissan airbag sensor recall","slug":"nissan-airbag-sensor-recall"}],"categories":[{"id":40,"name":"Infiniti","slug":"infiniti","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/infiniti_RM.png"},{"id":14,"name":"Nissan","slug":"nissan-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/nissan_RM.png"}]},{"id":16486,"title":"Fiat Chrysler Adds 1.4 Million Vehicles to Takata Airbag Recall","link":"https://www.motorsafety.org/fiat-chrysler-adds-1-4-million-vehicles-to-takata-airbag-recall/","status":"publish","slug":"fiat-chrysler-adds-1-4-million-vehicles-to-takata-airbag-recall","excerpt":"<p>Fiat Chrysler Adds 1.4 Million Vehicles to Takata Airbag Recall Fiat Chrysler Automobiles (FCA) is adding 1.4 million vehicles in the U.S. to its list of those that should have their Takata airbag inflators replaced. The action includes Dodge, Chrysler, Jeep, and Ram vehicles. This latest announcement from FCA covers passenger-side front airbag inflators, and</p>\n","description":"<p><a href=\"https://www.consumerreports.org/car-recalls-defects/fiat-chrysler-adds-vehicles-to-takata-airbag-recall/\" target=\"_blank\" rel=\"noopener noreferrer\">Fiat Chrysler Adds 1.4 Million Vehicles to Takata Airbag Recall</a></p>\n<p><a href=\"https://www.consumerreports.org/car-recalls-defects/fiat-chrysler-adds-vehicles-to-takata-airbag-recall/\" target=\"_blank\" rel=\"noopener noreferrer\"><img loading=\"lazy\" class=\"alignleft\" src=\"https://article.images.consumerreports.org/prod/content/dam/CRO%20Images%202019/Cars/January/CR-Cars-InlineHero-2014-Dodge-Challenger-1-19\" alt=\"\" width=\"317\" height=\"178\"></a>Fiat Chrysler Automobiles (FCA) is adding 1.4 million vehicles in the U.S. to its list of those that should have their Takata airbag inflators replaced. The action includes Dodge, Chrysler, Jeep, and Ram vehicles.</p>\n<p>This latest announcement from FCA covers passenger-side front airbag inflators, and is part of the effort by the National Highway Traffic Safety Administration (NHTSA) and automakers to space out the&nbsp;<a href=\"https://www.consumerreports.org/car-recalls-defects/takata-airbag-recall-everything-you-need-to-know/\">replacement of Takata airbag inflators</a>&nbsp;based on the risk to drivers and passengers.</p>\n<p>The goal has been to get replacement inflators to vehicle owners in the highest-risk regions first, and then to the rest of the country later as the supply of replacement inflators grows. The last wave of recalls is scheduled for early in 2020&#8230;<a href=\"https://www.consumerreports.org/car-recalls-defects/fiat-chrysler-adds-vehicles-to-takata-airbag-recall/\" target=\"_blank\" rel=\"noopener noreferrer\">Read more on ConsumerReports.org</a><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16486","createdAt":"2019-01-11T05:14:39.000Z","date_gmt":"2019-01-11T18:59:39.000Z","updatedAt":"2020-10-27T06:55:00.000Z","modified_gmt":"2020-10-27T20:40:00.000Z","display_date":"January 11, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2019,"month":1,"featured_image":null,"alt_text":"","cld_public_id":null,"category":null,"tags":[],"categories":[]},{"id":16584,"title":"Ford recalls vehicles with defective engine components","link":"https://www.motorsafety.org/ford-recalls-vehicles-with-defective-engine-components-2/","status":"publish","slug":"ford-recalls-vehicles-with-defective-engine-components-2","excerpt":"<p>Ford Motor Company has recalled approximately 874,000 vehicles potentially equipped with defective engine components.</p>\n","description":"<p>&nbsp;</p>\n<p>Dearborn, Mich. &#8211; Jan. 10, 2019 &#8211; Ford Motor Company has recalled approximately 874,000 vehicles potentially equipped with <a href=\"https://media.ford.com/content/fordmedia/fna/us/en/news/2018/12/21/ford-motor-company-issues-safety-recall-for-select--ford-f-150--.html\">defective engine components</a>, according to a company press release. The campaign affects multiple models, including:</p>\n<ul>\n<li>2015-2019 Ford F-150 pickup trucks assembled between March 18, 2014, and Nov. 17, 2018, at manufacturing sites in Kansas City&nbsp;and Dearborn,&nbsp;Missouri.</li>\n<li>2017-2019 Ford Super Duty pickup trucks assembled between Oct. 8, 2014, and Nov. 17, 2018, at manufacturing sites in Avon Lake, Ohio and Louisville, Kentucky.</li>\n</ul>\n<p>More than 410,000 of the recalled vehicles were sold in U.S. dealerships, while the remainder wound up in the Canadian market.</p>\n<h2>The Defect</h2>\n<p>The vehicles involved in the action may contain AV outlet-compatible engine block heaters vulnerable to water intrusion. In the event that liquid enters these components, the cables and associated splice connectors within could corrode over time, increasing the likelihood of shorting. Should this occur, the engine block heater may falter or create an electrical current capable of tripping household breakers and&nbsp;ground-fault-circuit-interrupter outlets. That said, the defect does not pose a threat to occupants.</p>\n<p>Ford has received just&nbsp;one report detailing an instance of property damage linked to the defective component thus far.</p>\n<h2>Timeline of Events</h2>\n<p>The automaker has yet to release information on the investigation that yielded the recall.</p>\n<h2>The Solution</h2>\n<p>Ford has directed dealers to inspect and, if necessary, replace the defective&nbsp;engine block heaters installed in recalled vehicles free of charge. However, the company has yet to release an owner notification timeline. Those in need of immediate assistance prior to the start of the campaign can contact Ford customer service personnel by calling (800)&nbsp;392-3673. Owners can also reach out to&nbsp;the National Highway Traffic Safety Administration by calling the Vehicle Safety Hotline at (888) 327-4236.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16584","createdAt":"2019-01-10T11:47:38.000Z","date_gmt":"2019-01-11T01:32:38.000Z","updatedAt":"2020-09-29T07:10:49.000Z","modified_gmt":"2020-09-29T20:55:49.000Z","display_date":"January 10, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2019,"month":1,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/01/shutterstock_1139647283-1-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_1139647283-1","category":{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"},"tags":[],"categories":[{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"}]},{"id":16481,"title":"Ford recalls vehicles with defective engine components","link":"https://www.motorsafety.org/ford-recalls-vehicles-with-defective-engine-components/","status":"publish","slug":"ford-recalls-vehicles-with-defective-engine-components","excerpt":"<p>Dearborn, Mich. &#8211; Jan. 10, 2019 &#8211; Ford Motor Company has recalled approximately 874,000 vehicles potentially equipped with defective engine components, according to a company press release. The campaign affects multiple models, including: 2015-2019 Ford F-150 pickup trucks assembled between March 18, 2014, and Nov. 17, 2018, at manufacturing sites in Kansas City and Dearborn, Missouri. 2017-2019 Ford</p>\n","description":"<p>Dearborn, Mich. &#8211; Jan. 10, 2019 &#8211; Ford Motor Company has recalled approximately 874,000 vehicles potentially equipped with <a href=\"https://media.ford.com/content/fordmedia/fna/us/en/news/2018/12/21/ford-motor-company-issues-safety-recall-for-select--ford-f-150--.html\" target=\"_blank\" rel=\"noopener noreferrer\" data-auth=\"NotApplicable\">defective engine components</a>, according to a company press release. The campaign affects multiple models, including:</p>\n<ul>\n<li>2015-2019 Ford F-150 pickup trucks assembled between March 18, 2014, and Nov. 17, 2018, at manufacturing sites in Kansas City and Dearborn, Missouri.</li>\n<li>2017-2019 Ford Super Duty pickup trucks assembled between Oct. 8, 2014, and Nov. 17, 2018, at manufacturing sites in Avon Lake, Ohio and Louisville, Kentucky.</li>\n</ul>\n<p>More than 410,000 of the recalled vehicles were sold in U.S. dealerships, while the remainder wound up in the Canadian market.</p>\n<h2>The Defect</h2>\n<p>The vehicles involved in the action may contain AV outlet-compatible engine block heaters vulnerable to water intrusion. In the event that liquid enters these components, the cables and associated splice connectors within could corrode over time, increasing the likelihood of shorting. Should this occur, the engine block heater may falter or create an electrical current capable of tripping household breakers and ground-fault-circuit-interrupter outlets. That said, the defect does not pose a threat to occupants.</p>\n<p>Ford has received just one report detailing an instance of property damage linked to the defective component thus far.</p>\n<h2>Timeline of Events</h2>\n<p>The automaker has yet to release information on the investigation that yielded the recall.</p>\n<h2>The Solution</h2>\n<p>Ford has directed dealers to inspect and, if necessary, replace the defective engine block heaters installed in recalled vehicles free of charge. However, the company has yet to release an owner notification timeline. Those in need of immediate assistance prior to the start of the campaign can contact Ford customer service personnel by calling (800) 392-3673. Owners can also reach out to the National Highway Traffic Safety Administration by calling the Vehicle Safety Hotline at (888) 327-4236.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16481","createdAt":"2019-01-10T08:39:52.000Z","date_gmt":"2019-01-10T22:24:52.000Z","updatedAt":"2019-01-11T09:16:13.000Z","modified_gmt":"2019-01-11T23:01:13.000Z","display_date":"January 10, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":null,"nhtsa_campaign_number":null,"recall_date":null,"meta_title":null,"meta_description":null,"meta_keywords":null,"custom_schema":null},"year":2019,"month":1,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2017/05/ford_ms.png","alt_text":"Ford Recalls","cld_public_id":"ford_ms","category":{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"},"tags":[],"categories":[{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"}]},{"id":16484,"title":"Toyota, Lexus, Scion Recall 1.3 Million Vehicles for Takata Airbags","link":"https://www.motorsafety.org/toyota-lexus-scion-recall-1-3-million-vehicles-for-takata-airbags/","status":"publish","slug":"toyota-lexus-scion-recall-1-3-million-vehicles-for-takata-airbags","excerpt":"<p>Toyota, Lexus, Scion Recall 1.3 Million Vehicles for Takata Airbags Toyota is adding 1.3 million vehicles in the U.S. to its list of those that should have their Takata airbags inflators replaced. Lexus and Scion vehicles are also included in the recall. This latest announcement from Toyota covers passenger-side front airbag inflators, and is part</p>\n","description":"<div class=\"main-headline-section\">\n<div class=\"row\">\n<div class=\"headline col-xs-12 crux-offset--left crux-offset--right\">\n<div class=\"headline-par title headline\">\n<p class=\"headline crux-headline--standard\"><a href=\"https://www.consumerreports.org/car-recalls-defects/toyota-lexus-scion-recall-vehicles-for-takata-airbags/\" target=\"_blank\" rel=\"noopener noreferrer\">Toyota, Lexus, Scion Recall 1.3 Million Vehicles for Takata Airbags</a></p>\n</div>\n</div>\n</div>\n</div>\n<div class=\"additional-headline-section\">\n<div class=\"row\">\n<div class=\"subhead col-xs-12 crux-offset--left crux-offset--right\">\n<div class=\"subhead-par subhead title\">\n<p><a href=\"https://www.consumerreports.org/car-recalls-defects/toyota-lexus-scion-recall-vehicles-for-takata-airbags/\" target=\"_blank\" rel=\"noopener noreferrer\"><img loading=\"lazy\" class=\"alignleft\" src=\"https://article.images.consumerreports.org/prod/content/dam/CRO%20Images%202019/Cars/January/CR-Cars-Inline-2013-Toyota-Corolla-f-1-19\" alt=\"\" width=\"316\" height=\"168\"></a>Toyota is adding 1.3 million vehicles in the U.S. to its list of those that should have their Takata airbags inflators replaced. Lexus and Scion vehicles are also included in the recall.</p>\n<p>This latest announcement from Toyota covers passenger-side front airbag inflators, and is part of the effort by the National Highway Traffic Safety Administration (NHTSA) and automakers to space out the replacement of Takata airbag inflators based on the risk to drivers and passengers.</p>\n<p>The goal has been to get replacement inflators to vehicle owners in the highest-risk regions first, and then to the rest of the country later, as the supply of replacement inflators grew.&nbsp;The last wave of recalls is scheduled for early in 2020&#8230;<a href=\"https://www.consumerreports.org/car-recalls-defects/toyota-lexus-scion-recall-vehicles-for-takata-airbags/\" target=\"_blank\" rel=\"noopener noreferrer\">Read more on ConsumerReports.org</a></p>\n</div>\n</div>\n</div>\n</div>\n<p><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16484","createdAt":"2019-01-10T05:12:13.000Z","date_gmt":"2019-01-10T18:57:13.000Z","updatedAt":"2020-10-18T21:09:15.000Z","modified_gmt":"2020-10-19T10:54:15.000Z","display_date":"January 10, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2019,"month":1,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/01/New-Lexus-IS-300h-768x512.jpg","alt_text":"","cld_public_id":"New-Lexus-IS-300h","category":{"id":29,"name":"Lexus","slug":"lexus-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/lexus_ms.png"},"tags":[],"categories":[{"id":29,"name":"Lexus","slug":"lexus-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/lexus_ms.png"},{"id":169,"name":"Scion","slug":"scion-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/scion_RM.png"},{"id":17,"name":"Toyota","slug":"toyota-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/toyota_ms.png"}]},{"id":16535,"title":"Toyota recalls more Takata airbag inflators &#8211; 1.3 million vehicles involved","link":"https://www.motorsafety.org/toyota-recalls-more-takata-airbag-inflators-1-3-million-vehicles-involved/","status":"publish","slug":"toyota-recalls-more-takata-airbag-inflators-1-3-million-vehicles-involved","excerpt":"<p>Plano, Texas, Jan. 9, 2019 &#8211; Toyota has announced a planned expansion of recalls affecting vehicles with Takata air bag inflators that may rupture, hurling potentially deadly shrapnel at vehicle occupants. This recall has already involved millions of cars and trucks worldwide, across a broad spectrum of manufacturers and brands. This new round of affected</p>\n","description":"<p>Plano, Texas, Jan. 9, 2019 &#8211; Toyota has announced a planned expansion of recalls affecting vehicles with Takata air bag inflators that may rupture, hurling potentially deadly shrapnel at vehicle occupants. This recall has already involved millions of cars and trucks worldwide, across a broad spectrum of manufacturers and brands.</p>\n<p>This new round of affected vehicles includes both Toyota and Lexus models. The latest recall involves the following cars and trucks:</p>\n<ul>\n<li><strong>2010-2016 Toyota 4Runner</strong></li>\n<li><strong>2010-2013 Toyota Corolla</strong></li>\n<li><strong>2010-2013 Toyota Matrix</strong></li>\n<li><strong>2011-2014 Toyota Sienna</strong></li>\n<li><strong>2010-2015 Scion XB</strong></li>\n<li><strong>2010-2012 Lexus ES 350</strong></li>\n<li><strong>2010-2017 Lexus GX 460</strong></li>\n<li><strong>2010-2015 Lexus IS 250C</strong></li>\n<li><strong>2010-2015 Lexus IS 350C</strong></li>\n<li><strong>2010-2013 Lexus IS 250</strong></li>\n<li><strong>2010-2013 Lexus IS 350</strong></li>\n<li><strong>2010-2014 Lexus IS-F</strong></li>\n</ul>\n<h2>The Defect</h2>\n<p>The problem with the Takata inflators is one of the most serious defects to be revealed in recent years. When the propellants used in the parts degrade in high heat, humidity and temperature cycling, activation may result in a rupture in the air bag inflator. Ruptured air bags can throw sharp metal fragments at the occupants of vehicles, injuring or even killing them.</p>\n<p>The danger from these potentially deadly air bags increases over time, which is why the Takata recall began with earlier cars. The <a href=\"https://www.nhtsa.gov/equipment/takata-recall-spotlight\" target=\"_blank\" rel=\"noopener noreferrer\" data-auth=\"NotApplicable\">National Highway Traffic Safety Association</a> has been coordinating the cycles of recalls. In total, the department is targeting 37 million vehicles. The most dangerous type of Takata air bag, designated &#8220;alpha,&#8221; is found in vehicles older than those recently recalled by Toyota &#8211; owners of those cars were notified during the beginning of the recall.</p>\n<h2>Timeline of Events</h2>\n<p>The waves of the Takata recall have been <a href=\"https://www.nhtsa.gov/recall-spotlight/state-takata-recalls\" target=\"_blank\" rel=\"noopener noreferrer\" data-auth=\"NotApplicable\">ongoing since 2015</a>. Unlike other recalls that are determined based on laboratory testing or safety inspections, the air bag inflator fault was discovered after several deadly accidents involving the compromised parts. The recall began with the vehicles most likely to contain high-risk inflators, with waves of new announcements following every few months.</p>\n<p>According to Toyota, owners of the mentioned in the latest stage of the recall will receive letters in late January alerting them to the need to receive service for their vehicles.</p>\n<h2>The Solution</h2>\n<p>As with other stages of the Takata recall, the solution for the current round of air bag repairs involves replacing either the inflator or the whole airbag assembly, depending on the model of car in question. The modification will be carried out by Toyota and Lexus dealerships and repair work will be offered at no charge to drivers.</p>\n<p>The automaker noted that it has been working on outreach efforts to ensure as many motorists as possible realize they need to have their vehicles repaired. Through practices such as holding events and working with third-party organizations, Toyota and the other carmakers using Takata air bag inflators have been publicizing the recall for the past few years.</p>\n<h2><strong>Is your vehicle part of the recall?</strong></h2>\n<p>Nearly 1.3 million vehicles were originally part of this recall. <span data-sheets-value=\"{&quot;1&quot;:2,&quot;2&quot;:&quot;As of April 9, 2021, – the last date for which information was available – 1,060,060 airbags had been replaced. To see if your car still needs to be repaired, use MotorSafety’s free lookup tool.&quot;}\" data-sheets-userformat=\"{&quot;2&quot;:769,&quot;3&quot;:{&quot;1&quot;:0},&quot;11&quot;:4,&quot;12&quot;:0}\" data-sheets-formula=\"=Concatenate(&quot;As of &quot;,R[0]C[4],&quot;, – the last date for which information was available – &quot;,R[0]C[11],&quot; airbags had been replaced. To see if your car still needs to be repaired, use MotorSafety’s free lookup tool.&quot;)\">As of April 9, 2021, – the last date for which information was available – 1,060,060 airbags had been replaced. To see if your car still needs to be repaired, use MotorSafety’s</span><a href=\"https://www.motorsafety.org/\"> free lookup tool</a>.</p>\n","source":"https://www.motorsafety.org/?p=16535","createdAt":"2019-01-09T04:05:57.000Z","date_gmt":"2019-01-09T17:50:57.000Z","updatedAt":"2021-06-18T11:16:56.000Z","modified_gmt":"2021-06-19T01:01:56.000Z","display_date":"January 09, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V005000","recall_date":"January 9, 2019","meta_title":"","meta_description":"","meta_keywords":"","custom_schema":""},"year":2019,"month":1,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/01/shutterstock_1492579808-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_1492579808","category":{"id":29,"name":"Lexus","slug":"lexus-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/lexus_ms.png"},"tags":[{"id":1575,"name":"Lexus airbag recall","slug":"lexus-airbag-recall"},{"id":635,"name":"Takata air bags","slug":"takata-air-bags"},{"id":1057,"name":"Toyota airbag recall","slug":"toyota-airbag-recall"}],"categories":[{"id":29,"name":"Lexus","slug":"lexus-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/06/lexus_ms.png"},{"id":169,"name":"Scion","slug":"scion-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/scion_RM.png"},{"id":17,"name":"Toyota","slug":"toyota-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2017/05/toyota_ms.png"}]},{"id":16411,"title":"More Takata Airbags Recalled","link":"https://www.motorsafety.org/more-takata-airbags-recalled/","status":"publish","slug":"more-takata-airbags-recalled","excerpt":"<p>Fords (NYSE:F) has recalled nearly 800,000 vehicles equipped with Takata airbags that may explode, shooting shrapnel at vehicle occupants. The recall includes the following models: 2010 Ford Edge 2010 Lincoln MKX 2010-2011 Ford Ranger 2010-2012 Ford Fusion 2010-2012 Lincoln MKZ, 2010-2011 Mercury Milan 2010 -2014 Ford Mustang Millions of makes and models have been recalled</p>\n","description":"<p>Fords (NYSE:F) has recalled nearly 800,000 vehicles equipped with Takata airbags that may explode, shooting shrapnel at vehicle occupants. The recall includes the following models:</p>\n<ul>\n<li><strong>2010 Ford Edge </strong></li>\n<li><strong>2010 Lincoln MKX</strong></li>\n<li><strong>2010-2011 Ford Ranger</strong></li>\n<li><strong>2010-2012 Ford Fusion</strong></li>\n<li><strong>2010-2012 Lincoln MKZ,</strong></li>\n<li><strong>2010-2011 Mercury Milan</strong></li>\n<li><strong>2010 -2014 Ford Mustang</strong></li>\n</ul>\n<p>Millions of makes and models have been recalled for dangerous Takata airbags. Check all your cars<a href=\"http://motorsafety.org\"> here </a>for Takata airbag recalls and other possible recalls.</p>\n<h3>The repair</h3>\n<p>Recall repairs are FREE. Some dealers can help make repairs more convenient. Ask for a loaner, mobile repair or what else they can do to make it easier to repair your car right away.</p>\n<p>Even if your car’s recalled airbag has been repaired, you could be subject to<em> newer</em> airbag recalls.</p>\n<h2><strong>Is your vehicle part of the recall?</strong></h2>\n<p>Over 800,000 vehicles were originally part of this recall. <span data-sheets-value=\"{&quot;1&quot;:2,&quot;2&quot;:&quot;As of April 9, 2021, – the last date for which information was available – 583,909 airbags had been replaced.&quot;}\" data-sheets-userformat=\"{&quot;2&quot;:769,&quot;3&quot;:{&quot;1&quot;:0},&quot;11&quot;:4,&quot;12&quot;:0}\" data-sheets-formula=\"=Concatenate(&quot;As of &quot;,R[0]C[4],&quot;, – the last date for which information was available – &quot;,R[0]C[11],&quot; airbags had been replaced.&quot;)\">As of April 9, 2021, – the last date for which information was available – 583,909 airbags had been replaced.</span><span data-sheets-value=\"{&quot;1&quot;:2,&quot;2&quot;:&quot;As of April 9, 2021, 958,175 airbags had been replaced, with 400,346 remaining.&quot;}\" data-sheets-userformat=\"{&quot;2&quot;:769,&quot;3&quot;:{&quot;1&quot;:0},&quot;11&quot;:4,&quot;12&quot;:0}\"> </span>To see if your car still needs to be repaired, use MotorSafety’s<a href=\"https://www.motorsafety.org/\"> free lookup tool</a>.</p>\n<p><script src=\"\" type=\"text/javascript\"></script><script src=\"\" type=\"text/javascript\"></script><script src=\"\" type=\"text/javascript\"></script></p>\n","source":"https://www.motorsafety.org/?p=16411","createdAt":"2019-01-09T04:03:13.000Z","date_gmt":"2019-01-09T17:48:13.000Z","updatedAt":"2021-06-18T11:24:48.000Z","modified_gmt":"2021-06-19T01:09:48.000Z","display_date":"January 09, 2019","sticky":false,"recall":true,"authors":[{"id":18,"name":"Sandra Thomas","slug":"sthomas"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":"","meta_title":"","meta_description":"","meta_keywords":"","custom_schema":""},"year":2019,"month":1,"alt_text":"","cld_public_id":null,"category":null,"tags":[{"id":168,"name":"airbag","slug":"airbag"},{"id":165,"name":"ford","slug":"ford"},{"id":167,"name":"january","slug":"january"},{"id":162,"name":"recall","slug":"recall"},{"id":166,"name":"takata","slug":"takata"}],"categories":[]},{"id":16630,"title":"Ford recalls dozens of EcoSport vehicles due to insufficient welds","link":"https://www.motorsafety.org/ford-recalls-dozens-of-ecosport-vehicles-due-to-insufficient-welds/","status":"publish","slug":"ford-recalls-dozens-of-ecosport-vehicles-due-to-insufficient-welds","excerpt":"","description":"<div class=\"video-wrapper feature-video\"><iframe src=\"https://player.vimeo.com/video/317583758?app_id=122963\" width=\"1170\" height=\"658\" frameborder=\"0\" title=\"Ford recalls dozens of EcoSport vehicles due to insufficient welds\" allow=\"autoplay; fullscreen\" allowfullscreen></iframe></div>\n<p><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16630","createdAt":"2019-01-04T09:45:48.000Z","date_gmt":"2019-01-04T23:30:48.000Z","updatedAt":"2019-02-15T09:46:40.000Z","modified_gmt":"2019-02-15T23:31:40.000Z","display_date":"January 04, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":null,"nhtsa_campaign_number":null,"recall_date":null,"meta_title":null,"meta_description":null,"meta_keywords":null,"custom_schema":null},"year":2019,"month":1,"featured_image":null,"alt_text":"","cld_public_id":null,"category":{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"},"tags":[{"id":177,"name":"weld","slug":"weld"}],"categories":[{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"}]},{"id":16628,"title":"Ford recalls 953,000 vehicles due to faulty Takata airbags","link":"https://www.motorsafety.org/ford-recalls-953000-vehicles-due-to-faulty-takata-airbags/","status":"publish","slug":"ford-recalls-953000-vehicles-due-to-faulty-takata-airbags","excerpt":"","description":"<div class=\"video-wrapper feature-video\"><iframe src=\"https://player.vimeo.com/video/317583744?app_id=122963\" width=\"1170\" height=\"658\" frameborder=\"0\" title=\"Ford recalls 953,000 vehicles due to faulty Takata airbags\" allow=\"autoplay; fullscreen\" allowfullscreen></iframe></div>\n<p><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16628","createdAt":"2019-01-04T09:44:18.000Z","date_gmt":"2019-01-04T23:29:18.000Z","updatedAt":"2019-02-15T09:45:35.000Z","modified_gmt":"2019-02-15T23:30:35.000Z","display_date":"January 04, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":null,"nhtsa_campaign_number":null,"recall_date":null,"meta_title":null,"meta_description":null,"meta_keywords":null,"custom_schema":null},"year":2019,"month":1,"featured_image":null,"alt_text":"","cld_public_id":null,"category":{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"},"tags":[{"id":168,"name":"airbag","slug":"airbag"}],"categories":[{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"}]},{"id":16479,"title":"Ford recalls over 953,000 vehicles to replace inflators","link":"https://www.motorsafety.org/ford-recalls-over-953000-vehicles-to-replace-inflators/","status":"publish","slug":"ford-recalls-over-953000-vehicles-to-replace-inflators","excerpt":"<p>Ford recalls over 953,000 vehicles to replace inflators DETROIT (AP) — Ford is recalling more than 953,000 vehicles worldwide to replace Takata passenger air bag inflators that can explode and hurl shrapnel. The move includes over 782,000 vehicles in the U.S. and is part of the largest series of recalls in U.S. history. Included are</p>\n","description":"<p><a href=\"https://www.apnews.com/b2c01be0f2654b32973dbfcd9756021e\" target=\"_blank\" rel=\"noopener noreferrer\">Ford recalls over 953,000 vehicles to replace inflators</a></p>\n<p>DETROIT (AP) — Ford is recalling more than 953,000 vehicles worldwide to replace Takata passenger air bag inflators that can explode and hurl shrapnel.</p>\n<p>The move includes over 782,000 vehicles in the U.S. and is part of the largest series of recalls in U.S. history.</p>\n<p>Included are the 2010 Ford Edge and Lincoln MKX, the 2010 and 2011 Ford Ranger, the 2010 to 2012 Ford Fusion and Lincoln MKZ, the 2010 and 2011 Mercury Milan, and the 2010 to 2014 Ford Mustang&#8230;<a href=\"https://www.apnews.com/b2c01be0f2654b32973dbfcd9756021e\" target=\"_blank\" rel=\"noopener noreferrer\">Read more on APNews.com</a><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16479","createdAt":"2019-01-04T09:10:26.000Z","date_gmt":"2019-01-04T22:55:26.000Z","updatedAt":"2021-01-04T10:40:48.000Z","modified_gmt":"2021-01-05T00:25:48.000Z","display_date":"January 04, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":"","meta_title":"","meta_description":"","meta_keywords":"","custom_schema":""},"year":2019,"month":1,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/01/shutterstock_295897607-1-768x511.jpg","alt_text":"","cld_public_id":"shutterstock_295897607-1","category":{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"},"tags":[],"categories":[{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"},{"id":26,"name":"Lincoln","slug":"lincoln-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/lincoln_RM.png"},{"id":42,"name":"Mercury","slug":"mercury-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/mercury.png"}]},{"id":16515,"title":"Ford recalls 2019 EcoSport","link":"https://www.motorsafety.org/ford-recalls-2019-ecosport/","status":"publish","slug":"ford-recalls-2019-ecosport","excerpt":"<p>Fewer than 100 Ford EcoSport crossovers from the 2019 model year are being recalled for an insufficient seat weld.</p>\n","description":"<p>&nbsp;</p>\n<p>Dearborn, Mich., January 4, 2019 &#8211; Ford Motor Company recently issued a recall&nbsp;for some 2019 EcoSport Vehicles. <a href=\"https://media.ford.com/content/fordmedia/fna/us/en/news/2019/01/04/ford-motor-company-issues-two-recalls-in-north-america.html\" target=\"_blank\" rel=\"noopener noreferrer\">According to a Ford press release</a>, some of the vehicles from this model year possess a weak weld holding the front seats in place.</p>\n<p>This recall is relatively small in scale, affecting fewer than 100 of the crossovers throughout North America. With approximately 87 EcoSport vehicles affected in total, 63 are located in the U.S. and its federalized territories, while 13 are in Canada. The recall&#8217;s internal Ford reference number is 18C08.</p>\n<h2>The Defect</h2>\n<p>The weld between two parts of these&nbsp;vehicles&#8217; front seats, the A-bracket and the side member, has been declared too weak in the affected crossovers. An insufficient seat weld may increase the risk of motorists being injured or killed in a collision. The Ford vehicles are thus&nbsp;in violation of the National Highway Traffic Safety Administration&#8217;s&nbsp;Federal Motor Vehicle Safety Standards 207 and 210, which pertain to the strength of seat backs.</p>\n<h2>Timeline of Events</h2>\n<p>As the vehicles affected by the recent recall are from a recent model year, the discovery of the defect and the recall process have played out over a short period of&nbsp;time. Ford announced the recall in early January, along&nbsp;with a separate recall regarding the ongoing process of taking potentially dangerous&nbsp;Takata airbag inflators off the market.</p>\n<p>Ford did not indicate how the company realized its 2019 EcoSport crossovers were in violation of FMVSS regulations, or&nbsp;whether the report came from the&nbsp;NHTSA&nbsp;or internal inspections. It did note that thus far no accidents or injuries related to the defect have been reported to Ford.</p>\n<h2>The Solution</h2>\n<p>Owners of affected vehicles should go to their Ford dealers to receive repairs. Though the problem with the vehicles is associated with a single weld, the entire front seats of the EcoSport crossovers are compromised. Instead of making a smaller change, the dealers are ordered to replace the front seats of affected cars completely to bring them back into compliance with FMVSS.<script src='' type='text/javascript'></script><script src='' type='text/javascript'></script><script src='' type='text/javascript'></script></p>\n","source":"https://www.motorsafety.org/?p=16515","createdAt":"2019-01-04T04:19:10.000Z","date_gmt":"2019-01-04T18:04:10.000Z","updatedAt":"2020-09-29T07:38:16.000Z","modified_gmt":"2020-09-29T21:23:16.000Z","display_date":"January 04, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"","recall_date":""},"year":2019,"month":1,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/01/shutterstock_664239211-1-768x512.jpg","alt_text":"","cld_public_id":"shutterstock_664239211-1","category":{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"},"tags":[],"categories":[{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"}]},{"id":16526,"title":"Ford expands Takata airbag inflator recall","link":"https://www.motorsafety.org/ford-expands-takata-airbag-inflator-recall/","status":"publish","slug":"ford-expands-takata-airbag-inflator-recall","excerpt":"<p>Ford Motor company continues to increase their recall of vehicles with Takata airbag components. Current airbag recall includes Models from Ford, Mercury and Lincoln. </p>\n","description":"<p><em>Dearborn, MI, January 4, 2019</em> &#8211; Ford Motor Company (NYSE:F) recently increased the scope of its recall of vehicles including airbag inflator components provided by Takata, <a href=\"https://media.ford.com/content/fordmedia/fna/us/en/news/2019/01/04/ford-motor-company-issues-two-recalls-in-north-america.html\" target=\"_blank\" rel=\"noopener noreferrer nofollow\" data-auth=\"NotApplicable\">according to a company press release</a>. Airbags containing Takata parts have been associated with several other waves of recalls over the past few years, encompassing multiple automakers.</p>\n<p>The latest extension of the Ford recall is approximately 782,384-strong and targets the following models:</p>\n<ul>\n<li>2010 Ford Edge and Lincoln MKX</li>\n<li>2010-2011 Ford Ranger</li>\n<li>2010-2012 Ford Fusion</li>\n<li>2010-2012 Ford Fusion, 2010-2012 Lincoln MKZ</li>\n<li>2010-2011 Mercury Milan</li>\n<li>2010-2014 Ford Mustang</li>\n</ul>\n<h2>Recall summary</h2>\n<p>Airbag inflators manufactured by Takata may be defective, which could make the airbag&#8217;s components explode instead of deploying properly in the event of a collision. The current wave of the Ford recall centers around the aforementioned vehicles&#8217; front passenger-side airbags. Since Takata provided so many components to such a wide variety of auto manufacturers, the recall has taken place in multiple phases,  targeting various components of vehicles made by multiple manufacturers.</p>\n<p>A crash in which an airbag explosion occurred could cause serious injury or death to motorists, adding urgency to the multi-stage recall. Ford did note in its press release that there haven&#8217;t yet been any injuries or deaths directly linked to the kinds of passenger-side inflators included in this round of the recall expansion.</p>\n<p>The latest expansion of the Takata recall is part of a rolling schedule implemented by the <a href=\"https://www.nhtsa.gov/equipment/takata-recall-spotlight\" target=\"_blank\" rel=\"noopener noreferrer\" data-auth=\"NotApplicable\">National Highway Traffic Safety Administration</a>. The agency noted that since the recall includes &#8220;tens of millions&#8221; of vehicles, beginning with the riskiest types of cars, mostly vehicles produced in 2006 and earlier. The order of the recall is based on both year of manufacture and the relative heat and humidity of regions &#8211; hot, humid conditions exacerbate the problems with airbags and increase risk. The entire schedule began in November 2015, <a href=\"https://www.nhtsa.gov/recall-spotlight/state-takata-recalls\" target=\"_blank\" rel=\"noopener noreferrer\" data-auth=\"NotApplicable\">according to the NHTSA</a>, and is intended to conclude at the end of 2019.</p>\n<p>The vehicles included in the latest Ford recall were manufactured between 2008 and 2012. The potential fault in these airbags has been known since the early days of the overall Takata recall, but due to the logistical need to handle the repairs in waves, they are only being serviced now.</p>\n<h2>The repair</h2>\n<p>Owners of affected Ford vehicles &#8211; or any other cars involved in the Takata recall thus far &#8211; should go to a local dealership, where the frontal passenger-side airbag inflator or airbag module will be replaced, with the manufacturer paying for the repairs. The reference number assigned to this latest recall by Ford is 19S01.</p>\n<h2><strong>Is your vehicle part of the recall?</strong></h2>\n<p>Over 782,000 vehicles were originally part of this recall. <span data-sheets-value=\"{&quot;1&quot;:2,&quot;2&quot;:&quot;As of April 9, 2021 – the last date information was available – 583,909 airbags had been replaced.&quot;}\" data-sheets-userformat=\"{&quot;2&quot;:14595,&quot;3&quot;:{&quot;1&quot;:0},&quot;4&quot;:{&quot;1&quot;:2,&quot;2&quot;:16777215},&quot;11&quot;:4,&quot;14&quot;:{&quot;1&quot;:2,&quot;2&quot;:0},&quot;15&quot;:&quot;Arial&quot;,&quot;16&quot;:10}\" data-sheets-formula=\"=Concatenate(&quot;As of &quot;,R[0]C[4],&quot; – the last date information was available – &quot;,R[0]C[11],&quot; airbags had been replaced.&quot;)\">As of April 9, 2021 – the last date information was available – 583,909 airbags had been replaced.</span><span data-sheets-value=\"{&quot;1&quot;:2,&quot;2&quot;:&quot;As of April 9, 2021, 958,175 airbags had been replaced, with 400,346 remaining.&quot;}\" data-sheets-userformat=\"{&quot;2&quot;:769,&quot;3&quot;:{&quot;1&quot;:0},&quot;11&quot;:4,&quot;12&quot;:0}\"> </span>To see if your car still needs to be repaired, use MotorSafety’s<a href=\"https://www.motorsafety.org/\"> free lookup tool</a>.</p>\n","source":"https://www.motorsafety.org/?p=16526","createdAt":"2019-01-04T03:47:51.000Z","date_gmt":"2019-01-04T17:32:51.000Z","updatedAt":"2021-06-23T08:48:28.000Z","modified_gmt":"2021-06-23T22:33:28.000Z","display_date":"January 04, 2019","sticky":false,"recall":true,"authors":[{"id":5,"name":"Sean Reyes","slug":"sreyes"}],"acf":{"recall_master_id":"","nhtsa_campaign_number":"19V001000","recall_date":"January 7, 2019","meta_title":"","meta_description":"","meta_keywords":"","custom_schema":""},"year":2019,"month":1,"featured_image":"https://www.motorsafety.org/wp-content/uploads/2019/01/Tan-2018-Ford-Edge-768x512.jpg","alt_text":"","cld_public_id":"Tan-2018-Ford-Edge","category":{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"},"tags":[{"id":1576,"name":"2010 Ford Edge recall","slug":"2010-ford-edge-recall"},{"id":1577,"name":"2010 Lincoln MKX recall","slug":"2010-lincoln-mkx-recall"},{"id":1578,"name":"2010-2011 Ford Ranger recall","slug":"2010-2011-ford-ranger-recall"},{"id":1581,"name":"2010-2011 Mercury Milan recall","slug":"2010-2011-mercury-milan-recall"},{"id":1579,"name":"2010-2012 Ford Fusion recall","slug":"2010-2012-ford-fusion-recall"},{"id":1580,"name":"2010-2012 Lincoln MKZ recall","slug":"2010-2012-lincoln-mkz-recall"},{"id":1582,"name":"2010-2014 Ford Mustang recall","slug":"2010-2014-ford-mustang-recall"},{"id":1583,"name":"Ford airbag recall","slug":"ford-airbag-recall"},{"id":1584,"name":"Lincoln airbag recall","slug":"lincoln-airbag-recall"},{"id":635,"name":"Takata air bags","slug":"takata-air-bags"}],"categories":[{"id":3,"name":"Ford","slug":"ford-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/ford_RM.png"},{"id":26,"name":"Lincoln","slug":"lincoln-recalls","image":"https://www.motorsafety.org/wp-content/uploads/2020/07/lincoln_RM.png"}]}]